Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: LVM does *not* provide any replication. Typically, administrators configure RAID on nodes that use LVM as block storage to protect against failures of individual hard drives. However, RAID does not protect against a failure of the entire host.
tr_tr: LVM herhangi bir yedeklilik *sunmaz*. Genellikle yöneticiler LVM'i blok depolama olarak kullanan düğümler üzerinde RAID yapılandırarak hard disklerin arızalanması durumuna karşı koruma sağlarlar. Ancak RAID tüm bir sunucunun arızalanması durumunda koruma sağlayamaz.

source: Larger rack-mounted servers, such as 4U servers, often provide even greater CPU capacity, commonly supporting four or even eight CPU sockets. These servers have greater expandability, but such servers have much lower server density and are often more expensive.
tr_tr: 4U sunucular gibi daha geniş kabine-bağlı sunucular genellikle daha büyük, dört ya da sekiz işlemci soketine sahip işlemci kapasitesi sağlarlar. Bu sunucuların genişleyebilirliği büyük olsa da, sunucu yoğunlukları düşüktür ve genellikle daha pahalıdırlar.

source: Latency
tr_tr: Gecikme

source: Layer networking choices
tr_tr: Katman ağ seçimleri

source: Layer-2 Ethernet usage has additional benefits over layer-3 IP network usage:
tr_tr: Katman-2 Ethernet kullanımının katman-3 IP ağı kullanımına göre ek faydaları bulunur:

source: Layer-2 architecture limitations
tr_tr: Katman-2 mimari kısıtlamaları

source: Layer-2 network architectures have some limitations that become noticeable when used outside of traditional data centers.
tr_tr: Katman-2 ağ mimarileri geleneksel veri merkezlerinin dışına çıkıldığında fark edilebilen bazı kısıtlamalara sahiptirler.

source: Layer-3 architecture limitations
tr_tr: Katman-3 mimari kısıtlamaları

source: Layer-3 architectures enable the use of :term:`quality of service (QoS)` to manage network performance.
tr_tr: Katman-3 mimariler ağ başarımını yönetmek için :term:`servis kalitesi (QoS)` kullanımını etkinleştirirler.

source: Layer-3 networks provide the same level of resiliency and scalability as the Internet.
tr_tr: Katman-3 ağları İnternet'le aynı seviyede esneklik ve ölçeklenebilirlik sağlar.

source: Leveraging Orchestration and Telemetry services is also a potential issue when providing auto-scaling, orchestrated web application environments. Defining the web applications in a :term:`Heat Orchestration Template (HOT)` negates the reliance on the current scripted Puppet solution.
tr_tr: Otomatik ölçeklenen, düzenlenen web uygulama ortamları sağlanırken Orkestrasyon ve Telemetri servislerini yükseltmek de potansiyel bir sorundur. Web uygulamalarını bir term:`Heat Orkestrasyon Şablonun (HOT)` içinde tanımlamak mevcut betiklenmiş Puppet çözümünü boşa çıkarır.

source: Likely to be fully symmetric. Because replication originates from any node and might target multiple other nodes algorithmically, it is less likely for this traffic to have a larger volume in any specific direction. However, this traffic might interfere with north-south traffic.
tr_tr: Tamamen simetrik olacaktır. Çoğaltma herhangi bir düğümden olacağından ve algoritmik olarak diğer düğümleri hedefleyeceğinden, bu trafiğin herhangi özel bir yöne daha fazla hacmi olması beklenmez. Ancak bu trafik kuzey-güney trafiğe karışabilir.

source: Limitations applied by Administrator
tr_tr: Yönetici tarafından uygulanan sınırlamalar

source: Linux and virtualization experience.
tr_tr: Linux ve sanallaştırma deneyimi.

source: Live migration and block migration still have some issues:
tr_tr: Canlı göç ve blok göçün yine de bazı sorunları bulunur:

source: Live migration can also be done with non-shared storage, using a feature known as *KVM live block migration*. While an earlier implementation of block-based migration in KVM and QEMU was considered unreliable, there is a newer, more reliable implementation of block-based live migration as of the Mitaka release.
tr_tr: Canlı göç paylaşımsız depolamayla da yapılabilir, bu *KVM canlı blok göçü* olarak bilinen bir özelliktir. KVM ve QEMU'da blok tabanlı göçün öcneki uygulamaları güvenilir değilse de, Mitaka dağıtımıyla birlikte daha güvenilir ve yeni bir blok tabanlı canlı göç uygulaması gelmiştir.

source: Live migration is an integral part of the operations of the cloud. This feature provides the ability to seamlessly move instances from one physical host to another, a necessity for performing upgrades that require reboots of the compute hosts, but only works well with shared storage.
tr_tr: Canlı göç bulut işlevlerinin ayrılmaz parçasıdır. Bu özellik sunucuların bir fiziksel sunucudan diğerine kolaylıkla taşınmasını sağlar, bu da hesaplama düğümünün yeniden başlatılmasının gerektiği güncellemelerde bir gereksinimdir, ama yalnızca paylaşımlı depolamada iyi çalışır.

source: Live migration of rescued images.
tr_tr: Kurtarılan imajların canlı göçü.

source: Live migration resource tracking issues.
tr_tr: Canlı göç kaynak izleme sorunları.

source: Load balancing
tr_tr: Yük dengeleme

source: Load balancing spreads requests across multiple instances. This workload scales well horizontally across large numbers of instances. This enables instances to run without publicly routed IP addresses and instead to rely on the load balancer to provide a globally reachable service. Many of these services do not require direct server return. This aids in address planning and utilization at scale since only the virtual IP (VIP) must be public.
tr_tr: Yük dengeleme istekleri birden çok sunucu arasına dağıtır. Bu iş yükü yatay olarak çok sayıda sunucu ile iyi ölçeklenir. Bu sunucuların açıkça yönlendirilmiş IP adresleri olmadan çalışmasını sağlar ve açıkça erişilebilir servis sunma işini yük dengeleyiciye bırakır. Bu servislerden bir çoğu doğrudan sunucu geridönüşü gerektirmez. Bu da büyük ölçekte adres planlama ve kullanımına yardımcı olur zira yalnızca sanal IP (VIP) dışardan erişilebilir olmalıdır.

source: Location
tr_tr: Konum

source: Log analysis often requires disparate logs of differing formats. Elastic Stack (namely Logstash) was created to take many different log inputs and transform them into a consistent format that Elasticsearch can catalog and analyze. As seen in the image above, the process of ingestion starts on the servers by Logstash, is forwarded to the Elasticsearch server for storage and searching, and then displayed through Kibana for visual analysis and interaction.
tr_tr: Günlük kaydı analizi çoğunlukla farklı biçimlerde apayrı kayıtlarla yapılır. Elastic Stack (yani Logstash) olabildiğince farklı kayıt girdisini alıp Elasticsearch sunucusunun sınıflandırıp analiz edebileceği tutarlı bir biçime dönüştürmek için oluşturulmuştur. Aşağıdaki imajda görülebildiği gibi, sunuculardaki içeri alım süreci Logstash ile başlar, depolama ve arama için Elasticsearch sunucusuna gönderilir, ve görsel analiz ve etkileşim için Kibana aracılığıyla görüntülenir.

source: Logging and monitoring
tr_tr: Günlük kayıtları ve izleme

source: Logging and monitoring does not significantly differ for a multi-site OpenStack cloud. The tools described in the `Logging and monitoring <https://docs.openstack.org/ops-guide/ops-logging-monitoring.html>`__ in the Operations Guide remain applicable. Logging and monitoring can be provided on a per-site basis, and in a common centralized location.
tr_tr: Günlük kayıtları ve izleme birden çok konumdaki OpenStack bulutlarında fazla değişiklik göstermez. İşlemler kılavuzundaki `Günlük kaydı ve izleme <https://docs.openstack.org/ops-guide/ops-logging-monitoring.html>`__ araçları uygulanabilir kalırlar. Günlük kayıtları ve izleme konum başına dağıtılabilir ya da merkezi bir konumda tutulabilir.

source: Logging is described in more detail in the `Operations Guide <https://docs.openstack.org/ops-guide/ops-logging-monitoring.html>`_. However, it is an important design consideration to take into account before commencing operations of your cloud.
tr_tr: Günlük kayıtları `İşlem Kılavuzunda <https://docs.openstack.org/ops-guide/ops-logging-monitoring.html>`_ daha ayrıntılı tanımlanmıştır. Ancak bulutunuzu işletmeye başlamadan önce ele almanız gereken önemli tasarım etmenidir.

source: Logs from the web application servers are shipped to OpenStack Object Storage for processing and archiving.
tr_tr: Web uygulama sunucularından gelen günlük kayıtları OpenStack Nesne Depolamaya işleme ve arşivleme için gönderilir.

source: Loss of compute nodes decreases storage availability for all hosts.
tr_tr: Hesaplama düğümlerinin kaybı tüm sunucular için kullanılabilir depolamanın azalmasına neden olur.

source: Loss of the database leads to errors. As a result, we recommend that you cluster your database to make it failure tolerant. Configuring and maintaining a database cluster is done outside OpenStack and is determined by the database software you choose to use in your cloud environment. MySQL/Galera is a popular option for MySQL-based databases.
tr_tr: Veritabanı kaydı hatalara yol açar. Sonuç olarak hataya dayanıklı olması için veritabanınızı kümelemenizi öneririz. Veritabanı kümesi yapılandırmak ve yönetmek OpenStack kapsamı dışında kalır ve bulut ortamınız için seçtiğiniz veritabanı yazılımına bağlıdır. MySQL tabanlı veritabanları için MySQL/Galera popüler bir seçenektir.

source: MLAG, often used for switch redundancy, is a proprietary solution that does not scale beyond two devices and forces vendor lock-in.
tr_tr: Çoğunlukla anahtar yedekliliğinde kullanılan MLAG, iki aygıttan fazlasına ölçeklenemeyen ve üreticiye bağımlılığa zorlayan bir çözümdür.

source: Maintenance considerations
tr_tr: Bakım etmenleri

source: Maintenance tasks
tr_tr: Bakım görevleri

source: Managed by…
tr_tr: Yöneten...

source: Management
tr_tr: Yönetim

source: Management software
tr_tr: Yönetim yazılımı

source: Management software providing clustering, logging, monitoring, and alerting details for a cloud environment is often used. This impacts and affects the overall OpenStack cloud design, and must account for the additional resource consumption such as CPU, RAM, storage, and network bandwidth.
tr_tr: Kümeleme, günlük kaydı, izleme, ve uyarı ayrıntıları sağlayan yönetim yazılımı bulut ortamında sıklıkla kullanılır. Bu genel OpenStack bulut tasarımını etkiler, ve CPU, RAM, depolama ve ağ bant genişliği gibi ek kaynakların tüketimi hesaba katılmalıdır.

source: Many deployments use the SQL database; however, LDAP is also a popular choice for those with existing authentication infrastructure that needs to be integrated.
tr_tr: Çoğu kurulum SQL veritabanı kullanır; ancak, tümleştirilecek mevcut kimlik doğrulama alt yapısı olanlar arasında LDAP popüler seçimdir.

source: Many operators use separate compute and storage hosts instead of a hyperconverged solution. Compute services and storage services have different requirements, and compute hosts typically require more CPU and RAM than storage hosts. Therefore, for a fixed budget, it makes sense to have different configurations for your compute nodes and your storage nodes. Compute nodes will be invested in CPU and RAM, and storage nodes will be invested in block storage.
tr_tr: Çoğu işletici bir noktada birleşmiş çözüm yerine ayrı hesaplama ve depolama sunucuları kullanır. Hesaplama servisleri ve depolama servislerinin farklı gereksinimleri vardır, ve hesaplama sunucularının depolama sunucularına göre daha fazla CPU ve RAM ihtiyacı vardır. Yani sabit bir bütçe için hesaplama ve depolama düğümlerinin farklı yapılandırmaya sahip olması mantıklıdır. Hesaplama düğümleri için CPU ve RAM'e, depolama düğümleri için blok depolamaya yatırım yapılır.

source: MariaDB server instances store their data on shared enterprise storage, such as NetApp or Solidfire devices. If a MariaDB instance fails, storage would be expected to be re-attached to another instance and rejoined to the Galera cluster.
tr_tr: MariaDB sunucuları verilerini paylaşımlı kurumsal depolamada tutuyor, örneğin NetApp veya Solidfire aygıtlarında. Bir MariaDB sunucusu arızalanırsa, depolamanın başka bir sunucuya eklenmesi ve Galera kümesine yeniden katılması beklenir.

source: Massively scalable OpenStack clouds require extensive metering and monitoring functionality to maximize the operational efficiency by keeping the operator informed about the status and state of the infrastructure. This includes full scale metering of the hardware and software status. A corresponding framework of logging and alerting is also required to store and enable operations to act on the meters provided by the metering and monitoring solutions. The cloud operator also needs a solution that uses the data provided by the metering and monitoring solution to provide capacity planning and capacity trending analysis.
tr_tr: Büyük ölçekteki OpenStack bulutları işletmeni alt yapının durumuyla ilgili bilgilendirerek işlem verimliliğini en üst seviyeye çıkarmak için kapsamlı ölçme ve izleme işlevleri gerektirir. Bu donanım ve yazılım durumuyla ilgili tüm aralıklarda ölçüm içerir. Ölçme ve izleme çözümlerinin sağladığı ölçümleri kaydetmek ve bunlar üzerine hareket etmek için ilgili günlük ve uyarı çatılar da gereklidir. Bulut işletmeni ölçme ve izleme çözümünün sağladığı veriyi kullanarak kapasite planlama ve kapasite trend analizi yapan bir çözüme de ihtiyaç duyar.

source: Massively scale the ecosystem to support millions of end users.
tr_tr: Milyonlarca son kullanıcıyı destekleyecek şekilde ekosistemi büyük ölçekleyin.

source: Maximize flexibility to architect future production environments.
tr_tr: İlerdeki üretim ortamlarını imar edebilmek için esnekliği azami seviyeye çıkarın.

source: Maximum Read IOPS: In order to accurately calculate maximum read IOPS for a disk array, multiply the IOPS for each disk by the maximum read or write IOPS per disk. maxReadIOPS = nDisks * diskMaxIOPS For example, 15 10K Spinning Disks would be measured the following way: maxReadIOPS = 15 * 130 maxReadIOPS = 1950
tr_tr: Azami Okuma IOPS'u: Bir disk dizisi için azami okuma IOPS'unu doğru hesaplamak için, her bir disk için IOPS'u disk başına azami okuma veya yazma IOPS'uyla çarpın. maxReadIOPS = nDisks * diskMaxIOPS Örneğin, 15 10K Hızında Disk şöyle ölçülürdü: maxReadIOPS = 15 * 130 maxReadIOPS = 1950

source: Maximum write IOPS per array:
tr_tr: Dizi başına azami yazma IOPS'u:

source: Memcached (a distributed memory object caching system)
tr_tr: Memcached (dağıtık hafıza nesne ön bellekleme sistemi)

source: Message Queue
tr_tr: İleti Kuyruğu

source: Message queue services
tr_tr: İleti kuyruğu servisleri

source: Migrating MACs (instance migration) to different physical locations are a potential problem if you do not set ARP table timeouts properly.
tr_tr: ARP tablosu zaman aşımlarını düzgün ayarlamadıysanız MAC'lerin (sunucu göçü) farklı fiziksel konumlara göçü sorun teşkil eder.

source: Migration scenarios
tr_tr: Göç senaryoları

source: Migration, availability, site loss and recovery
tr_tr: Göç, kullanılırlık, konum kaybı ve kurtarma

source: Migrations of instances from one node to another are more complicated and rely on features that may not continue to be developed.
tr_tr: Sunucuların bir düğümden diğerine göçü daha karmaşıktır ve devam ettirilmeyen ya da geliştirilmeyen özelliklere bağlı olabilir.

source: MongoDB has its own design considerations for high availability.
tr_tr: MongoDB'nin yüksek kullanılırlık için kendi tasarım kısıtlamaları vardır.

source: More hosts are required to support the anticipated scale if the design architecture uses dual-socket hardware designs.
tr_tr: Tasarım mimarisi çift-soket donanım tasarımlarını kullanırsa beklenen ölçeği desteklemek için daha fazla sunucu gerekir.

source: Most OpenStack components require access to back-end database services to store state and configuration information. Choose an appropriate back-end database which satisfies the availability and fault tolerance requirements of the OpenStack services.
tr_tr: Çoğu OpenStack bileşenleri durum ve yapılandırma bilgisini kaydetmek için arka uç veritabanı servislerine erişim gerektirir. OpenStack servislerinin kullanılırlık ve arıza payı gereksinimlerini tatmin eden bir arka uç veritabanı seçin.

source: Most OpenStack services communicate with each other using the *message queue*. For example, Compute communicates to block storage services and networking services through the message queue. Also, you can optionally enable notifications for any service. RabbitMQ, Qpid, and Zeromq are all popular choices for a message-queue service. In general, if the message queue fails or becomes inaccessible, the cluster grinds to a halt and ends up in a read-only state, with information stuck at the point where the last message was sent. Accordingly, we recommend that you cluster the message queue. Be aware that clustered message queues can be a pain point for many OpenStack deployments. While RabbitMQ has native clustering support, there have been reports of issues when running it at a large scale. While other queuing solutions are available, such as Zeromq and Qpid, Zeromq does not offer stateful queues. Qpid is the messaging system of choice for Red Hat and its derivatives. Qpid does not have native clustering capabilities and requires a supplemental service, such as Pacemaker or Corsync. For your message queue, you need to determine what level of data loss you are comfortable with and whether to use an OpenStack project's ability to retry multiple MQ hosts in the event of a failure, such as using Compute's ability to do so.
tr_tr: Çoğu OpenStack servisi birbirleriyle *ileti kuyruğu* ile haberleşir. Örneğin Hesaplama blok depolama servisleriyle ve ağ servisleriyle ileti kuyruğu aracılığıyla haberleşir. Ayrıca isteğe bağlı olarak herhangi bir servis için ileti kuyruğunu etkinleştirebilirsiniz. RabbitMQ, Qpid ve Zeromq ileti-kuyruğu servisleri arasında popüler seçimlerdir. Genelde ileti kuyruğu arıza çıkarırsa ya da erişilemez olursa küme durma noktasına gelir ve salt okunur durumda kalır, bilgi son iletinin gönderildiği noktada kalır. Bu duruma uygun olarak ileti kuyruğunuzu kümelemenizi öneriyoruz. Kümelenen ileti kuyruklarının da OpenStack kurulumlarında sorunlar yaşatabildiğini unutmayın. RabbitMQ doğal kümeleme desteğine sahip olsa da, büyük ölçekte çalıştırıldığında çıkan sorunlarla ilgili raporlar var. Zeromq ve Qpid gibi başka kuyruklama çözümleri olsa da, Zeromy durumsal kuyruk sağlamıyor. Qpid Red Hat ve türevlerinde kullanılan ileti sistemi seçimi. Qpid de doğal kümeleme yeteneğine sahip değil ve Pacemaker veya Corosync gibi destekleyen bir servise ihtiyaç duyuyor. İleti kuyruğunuz için ne kadar veri kaybının sorun olmayacağına ve OpenStack projesinin arıza durumunda birden çok ileti kuyruğu sunucusuna tekrar deneme yapabilme yeteneğini, örneğin Hesaplamanın yeteneğini kullanmak isteyip istemeyeceğinize karar vermeniz gerekiyor.

source: Most blade servers can support dual-socket multi-core CPUs. To avoid this CPU limit, select ``full width`` or ``full height`` blades. Be aware, however, that this also decreases server density. For example, high density blade servers such as HP BladeSystem or Dell PowerEdge M1000e support up to 16 servers in only ten rack units. Using half-height blades is twice as dense as using full-height blades, which results in only eight servers per ten rack units.
tr_tr: Çoğu blade sunucu çift soket çoklu çekirdek işlemcileri destekler. Bu işlemci sınırlamasından kaçınmak için ``tam geniş`` ya da ``tam yüksek`` blade'leri seçin. Bunun sunucu yoğunluğunu azalttığını da unutmayın. Örneğin HP BladeSystem veya Dell PowerEdge M1000e gibi yüksek yoğunluklu blade sunuclar yalnızca on kabin birimi içinde 16 sunucu desteklerler. Yarım yükseklikte blade'ler kullanmak tam yüksek blade'lerin iki katı yoğunluk demektir, bu da on kabin birimine yalnızca sekiz sunucunun sığması demektir.

source: Most block storage drivers allow the instance to have direct access to the underlying storage hardware's block device. This helps increase the overall read/write IO. However, support for utilizing files as volumes is also well established, with full support for NFS, GlusterFS and others.
tr_tr: Çoğu blok depolama sürücüsü sunucunun altta yatan depolama donanımının blok aygıtına doğrudan erişime izin verir. Bu genel okuma/yazma IO'sunun artmasına fayda sağlar. Ancak dosyaların birim gibi kullanılmasının desteği de, NFS, GlusterFS ve diğerlerine tam destekle verilir.

source: Most information starts and ends inside Ethernet frames. Today this applies to data, voice, and video. The concept is that the network will benefit more from the advantages of Ethernet if the transfer of information from a source to a destination is in the form of Ethernet frames.
tr_tr: Çoğu bilgi Ethernet çerçevelerinin içinde başlar ve biter. Bugün bu veri, ses ve video için de geçerlidir. Kavram ağın Ethernet avantajlarından kaynaktan hedefe bilgi aktarımı Ethernet çerçeveleri biçimindeyse daha iyi yararlanabileceği üzerine kuruludur.

source: Multiple data centers
tr_tr: Birden çok veri merkezi

source: Multiple network links should be deployed between sites to provide redundancy for all components. This includes storage replication, which should be isolated to a dedicated network or VLAN with the ability to assign QoS to control the replication traffic or provide priority for this traffic.
tr_tr: Tüm bileşenler için yedeklilik sağlamak için konumlar arasında birden çok ağ bağlantısı kurulmalıdır. Bu depolama çoğaltmayı da kapsar, ki bu çoğaltma trafiğini kontrol edecek QoS atanmış bir VLAN veya adanmış bir ağ ile yalıtılmış olmalıdır.

source: Multiple racks
tr_tr: Birden çok kabin

source: MySQL is the default database for OpenStack, but other compatible databases are available.
tr_tr: MySQL OpenStack için öntanımlı veritabanıdır, ama uyumlu diğer veritabanları da kullanılabilir.

source: NFS (default for Linux)
tr_tr: NFS (Linux için öntanımlı)

source: Network
tr_tr: Ağ

source: Network Considerations
tr_tr: Ağ Etmenleri

source: Network File System (NFS) is a file system protocol that allows a user or administrator to mount a file system on a server. File clients can access mounted file systems through Remote Procedure Calls (RPC).
tr_tr: Ağ Dosya Sistemi (NFS) bir kullanıcı veya yöneticinin bir sunucu üzerine dosya sistemi bağlamasını sağlayan sistem iletişim kuralıdır. Dosya istemcileri bağlı dosya sistemlerine Uzak Yordam Çağrıları (RPC) aracılığıyla erişebilirler.

source: Network connectivity
tr_tr: Ağ bağlantısı

source: Network design
tr_tr: Ağ tasarımı

source: Network functions
tr_tr: Ağ işlevleri
