Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: OpenStack is designed to be massively horizontally scalable, which allows all services to be distributed widely. However, to simplify this guide, we have decided to discuss services of a more central nature, using the concept of a *cloud controller*. A cloud controller is a conceptual simplification. In the real world, you design an architecture for your cloud controller that enables high availability so that if any node fails, another can take over the required tasks. In reality, cloud controller tasks are spread out across more than a single node.
tr_tr: OpenStack ağırlıklı olarak yatay ölçeklenmek için tasarlanmıştır, bu da tüm servislerin genişçe dağıtılmasına izin verir. Ancak bu kılavuzu basitleştirmek için bir *bulut kontrol birimi* kavramını kullanarak daha merkezi doğada olan servisleri tartışmaya karar verdik. Bulut kontrol birimi kavramsal bir basitleştirmedir. Gerçek dünyada bulut kontrol biriminiz için yüksek kullanılırlık sağlayan, herhangi bir düğüm arızalandığında gerekli görevleri bir diğerinin devam ettirebildiği bir mimari tasarlarsınız. Gerçekte bulut kontrol birimi görevleri tek bir düğümden fazlasına yayılmıştır.

source: OpenStack lends itself to deployment in a highly available manner where it is expected that at least 2 servers be utilized. These can run all the services involved from the message queuing service, for example ``RabbitMQ`` or ``QPID``, and an appropriately deployed database service such as ``MySQL`` or ``MariaDB``. As services in the cloud are scaled out, back-end services will need to scale too. Monitoring and reporting on server utilization and response times, as well as load testing your systems, will help determine scale out decisions.
tr_tr: OpenStack en az 2 sunucunun kullanılacağı yüksek kullanılırlık kurulumlarına katar. Bunlar ihtiyaç olan tüm servisleri çalıştırabilirler, örneğin ``RabbitMQ`` veya ``QPID`` gibi mesaj kuyruğu servisleri, ve uygun kurulmuş ``MySQL`` veya ``MariaDB`` gibi veritabanı servisi. Buluttaki servisler ölçeklenebildiğinden, arka uç servislerin de ölçeklenmesi gerekir. Sunucu kullanımını ve yanıt sürelerini izleme ve raporlama, aynı zamanda sisteminize yük testi yapmak, ölçekleme kararlarının alınmasında yardımcı olur.

source: OpenStack produces a great deal of useful logging information, but for the information to be useful for operations purposes, you should consider having a central logging server to send logs to, and a log parsing/analysis system such as Elastic Stack [formerly known as ELK].
tr_tr: OpenStack yüksek miktarda faydalı günlük kaydı bilgisi üretir, ama bilginin işlevsel amaçlı faydalı olabilmesi için kayıtların gönderilebileceği merkezi bir günlük sunucusu ve Elastic Stack [eski ELK] gibi bir günlük işleme/analiz sistemine ihtiyacınız vardır.

source: OpenStack provides a rich networking environment. This chapter details the requirements and options to consider when designing your cloud. This includes examples of network implementations to consider, information about some OpenStack network layouts and networking services that are essential for stable operation.
tr_tr: OpenStack zengin bir ağ ortamı sunar. Bu bölüm bulutunuzu tasarlarken göz önüne almanız gereken gereksinim ve seçenekleri gösterir. Bu göz önüne alınacak ağ uygulaması örneklerini, bazı OpenStack ağ yerleşimleri hakkında bilgi ve kararlı bir işletme için gerekli ağ servislerini içerir.

source: OpenStack, like any network application, has a number of standard services to consider, such as NTP and DNS.
tr_tr: OpenStack, herhangi bir ağ uygulaması gibi, dikkate alması gereken standart servislere sahiptir, NTP ve DNS gibi.

source: Operating system patching, hardware/firmware upgrades, and datacenter related changes, as well as minor and release upgrades to OpenStack components are all ongoing operational tasks. The six monthly release cycle of the OpenStack projects needs to be considered as part of the cost of ongoing maintenance. The solution should take into account storage and network maintenance and the impact on underlying workloads.
tr_tr: İşletim sistemi yamalama, donanım/üretici yazılımı güncellemeleri, ve veri merkeziyle ilgili değişiklikler, ayrıca OpenStack bileşenlerine yapılan küçük ve dağıtım yükseltmeleri hep süreklilik arz eden işlevsel görevlerdir. OpenStack projelerinin altı aylık dağıtım döngüsü bakım masraflarının parçası olarak ele alınmalıdır. Çözüm depolama ve ağ bakımını ve altta yatan iş yüklerine etkiyi göz önüne almalıdır.

source: Operational costs
tr_tr: İşlem maliyetleri

source: Operational requirements
tr_tr: İşlevsel gereksinimler

source: Operator access to systems
tr_tr: Sistemlere işletmen erişimi

source: Operator requirements
tr_tr: İşletmen gereksinimleri

source: Optimizing network performance
tr_tr: Ağ başarımının iyileştirilmesi

source: Orchestration requires special client configurations to integrate with Amazon Web Services. For other types of clouds, use CMP features.
tr_tr: Orkestrasyon Amazon Web Servisleriyle tümleşme için özel istemci yapılandırması gerektirir. Diğer tür bulutlar için, CMP özelliklerini kullanın.

source: Orchestration service
tr_tr: Orkestrasyon servisi

source: Organizations leveraging cloud-based services can embrace business diversity and utilize a hybrid cloud design to spread their workloads across multiple cloud providers. This ensures that no single cloud provider is the sole host for an application.
tr_tr: Bulut tabanlı servislerden güç alan kurumlar iş çeşitliliği ihtiva edebilir ve iş yüklerini farklı bulut sağlayıcılar arasında dağıtaran melez bulut tasarımını kullanabilirler. Bu da uygulamayı tek bir bulut sağlayıcının sunmamasını sağlar.

source: Organizations must find the right balance between data integrity and data availability. Replication strategy may also influence disaster recovery methods.
tr_tr: Kurumlar veri tutarlılığıyla veri kullanılırlığı arasındaki doğru dengeyi bulmalıdırlar. Çoğaltma stratejisi afet anında kurtarma yöntemlerini de etkileyebilir.

source: Outages can cause partial or full loss of site functionality. Strategies should be implemented to understand and plan for recovery scenarios.
tr_tr: Kesintiler konum işlevselliğini kısmen ya da tamamen kaybettirebilir. Kurtarma senaryolarının anlaşılması ve uygulanması için stratejiler uygulanmalıdır.

source: Overcommitting CPU and RAM
tr_tr: CPU ve RAM'in abonelik aşımı

source: Overlay
tr_tr: Üst Katman

source: Overlay networks
tr_tr: Üst katman ağlar

source: Oversubscription is a method to emulate more capacity than may physically be present. For example, a physical hypervisor node with 32 GB RAM may host 24 instances, each provisioned with 2 GB RAM. As long as all 24 instances do not concurrently use 2 full gigabytes, this arrangement works well. However, some hosts take oversubscription to extremes and, as a result, performance can be inconsistent. If at all possible, determine what the oversubscription rates of each host are and plan capacity accordingly.
tr_tr: Abonelik aşım fiziksel olarak var olan kapasiteden daha fazlası varmış gibi yapma yöntemidir. Örneğin, 32 GB RAM'e sahip fiziksel hipervizör düğümü her birinde 2 GB RAM olan 24 sunucu barındırıyor olabilir. Tüm 24 sunucu 2 gigabaytın tamamını kullanmadığı sürece, bu ayarlama düzgün çalışacaktır. Ancak, bazı sunucular abonelik aşımlarını uç noktalara taşırlar, ve sonuç olarak başarım tutarlı olmayabilir. Eğer mümkünse her sunucunun abonelik aşım oranlarının ne olduğunu öğrenin ve kapasiteyi buna uygun planlayın.

source: Parameter in ``nova.conf``
tr_tr: ``nova.conf`` dosyasındaki parametre

source: Penalty
tr_tr: Kayıp

source: Performance
tr_tr: Başarım

source: Performance is a critical consideration when designing any cloud, and becomes increasingly important as size and complexity grow. While single-site, private clouds can be closely controlled, multi-site and hybrid deployments require more careful planning to reduce problems such as network latency between sites.
tr_tr: Başarım herhangi bir bulut tasarımında büyük öneme sahiptir, ve boyut ve karmaşıklık büyüdükçe önemi gittikçe artar. Tek konumda, özel bulutlar yakından kontrol edilebilirken, farklı bölgelerdeki melez kurulumlar bölgeler arasındaki ağ gecikmesi gibi problemleri azaltmak için çok daha dikkatli planlanmalıdırlar.

source: Performance of block based storage is typically measured in the maximum read and write operations to non-contiguous storage locations per second. This measurement typically applies to SAN, hard drives, and solid state drives. While IOPS can be broadly measured and is not an official benchmark, many vectors like to be used by vendors to communicate performance levels. Since there are no real standards for measuring IOPS, vendor test results may vary, sometimes wildly. However, along with transfer rate which measures the speed that data can be transferred to contiguous storage locations, IOPS can be used in a performance evaluation. Typically, transfer rate is represented by a bytes per second calculation but IOPS is measured by an integer.
tr_tr: Blok tabanlı depolamanın başarımı genellikle bitişik olmayan depolama konumlarına saniyede yapılan okuma ve yazma sınırlarıyla ölçülür. Bu ölçüm genellikle SAN, hard diskler, ve ssd'lere uygulanır. IOPS ölçmek için bir çok yöntem olsa da ve resmi bir ölçüm olmasa da, çoğur üretici başarım seviyesini belirtmek için kullanır. IOPS ölçmek için gerçek standartlar olmadığından, üretici deneme sonuçları bazen yüksek farklılıklar gösterebilir. Ancak verinin sıralı depolama konumlarına aktarım hızını ölçen aktarım oranının yanı sıra, IOPS da başarım değerlendirmede kullanılabilir. Genel olarak, aktarım oranı saniyede bayt şeklinde sunulurken IOPS bir tamsayıdır.

source: Performance tuning
tr_tr: Başarım ayarları

source: Persistent file-based storage support
tr_tr: Kalıcı dosya tabanlı depolama desteği

source: Persistent storage - Persistent storage means that the storage resource outlives any other resource and is always available, regardless of the state of a running instance.
tr_tr: Kalıcı depolama - Kalıcı depolama depolama kaynağının herhangi bir diğer kaynaktan kalıcı olduğu ve her zaman kullanılabilir olduğu anlamına gelir, çalışan sunucunun durumundan bağımsızdır.

source: Persists until…
tr_tr: Kalıcılık süresi...

source: Physical constraints such as power, rack space, network cabling, etc.
tr_tr: Güç, kabin alanı, ağ kabloları gibi fiziksel kısıtlamalar.

source: Physical data centers have limited physical space, power, and cooling. The number of hosts (or hypervisors) that can be fitted into a given metric (rack, rack unit, or floor tile) is another important method of sizing. Floor weight is an often overlooked consideration.
tr_tr: Fiziksel veri merkezlerinin sınırlı fiziksel alanı, gücü ve soğutması vardır. Verilen bir ölçüte (kabin, kabin birimi, döşeme) sığabilecek sunucu (veya hipervizör) sayısı boyutlandırma için bir diğer önemli yöntemdir. Zemin ağırlığı genellikle göz önüne alınmayan bir etmendir.

source: Planning and scaling storage capacity
tr_tr: Depolama kapasitesinin planlanması ve ölçeklenmesi

source: Port count
tr_tr: Bağlantı noktası sayısı

source: Port density
tr_tr: Bağlantı noktası yoğunluğu

source: Port speed
tr_tr: Bağlantı noktası hızı

source: Possible options include:
tr_tr: Muhtemel seçenekler:

source: Power and cooling density
tr_tr: Güç ve soğutma yoğunluğu

source: Power requirements
tr_tr: Güç gereksinimleri

source: Prior knowledge of cloud architecture and principles.
tr_tr: Bulut mimarisi ve ilkeleri hakkında ön bilgi.

source: Protocol support
tr_tr: İletişim kuralı desteği

source: Provider API changes
tr_tr: Sağlayıcı API değişiklikleri

source: Provider availability or implementation details
tr_tr: Sağlayıcı kullanılırlığı veya uygulama ayrıntıları

source: Provides a web-based front end for users to consume OpenStack cloud services
tr_tr: Kullanıcıları OpenStack bulut servislerini tüketebilecekleri web tabanlı ön yüz sağlar

source: Providing IPv6 support
tr_tr: IPv6 desteği sağlamak

source: Proxy requests to a database
tr_tr: Veritabanına istekleri vekilden geçir

source: Proxy:
tr_tr: Vekil:

source: Public, private, or a hybrid cloud (performance profiles, shared storage, replication options)
tr_tr: Açık, özel, ya da melez bulut (başarım profilleri, paylaşımlı depolama, çoğaltma seçenekleri)

source: QoS is desirable for some workloads to ensure delivery. DNS has a major impact on the load times of other services and needs to be reliable and provide rapid responses. Configure rules in upstream devices to apply a higher Class Selector to DNS to ensure faster delivery or a better spot in queuing algorithms.
tr_tr: QoS bazı iş yüklerinde teslimattan emin olmak için gereklidir. DNS'in diğer servislerin yüklenme zamanı üzerinde büyük önemi bulunur ve güvenilir ve hızlı yanıt verebilir olması gerekir. Üst akış aygıtlarında DNS için daha yüksek Sınıf Seçici kuralları yapılandırarak veya kuyruklama algoritmalarında daha iyi bir yer vererek hızlı aktarım sağlayın.

source: RAM allocation ratio: 1.5:1
tr_tr: RAM ayırma oranı: 1.5:1

source: REST proxy:
tr_tr: REST vekili:

source: Raid 5 has the worst penalty (has the most cross disk writes.) Therefore, when using the above examples, a 15 disk array using RAID 5 is capable of 1950 read IOPS however, we need to add the penalty when determining the *write* IOPS:
tr_tr: Raid 5 en büyük kayba sahiptir (diskler arası en çok yazmaya sahip) Bu yüzden, yukarıdaki örnekleri kullanırken, RAID 5 kullanan 15 diskli bir dizi 1950 okuma IOPS'una sahipken, *yazma* IOPS'una karar verirken kaybı eklemeliyiz.

source: Raid Type
tr_tr: Raid Türü

source: Ramification
tr_tr: Dallanma

source: Recovery of instances is complicated by depending on multiple hosts.
tr_tr: Sunucuların kurtarılması birden çok sunucuya bağımlılık yüzünden karmaşıktır.

source: Reduced overhead of the IP hierarchy.
tr_tr: IP sıra düzeni giderinin azalması.

source: Redundancy
tr_tr: Yedeklilik

source: Redundant networking
tr_tr: Yedekli ağ

source: Regardless of the overcommit ratio, an instance can not be placed on any physical node with fewer raw (pre-overcommit) resources than the instance flavor requires.
tr_tr: Abonelik aşım oranından bağımsız olarak, bir sunucu fiziksel bir düğüme sunucu niteliğinin gerektirdiğinden az ham (abonelik aşım öncesi) kaynak varsa konulamaz.

source: Reliability and availability
tr_tr: Güvenilirlik ve kullanılırlık

source: Reliability and availability depend on the many supporting components' availability and on the level of precautions taken by the service provider. This includes network, storage systems, datacenter, and operating systems.
tr_tr: Güvenilirlik ve kullanılırlık bir çok destekleyen bileşenin kullanılabilirliğine ve servis sağlayıcı tarafından alınan önlemlerin seviyesine bağlıdır. Bu ağ, depolama sistemler, veri merkezi ve işletim sistemlerini içerir.

source: Remove shares.
tr_tr: Paylaşımları kaldır.

source: Replicas in Object Storage function independently, and clients only require a majority of nodes to respond to a request in order for an operation to be considered successful. Thus, transient failures like network partitions can quickly cause replicas to diverge. Fix These differences are eventually reconciled by asynchronous, peer-to-peer replicator processes. The replicator processes traverse their local filesystems, concurrently performing operations in a manner that balances load across physical disks.
tr_tr: Nesne Depolamadaki yedekler bağımsız işlerler, ve bir işlemin başarılı olarak sayılması için istemcilerin yalnızca düğümlerin büyük çoğunluğunun bir isteğe yanıt vermesine ihtiyaçları vardır. Böylece ağ bölümleri gibi geçici arızalar yedeklerin hızlıca sapmasına sebep olabilir. Bu farklılıklar bir noktada asenkron, eşten-eşe çoğaltma süreçleri ile yeniden buluşturulurlar. Çoğaltma süreçleri yükü fiziksel disklere dengeleyecek şekilde eşzamanlı olarak işleyerek yerel dosya sistemlerinin üstünden geçerler.

source: Replicating inter-site data
tr_tr: Konum arası verinin çoğaltılması

source: Replication
tr_tr: Çoğaltma

source: Replication across different racks, data centers, and geographical regions increases focus on determining and ensuring data locality. The ability to guarantee data is accessed from the nearest or fastest storage can be necessary for applications to perform well.
tr_tr: Farklı kabinler, veri merkezleri, ve coğrafi bölgeler arasında çoğaltma dikkati veri yerelliğinden emin olma noktasında artırır. Veriye en yakın veya en hızlı depolamadan erişebilme garantisi uygulamaların iyi çalışması için zorunlu olabilir.

source: Replication is an area of active development, andimplementation details are likely to change over time.
tr_tr: Çoğaltma etkin geliştirme alanındadır, ve uygulama ayrıntıları zamanla değişmeye müsaittir.

source: Replication uses a push model, with records and files generally only being copied from local to remote replicas. This is important because data on the node may not belong there (as in the case of handoffs and ring changes), and a replicator can not know what data exists elsewhere in the cluster that it should pull in. It is the duty of any node that contains data to ensure that data gets to where it belongs. Replica placement is handled by the ring.
tr_tr: Çoğaltma, itiş modeli kullanır, kayıtlar ve dosyalar genellikle yalnızca yerelden uzak yedeklere kopyalanır. Bu önemlidir çünkü düğümdeki veri oraya ait olmayabilir (transfer ve halka değişikliklerinde olduğu gibi) ve çoğaltıcı kümede başka yerde çekebileceği hangi verinin olduğunu bilemez. Verinin ait olduğu yere gitmesinden veriyi içeren düğüm sorumludur.

source: Requests for extension
tr_tr: Eklenti için istekler

source: Requirements
tr_tr: Gereksinimler

source: Research indicates the mean time between failures (MTBF) on switches is between 100,000 and 200,000 hours. This number is dependent on the ambient temperature of the switch in the data center. When properly cooled and maintained, this translates to between 11 and 22 years before failure. Even in the worst case of poor ventilation and high ambient temperatures in the data center, the MTBF is still 2-3 years.
tr_tr: Araştırmaya göre anahtarlar arasında arıza aralığı (MTBF) 100,000 ile 200,000 saat arasında. Bu rakam veri merkezindeki anahtarın çevre sıcaklığına bağımlı. Düzgün soğutulup bakımı yapıldığında, bu rakam arızadan önce 11 ve 22 yıl arasına denk gelir. En kötü durumda havalandırmanın olmadığı ve ortam sıcaklığının yüksek olduğu bir veri merkezinde bile, bu değer 2-3 senedir.

source: Resource capacity
tr_tr: Kaynak kapasitesi

source: Response time to the Compute API
tr_tr: Hesaplama API'sine yanıt verme zamanı

source: Revenue opportunities vary based on the intent and use case of the cloud. The requirements of a commercial, customer-facing product are often very different from an internal, private cloud. You must consider what features make your design most attractive to your users.
tr_tr: Gelir fırsatları bulutun kullanım amacı durumuna göre değişir. Ticari, müşteriye bakan bir ürünün gereklilikleri dahili, özel bir buluttan oldukça farklıdır. Hangi özelliklerin tasarımınızı kullanıcılarınıza daha çekici yapacağını göze almalısınız.

source: Revenue opportunity
tr_tr: Gelir fırsatı

source: Routing daemons.
tr_tr: Yönlendirme artalan işlemleri.

source: Run ``glance-*`` servers on the ``swift-proxy`` server.
tr_tr: ``glance-*`` sunucularını ``swift-proxy`` sunucusu üzerinde çalıştır.

source: Run a central dedicated database server.
tr_tr: Merkezi adanmış veritabanı sunucusu çalıştır.

source: Run one VM per service.
tr_tr: Servis başına bir sanal makine çalıştır.

source: Run operating system and scratch space
tr_tr: İşletim sistemi ve sıfırdan alan çalıştır

source: Running a dedicated storage system can be operationally simpler.
tr_tr: Adanmış bir depolama sistemi çalıştırmak işlemsel olarak daha basittir.

source: Running a distributed file system can make you lose your data locality compared with nonshared storage.
tr_tr: Dağıtık dosya sistemi çalıştırmak paylaşımsız bir depoalamayla karşılaştırınca verinizin yerelliğini kaybetmesine sebep olabilir.

source: Running a shared file system on a storage system apart from the compute nodes is ideal for clouds where reliability and scalability are the most important factors. Running a shared file system on the compute nodes themselves may be best in a scenario where you have to deploy to pre-existing servers for which you have little to no control over their specifications or have specific storage performance needs but do not have a need for persistent storage.
tr_tr: Hesaplama düğümlerinden ayrı bir depolama sistemi üzerinde paylaşımlı dosya sistemi çalıştırmak güvenilirliğin ve ölçeklenebilirliğin en önemli etmenler olduğu bulutlar için idealdir. Hesaplama düğümlerinin üzerinde paylaşımlı dosya sistemi çalıştırmak ise özellikleri üzerinde kontrolünüz olmayan veya belirli deoplama başarım gereksinimleri olan ama kalıcı depolamaya ihtiyacı olmayan mevcut sunucular üzerine kurmanız gerektiğinde en iyi senaryo olabilir.

source: Running up to 140 web instances and the small number of MariaDB instances requires 292 vCPUs available, as well as 584 GB of RAM. On a typical 1U server using dual-socket hex-core Intel CPUs with Hyperthreading, and assuming 2:1 CPU overcommit ratio, this would require 8 OpenStack Compute nodes.
tr_tr: 140 web sunucu ve az sayıda MariaDB sunucusu çalıştırmak kullanılabilir 292 vCPU ve 584 GB RAM gerektirir. Hyperthreading destekli onaltı çekirdekli çift soket Intel CPU'ya sahip sıradan bir 1U sunucu üzerinde 2:1 CPU abonelik aşım oranı varsayarsak, 8 OpenStack Hesaplama düğümüne ihtiyaç duyarız.

source: Runs as a background process. On Linux platforms, a daemon is usually installed as a service.
tr_tr: Arkaplan süreci olarak çalışır. Linux platformlarda, bir artalan işlemi genellikle servis olarak kurulur.

source: SLA considerations
tr_tr: SLA etmenleri

source: SLA terms that affect the design include:
tr_tr: Tasarımı etkileyen SLA etmenleri şunları içerir:

source: SQL database (such as MySQL or PostgreSQL)
tr_tr: SQL veritabanı (MySQL veya PostgreSQL gibi)

source: Scalability
tr_tr: Ölçeklenebilirlik

source: Scalability across multiple cloud providers may dictate which underlying network framework you choose in different cloud providers. It is important to present the network API functions and to verify that functionality persists across all cloud endpoints chosen.
tr_tr: Birden çok bulut sağlayıcı arasında ölçeklendirme farklı bulut sağlayıcılarda hangi ağ çatısını kullanacağınızı dikte edebilir. Ağ API işlevlerini sunmak ve işlevselliğin seçili tüm bulut uç noktalarında varlığını doğrulamak önemlidir.

source: Scalability can be affected by network architecture.
tr_tr: Ölçeklenebilirlik ağ mimarisi tarafından etkilenebilir.

source: Scalability, along with expandability, is a major consideration in a general purpose OpenStack cloud. It might be difficult to predict the final intended size of the implementation as there are no established usage patterns for a general purpose cloud. It might become necessary to expand the initial deployment in order to accommodate growth and user demand.
tr_tr: Ölçeklenebilirlik, genişleyebilirlikle beraber genel amaçlı bir OpenStack bulutu için ana etmendir. Uygulamanın nihai boyutu genel amaçlı bir bulut için elde edilmiş kullanıcı kalıpları olmadığından tahmin etmesi zor olabilir. Büyümeyi ve kullanıcı isteklerini karşılamak için ilk kurulumun genişletilmesi gerekebilir.

source: Scale
tr_tr: Ölçek

source: Scale-out solutions
tr_tr: Dışa ölçekleme çözümleri

source: Scaling Block Storage
tr_tr: Blok Depolamanın Ölçeklenmesi

source: Scaling Object Storage
tr_tr: Nesne Depolamanın Ölçeklenmesi
