Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: Every deleted record or file in the system is marked by a tombstone, so that deletions can be replicated alongside creations. The replication process cleans up tombstones after a time period known as the consistency window. The consistency window encompasses replication duration and the length of time a transient failure can remove a node from the cluster. Tombstone cleanup must be tied to replication to reach replica convergence.
tr_tr: Sistemde silinen her kayıt ya da dosya bir mezar taşıyla işaretlenir, böylece silmeler de oluştrmalar gibi çoğaltılabilir. Çoğaltma süreci tutarlılık penceresi denen bir zaman aralığından sonra mezar taşlarını temizler. Tutarlılık penceresi çoğaltma sürecini ve bir aktarım başarısızlığının bir düğümü kümeden çıkarma zaman uzunluğunu kapsar. Yedeklerin bir noktada birleşmesi için mezar taşı temizliği çoğaltmayla ilişkilendirilmelidir.

source: Everything must be capable of automation. For example, everything from compute hardware, storage hardware, networking hardware, to the installation and configuration of the supporting software. Manual processes are impractical in a massively scalable OpenStack design architecture.
tr_tr: Herşeyi otomatize edilebilmelidir. Örneğin, hesaplama donanımından, depolama donanımına, ağ donanımından destekleyen yazılımların kurulumu ve yapılandırmasana kadar herşey. Büyük ölçekteki OpenStack mimarilerinde elle yapılan işlemler elverişsizdir.

source: Example of typical usage…
tr_tr: Genel kullanıma örnek...

source: Expandability
tr_tr: Genişleyebilirlik

source: Expandability is a major architecture factor for storage solutions with general purpose OpenStack cloud. A storage solution that expands to 50 PB is considered more expandable than a solution that only scales to 10 PB. This meter is related to scalability, which is the measure of a solution's performance as it expands.
tr_tr: Genişleyebilirlik genel amaçlı OpenStack bulutunda depolama çözümleri için önemli mimari etmenlerden biridir. 50 PB boyuta genişleyebilir bir depolama çözümü yalnızca 10 PB boyuta genişleyebilene göre daha genişleyebilir olarak düşünülür. Bu ölçüt ölçeklenebilirlikle ilişkilidir, bu da bir çözümün genişledikçe ölçülen başarımını ifade eder.

source: Experimental
tr_tr: Deneysel

source: Extensions
tr_tr: Eklentiler

source: External
tr_tr: Harici

source: External network attachments.
tr_tr: Harici ağ eklentileri.

source: External systems such as :term:`LDAP <Lightweight Directory Access Protocol (LDAP)>` or :term:`Active Directory` require network connectivity between the cloud controller and an external authentication system. Also ensure that the cloud controller has the CPU power to keep up with requests.
tr_tr: :term:`LDAP <Hafif Dizin Erişim İletişim Kuralı (LDAP)>` veya :term:`Active Directory` gibi harici sistemler bulut kontrol birimi ile harici kimlik doğrulama sistemi arasında ağ bağlantısı gerektirirler. Bunun yanında bulut kontrol biriminin isteklerin altından kalkabilecek işlemci gücüne sahip olduğundan da emin olun.

source: Facilitate orchestration across the clouds
tr_tr: Bulutlar arasında orkestrasyonu kolaylaştır

source: Factor maintainability into the overall network design. This includes the ability to manage and maintain IP addresses as well as the use of overlay identifiers including VLAN tag IDs, GRE tunnel IDs, and MPLS tags. As an example, if you may need to change all of the IP addresses on a network, a process known as renumbering, then the design must support this function.
tr_tr: Yönetilebilirliği genel ağ tasarımında hesaba katın. Bu IP adreslerini yönetmek ve ele alma becerisi yanında VLAN etiket kimlikleri, GRE tünel kimlikleri, ve MPLS etiketleri gibi üst katman tanımlayıcıların kullanımını da içerir. Örnek olarak, bir ağdaki tüm IP adreslerini değiştirmek isterseniz, ki buna yeniden numaralandırma denir, mimari bu işlevi desteklemelidir.

source: Fast provisioning of boot-from-volume instances using thin provisioning.
tr_tr: İnce hazırlama ile birimden ön yükleme sunucularının hızlı hazırlanması.

source: Fault tolerance
tr_tr: Hata dayanıklılığı

source: File system
tr_tr: Dosya sistemi

source: File-based storage
tr_tr: Dosya tabanlı depolama

source: File-level
tr_tr: Dosya seviyesi

source: Finally, consider how to respond to network events. How load transfers from one link to another during a failure scenario could be a factor in the design. If you do not plan network capacity correctly, failover traffic could overwhelm other ports or network links and create a cascading failure scenario. In this case, traffic that fails over to one link overwhelms that link and then moves to the subsequent links until all network traffic stops.
tr_tr: Son olarak, ağ olaylarına nasıl yanıt verileceğini dikkate alın. Bir kesinti senaryosunda yükün bir bağlantıdan diğerine nasıl aktarılacağı tasarımda bir etmen olabilir. Ağ kapasitesini doğru planlamazsanız, kesinti trafiği diğer bağlantı noktaları ya da ağ bağlantılarını boğabilir ve katlanan bir kesinti senaryosu oluşturabilir. Bu durumda, kesinti olan bağlantı bir sonraki bağlantıya aktarılır, bu bağlantıyı da boğunca bir diğerine aktarılarak tüm ağ trafiği durana kadar ilerlenir.

source: Financial factors are a primary concern for any organization. Cost considerations may influence the type of cloud that you build. For example, a general purpose cloud is unlikely to be the most cost-effective environment for specialized applications. Unless business needs dictate that cost is a critical factor, cost should not be the sole consideration when choosing or designing a cloud.
tr_tr: Mali etmenler her kurum işçin birinci önceliktir. Maliyet hesaplamaları inşa edeceğiniz bulut türünü etkileyebilir. Örneğin, genel amaçlı bir bulut özel uygulamalar için en hesaplı ortam olmayacaktır. İş ihtiyaçları maliyet konusunda çok hassas olmadığı sürece bir bulut seçerken ya da tasarlarken maliyet birinci öncelik olmamalıdır.

source: First and foremost:
tr_tr: İlk önce:

source: For a compute-focus architecture, we recommend designing the network architecture using a scalable network model that makes it easy to add capacity and bandwidth. A good example of such a model is the leaf-spine model. In this type of network design, you can add additional bandwidth as well as scale out to additional racks of gear. It is important to select network hardware that supports port count, port speed, and port density while allowing for future growth as workload demands increase. In the network architecture, it is also important to evaluate where to provide redundancy.
tr_tr: Hesaplama odaklı bir mimaride, kapasite ve bant genişliği eklemenin kolay olacağı ölçeklenebilir bir ağ modeli kullanılmasını öneriyoruz. Bu tarz bir modele iyi bir örnek yaprak-omurga modelidir. Bu tür ağ tasarımında, ek bant genişliği ekleyebilir ve ek malzeme kabinlerine ölçeklenebilirsiniz. Bağlantı noktası sayısı, bağlanı noktası hızı ve bağlantı noktası yoğunluğunu destekleyen ve istek arttığında genişlemeyi destekleyen ağ donanımlarını seçmek önemlidir. Ağ mimarisinde, yedekliliği nerde değerlendireceğinizi bilmek de önemlidir.

source: For a general purpose OpenStack cloud, sizing is an important consideration. The expected or anticipated number of instances that each hypervisor can host is a common meter used in sizing the deployment. The selected server hardware needs to support the expected or anticipated instance density.
tr_tr: Daha genel amaçlı bir OpenStack bulutu için, boyutlandırma önemli bir etmendir. Her hipervizörün sunabileceği beklenen ya da tahmin edilen sunucu sayısı kurulumun ölçeklendirmesinde kullanılan genel ölçüttür. Seçilen sunucu donanımı beklenen ya da tahmin edilen sunucu yoğunluğunu desteklemelidir.

source: For a general purpose OpenStack cloud, the OpenStack infrastructure components need to be highly available. If the design does not include hardware load balancing, networking software packages like HAProxy will need to be included.
tr_tr: Genel amaçlı OpenStack bulutu için, OpenStack alt yapı bileşenlerinin yüksek kullanılırlıklı olması gerekir. Tasarım donanımsal yük dengeleme içermiyorsa, HAProxy gibi ağ yazılım paketlerinin dahil edilmesi gerekir.

source: For a user of a massively scalable OpenStack public cloud, there are no expectations for control over security, performance, or availability. Users expect only SLAs related to uptime of API services, and very basic SLAs for services offered. It is the user's responsibility to address these issues on their own. The exception to this expectation is the rare case of a massively scalable cloud infrastructure built for a private or government organization that has specific requirements.
tr_tr: Büyük ölçekli OpenStack açık bulutunun bir kullanıcısı için, güvenlik, başarım veya kullanılırlık üzerinde kontrol beklentisi yoktur. Kullanıcılar yalnızca API servislerinin hizmet süreleriyle ilgili, ve sunulan servislerle ilgili çok temel SLA'lar beklerler. Bu sorunları ele almak kullanıcının sorumluluğundadır. Bu beklentiye bir istisna özel bir kuruma veya devlet kurumuna inşa edilmiş belirli gereksinimleri olan büyük ölçekte bulut alt yapısıdır.

source: For example, CPU, memory or local storage based compute nodes. For NFV or HPC based clouds, there may even be specific network configurations that should be reserved for those specific workloads on specific compute nodes. This method of designing specific resources into groups or zones of compute can be referred to as bin packing.
tr_tr: Örneğin, CPU, hafıza veya yerel deoplama tabanlı hesaplama düğümleri. NFV veya HPC tabanlı bulutlar için belirli hesaplama düğümlerinde çalışacak belirli iş yükleri için ayrılmış yapılandırmalar bile olabilir. Belirli kaynakları gruplara ya da hesaplama bölgelerine göre tasarlamaya kutu paketleme denir.

source: For example, a cloud administrator might be able to list all instances in the cloud, whereas a user can see only those in his current group. Resources quotas, such as the number of cores that can be used, disk space, and so on, are associated with a project.
tr_tr: Örneğin bir bulut yöneticisi buluttaki tüm sunucuları listeleyebilir, ancak bir kullanıcı yalnızca kendi grubundakileri görüntüleyebilir. Kullanılabilecek çekirdek sayısı, disk alanı, vs gibi kaynak kotaları projeyle ilişkilidir.

source: For example, a system that starts with a single disk and a partition power of 3 can have 8 (2^3) partitions. Adding a second disk means that each has 4 partitions. The one-disk-per-partition limit means that this system can never have more than 8 disks, limiting its scalability. However, a system that starts with a single disk and a partition power of 10 can have up to 1024 (2^10) disks.
tr_tr: Örneğin, 3 bölümleme gücüne sahip tek diskli bir sistem 8 (2^3) bölüme sahip olabilir. İkinci bir disk eklemek her birinin 4 bölümü olacağı anlamına gelir. Disk başına bir bölüm kısıtlaması bu sistemin 8 diskten fazlasına sahip olamayacağı anlamına gelir, bu da ölçeklenebilirliği kısıtlar. Ancak, tek bir diskle ve bölüm gücü 10 ile başlayan bir sistem 1024 (2^10) diske sahip olabilir.

source: For example, consider a cloud backup application. This workload has two specific behaviors that impact the network. Because this workload is an externally-facing service and an internally-replicating application, it has both :term:`north-south<north-south traffic>` and :term:`east-west<east-west traffic>` traffic considerations:
tr_tr: Örneğin, bir bulut yedek uygulamasını ele alın. Bu iş yükünün ağı etkileyen iki özel davranışı bulunur. Bu iş yükü dışa dönük bir servis ve içe dönük çoğaltma uygulaması olduğundan, hem :term:`kuzey-güney<north-south traffic>` hem de :term:`doğu-batı<east-west traffic>` trafik sahibidir.

source: For example, degraded video streams and low quality VoIP sessions negatively impact user experience and may lead to productivity and economic loss.
tr_tr: Örneğin, düşük kalite video akışları ve VoIP oturumları kullanıcı deneyimini eksi yönde etkiler ve üretim ve ekonomik kayba sebep olabilir.

source: For example, if a physical node has 48 GB of RAM, the scheduler allocates instances to that node until the sum of the RAM associated with the instances reaches 72 GB (such as nine instances, in the case where each instance has 8 GB of RAM).
tr_tr: Örneğin 48 GB RAM'i olan fiziksel düğümde zamanlayıcı sunucularla ilişkili RAM 72 GB'yi geçene kadar bu düğüme sunucu ayırmaya devam eder (8 GB RAM'e sahip sunucular olduğunu düşünürsek dokuz sunucu kadar).

source: For example, the EC2 API refers to instances using IDs that contain hexadecimal, whereas the OpenStack API uses names and digits. Similarly, the EC2 API tends to rely on DNS aliases for contacting virtual machines, as opposed to OpenStack, which typically lists IP addresses.
tr_tr: Örneğin EC2 API'si sunuculara onaltılık ID'lerle başvurur, OpenStack API ise isimler ve basamaklarla. Benzer şekilde, EC2 API sanal makineleri yönetirken DNS takma adlarına güvenir, OpenStack ise genellikle IP adreslerini listeler.

source: For example, you must plan the number of IP addresses that you need for both your guest instances as well as management infrastructure. Additionally, you must research and discuss cloud network connectivity through proxy servers and firewalls.
tr_tr: Örneğin hem misafir sunucularınız hem de yönetim alt yapınız için IP adreslerini planlamalısınız. Ek olarak vekil sunucular ve güvenlik duvarları içinden geçen bulut ağ bağlantınızı araştırmalı ve tartışmalısınız.

source: For example, you should consider the time required to run a workload in different clouds and methods for reducing this time. This may require moving data closer to applications or applications closer to the data they process, and grouping functionality so that connections that require low latency take place over a single cloud rather than spanning clouds.
tr_tr: Örneğin, bu zamanı azaltmak için bir iş yükünün farklı bulutlarda ve yöntemlerde alacağı zamanı göz önüne almalısınız. Bu da veriyi uygulamalara ya da uygulamaları işledikleri verilere yakın tutmak ve işlevselliği gruplamak olabilir böylece az gecikme gerektiren bağlantılar birden çok bulut içinde değil aynı bulut içinde gerçekleşir.

source: For information about deploying and operating OpenStack, see the `Installation Tutorials and Guides <https://docs.openstack.org/project-install-guide/ocata/>`_, `Deployment Guides <https://docs.openstack.org/project-deploy-guide/ocata/>`_, and the `OpenStack Operations Guide <https://docs.openstack.org/ops-guide/>`_.
tr_tr: OpenStack kurulum ve işletimiyle ilgili bilgi için, `Kurulum Öğreticileri ve Kılavuzları <https://docs.openstack.org/project-install-guide/ocata/>`_, `Kurulum Kılavuzları <https://docs.openstack.org/project-deploy-guide/ocata/>`_, ve `OpenStack İşletim Kılavuzuna <https://docs.openstack.org/ops-guide/>`_ göz atın.

source: For instructions on installing Logstash, Elasticsearch and Kibana, see the `Elasticsearch reference <https://www.elastic.co/guide/en/elasticsearch/reference/current/getting-started.html>`_.
tr_tr: Logstash, Elasticsearch ve Kibana yükleme yönergeleri için bknz `Elasticsearch kaynağı <https://www.elastic.co/guide/en/elasticsearch/reference/current/getting-started.html>`_.

source: For many deployments, the cloud controller is a single node. However, to have high availability, you have to take a few considerations into account, which we'll cover in this chapter.
tr_tr: Çoğu kurulum için bulut kontrol birimi tek bir düğümdür. Ancak yüksek kullanılırlık için bu bölümde kapsayacağımız bazı etmenleri göz önünde tutmalısınız.

source: For many use cases the proximity of the user to their workloads has a direct influence on the performance of the application and therefore should be taken into consideration in the design. Certain applications require zero to minimal latency that can only be achieved by deploying the cloud in multiple locations. These locations could be in different data centers, cities, countries or geographical regions, depending on the user requirement and location of the users.
tr_tr: Çoğu kullanım durumunda kullanıcının iş yüklerine yakınlığının uygulama başarımına doğrudan etkisi vardır, yani tasarımda bu göz önüne alınmalıdır. Bazı uygulamalar sıfır ya da asgari gecikme gerektirirler, bu da bulutu birden çok konumda kurmakla elde edilebilir. Bu konumlar kullanıcı gereksinimi ve kullanıcıların konumuna göre değişik veri merkezleri, şehirler, ülkeler veya coğrafik bölgeler olabilir.

source: For more information about NUMA, see `CPU topologies <https://docs.openstack.org/admin-guide/compute-cpu-topologies.html>`_ in the Administrator Guide.
tr_tr: NUMA hakkında daha fazla bilgi için, Yönetici Kılavuzundaki `CPU topolojileri <https://docs.openstack.org/admin-guide/compute-cpu-topologies.html>`_ kısmına bakın.

source: For more information about feature support for hypervisors as well as ironic and Virtuozzo (formerly Parallels), see `Hypervisor Support Matrix <https://docs.openstack.org/developer/nova/support-matrix.html>`_ and `Hypervisors <https://docs.openstack.org/ocata/config-reference/compute/hypervisors.html>`_ in the Configuration Reference.
tr_tr: Hipervizörler için özellik desteği ve ironic ve Virtuozzo (eski Parallels) ile ilgili daha fazla bilgi için Yapılandırma Kaynakçasındaki `Hipervizör Destek Matrisi <https://docs.openstack.org/developer/nova/support-matrix.html>`_ ve `Hipervizörler <https://docs.openstack.org/ocata/config-reference/compute/hypervisors.html>`_ bağlantılarına göz atın.

source: For more information on configuring Block Storage to use NFS storage, see `Configure an NFS storage back end <https://docs.openstack.org/admin-guide/blockstorage-nfs-backend.html>`_ in the OpenStack Administrator Guide.
tr_tr: NFS depolama kullanan Blok Depolama yapılandırması hakkında daha fazla bilgi için OpenStack Yönetici Kılavuzundaki `NFS depolama arka ucu yapılandırmasına <https://docs.openstack.org/admin-guide/blockstorage-nfs-backend.html>`_ göz atın.

source: For more information on high availability in OpenStack, see the `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/>`_.
tr_tr: OpenStack'de yüksek kullanılırlıkla ilgili daha fazla bilgi için, `OpenStack Yüksek Kullanılırlık Kılavuzuna <https://docs.openstack.org/ha-guide/>`_ göz atın.

source: For more information on managing and maintaining your OpenStack environment, see the `OpenStack Operations Guide <https://docs.openstack.org/ops-guide/index.html>`_.
tr_tr: OpenStack ortamınızı yönetmek ve bakım hakkında daha fazla bilgi için `OpenStack İşlem Kılavuzuna <https://docs.openstack.org/ops-guide/index.html>`_ göz atın.

source: For more information, please see the `Swift replication page <https://docs.openstack.org/developer/swift/overview_replication.html>`_.
tr_tr: Daha fazla bilgi için, `Swift çoğaltma sayfasına <https://docs.openstack.org/developer/swift/overview_replication.html>`_ göz atın.

source: For our example, the cloud controller has a collection of ``nova-*`` components that represent the global state of the cloud; talks to services such as authentication; maintains information about the cloud in a database; communicates to all compute nodes and storage :term:`workers <worker>` through a queue; and provides API access. Each service running on a designated cloud controller may be broken out into separate nodes for scalability or availability.
tr_tr: Örneğimize göre, bulut kontrol biriminin bulutun genel durumunu temsil eden ``nova-*`` bileşenleri koleksiyonu bulunur; kimlik doğrulama gibi servislerle konuşur; bulut hakkında bilgiyi bir veritabanında yönetir; tüm hesaplama düğümleri ve deoplama :term:`işçileriyle <worker>` bir kuyruk aracılığıyla konuşur; ve API erişimi sağlar. Belirlenmiş bulut kontrol biriminde çalışan her servis ölçeklenebilirlik ve kullanılabilirlik için ayrı düğümlere dağıtılmış olabilir.

source: Front end web for API requests, the scheduler for choosing which compute node to boot an instance on, Identity services, and the dashboard
tr_tr: API istekleri için web ön yüzü, bir sunucunun hangi hesaplama düğümünde önyükleneceğini seçmek için zamanlayıcı, Kimlik servisleri ve kontrol paneli

source: Furthermore, on large layer-2 networks, configuring ARP learning can be complicated. The setting for the MAC address timer on switches is critical and, if set incorrectly, can cause significant performance problems. So when migrating MACs to different physical locations to support instance migration, problems may arise. As an example, the Cisco default MAC address timer is extremely long. As such, the network information maintained in the switches could be out of sync with the new location of the instance.
tr_tr: Dahası, büyük katman-2 ağlarda, ARP öğrenmesini yapılandırmak da karmaşık olabilir. Anahtarlardaki MAC adresi zamanlayıcısı kritiktir ve yanlış ayarlanırsa büyük başarım sorunlarına yol açar. Yani sunucu göçünü desteklemek için MAC'leri farklı fiziksel konumlara taşırken sorunlar ortaya çıkabilir. Örnek olarak Cisco öntanımlı MAC adres zamanlayıcısı çok uzundur. Yani sunucunun yeni konuma geçmesiyle ağ anahtarında tutulan ağ bilgisi eşzamanlanmamış olur.

source: General compute cloud
tr_tr: Genel hesaplama bulutu

source: General examples and configuration guides can be found on the Elastic `Logstash Configuration page <https://www.elastic.co/guide/en/logstash/current/configuration-file-structure.html>`_.
tr_tr: Genel örnekler ve yapılandırma kılavuzları Elastic `Logstash Yapılandırma sayfasında <https://www.elastic.co/guide/en/logstash/current/configuration-file-structure.html>`_ bulunabilir.

source: Geographical considerations may also impact the cost of building or leasing data centers. Considerations include:
tr_tr: Coğrafi etkenler veri merkezi kiralama veya inşa etme masraflarını da etkileyebilir. Etmenler şunları içerir:

source: Hardware Considerations
tr_tr: Donanım Etmenleri

source: Hardware must support network redundancy.
tr_tr: Donanım ağ yedekliliğini desteklemeli.

source: Hardware resources selected for the resource nodes should be capable of supporting enough storage for the cloud services. Defining the initial requirements and ensuring the design can support adding capacity is important. Hardware nodes selected for object storage should be capable of support a large number of inexpensive disks with no reliance on RAID controller cards. Hardware nodes selected for block storage should be capable of supporting high speed storage solutions and RAID controller cards to provide performance and redundancy to storage at a hardware level. Selecting hardware RAID controllers that automatically repair damaged arrays will assist with the replacement and repair of degraded or deleted storage devices.
tr_tr: Kaynak düğümler için seçilmiş donanım kaynakları bulut servisleri için yeterli depolamayı destekleme kapasitesine sahip olmalıdır. İlk gereksinimleri tanımlamak ve tasarımın ek kapasiteyi kaldırabileceğini bilmek önemlidir. Nesne depolama için seçilen donanım düğümleri RAID kontrol kartlarına bel bağlamadan yüksek sayıda ucuz diski destekleyebilmelidir. Blok depolama için seçilen donanım düğümleri yüksek hızlı depolama çözümlerini ve RAID kontrol kartlarını destekleyerek donanım seviyesinde başarım ve depolama yedekliliği sağlayabilmelidir. Otomatik olarak hasarlı dizileri tamir eden donanımsal RAID kontrol kartlarını tercih etmek silinen ya da eski kalmış depolama aygıtlarının tamirinde yardımcı olacaktır.

source: Heavy I/O usage on one compute node does not affect instances on other compute nodes. Direct I/O access can increase performance.
tr_tr: Bir hesaplama düğümündeki ağır I/O kullanımı diğer hesaplama düğümlerindeki sunucuları etkilemez. Doğrudan I/O erişimi başarımı artırabilir.
