Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: In any environment larger than just a few hosts, there are two areas that might be subject to a SLA:
tr_tr: Bir kaç sunucudan büyük olan her ortamda SLA'ya konu olabilecek iki alan vardır:

source: In compute server architecture design, you must also consider network and storage requirements. For more information on network considerations, see :ref:`network-design`.
tr_tr: Hesaplama sunucusu mimarisi tasarımında, ağ ve depolama gereksinimlerini de hesaba katmalısınız. Ağ etmenleriyle ilgili daha fazla bilgi için bknz :ref:`network-design`.

source: In environments that place substantial demands on Block Storage, we recommend using multiple storage pools. In this case, each pool of devices should have a similar hardware design and disk configuration across all hardware nodes in that pool. This allows for a design that provides applications with access to a wide variety of Block Storage pools, each with their own redundancy, availability, and performance characteristics. When deploying multiple pools of storage, it is also important to consider the impact on the Block Storage scheduler which is responsible for provisioning storage across resource nodes. Ideally, ensure that applications can schedule volumes in multiple regions, each with their own network, power, and cooling infrastructure. This will give tenants the option of building fault-tolerant applications that are distributed across multiple availability zones.
tr_tr: Blok Depolamaya yük bindiren ortamlarda, birden fazla depolama havuzu kullanılmasını öneriyoruz. Bu durumda, her bir aygıt havuzu bu havuzdaki tüm donanım düğümleri arasında benzer donanım tasarımı ve disk yapılandırmasına sahip olmalıdır. Bu uygulamalara her biri kendi yedekliliğine, kullanılırlığına ve başarım karakteristiklerine sahip çeşitli Blok Depolama havuzlarına erişim sağlayan bir tasarıma izin verir. Birden fazla depolama havuzu kurarken, düğüm kaynakları arasında depolama hazırlamakla görevli Blok Depolama zamanlayıcısına olan etkinin de göz önünde tutulması gerekir. İdeal olarak, uygulamaların birimleri her biri kendi ağ, güç ve soğutma alt yapısına sahip birden fazla bölgede zamanlayabildiklerinden emin olun. Bu kiracılara birden çok kullanılırlık bölgesine dağıtılmış hata toleranslı uygulamalar inşa etme seçeneği verir.

source: In general, the questions you should ask when selecting storage are as follows:
tr_tr: Genel olarak, depolama seçerken sormanız gereken sorular şunlardır:

source: In layer-3 networking, routing takes instance MAC and IP addresses out of the network core, reducing state churn. The only time there would be a routing state change is in the case of a Top of Rack (ToR) switch failure or a link failure in the backbone itself. Other advantages of using a layer-3 architecture include:
tr_tr: Katman-3 ağda, yönlendirme sunucu MAC ve IP adreslerini ağ çekirdeğinden alır, bu da çalkalanmayı azaltır. Yönlendirme durum değişikliği ancak Kabin Üstü (ToR) anahtar arızasında veya omurgadaki bir bağlantıda sorun olduğunda olur. Katman-3 mimarisi kullanmanın diğer avantajları şunlardır:

source: In most cases, hyper-threading CPUs can provide a 1.3x to 2.0x performance benefit over non-hyper-threaded CPUs depending on types of workload.
tr_tr: Çoğu durumda, hyper-threading işlemciler iş yükü türüne bağlı olarak 1.3 kattan 2.0 kata kadar başarım artışı sağlarlar.

source: In multi-tenant OpenStack cloud environment, the Shared File Systems service (manila) provides a set of services for management of shared file systems. The Shared File Systems service supports multiple back-ends in the form of drivers, and can be configured to provision shares from one or more back-ends. Share servers are virtual machines that export file shares using different file system protocols such as NFS, CIFS, GlusterFS, or HDFS.
tr_tr: Çoklu kiracılı OpenStack bulut ortamında, Paylaşımlı Dosya Sistemi servisi (manila) paylaşımlı dosya sistemlerinin yönetimi için bir servis kümesi sağlar. Paylaşımlı Dosya Sistemleri servisi sürücüler biçiminde birden çok arka uç destekler, ve paylaşımları bir ya da daha fazla arka uçtan hazırlayacak şekilde yapılandırılabilir. Paylaşım sunucuları dosya paylaşımlarını NFS, CIFS, GlusterFS, veya HDFS gibi farklı dosya sistemi iletişim kurallarını kullanarak dışa aktarabilen sanal makinelerdir.

source: In order to take advantage of these new enhancements in the Compute service, compute hosts must be using NUMA capable CPUs.
tr_tr: Hesaplama servisindeki bu yeni iyileştirmelerden faydalanmak için, hesaplama sunucuları NUMA kapasiteli işlemciler kullanmalıdır.

source: In some cases, the demand on Block Storage may exhaust the available network bandwidth. As a result, design network infrastructure that services Block Storage resources in such a way that you can add capacity and bandwidth easily. This often involves the use of dynamic routing protocols or advanced networking solutions to add capacity to downstream devices easily. Both the front-end and back-end storage network designs should encompass the ability to quickly and easily add capacity and bandwidth.
tr_tr: Bazı durumlarda, Blok Depolama talebi kullanılabilir ağ bant genişliğini yorabilir. Sonuç olarak, Blok Depolama kaynaklarına ihtiyaç halinde kapasite ya da bant genişliğini kolaylıkla ekleyebileceğiniz ağ alt yapıları tasarlayın. Bu çoğu zaman dinamik yönlendirme iletişim kurallarının veya aşağı akış aygıtlarına kolaylıkla kapasite eklemek için gelişmiş ağ çözümlerinin kullanılmasını içerir. Hem ön uç hem arka uç depolama ağı tasarımları kolayca kapasite ve bant genişliği ekleme konusunu kapsamalıdır.

source: In some cases, you must add bandwidth and capacity to the network resources servicing requests between proxy servers and storage nodes. For this reason, the network architecture used for access to storage nodes and proxy servers should make use of a design which is scalable.
tr_tr: Bazı durumlarda, vekil sunucular ve depolama düğümleri arasında istekleri sunan ağ kaynakları için bant genişliği ve kapasite eklemeniz gerekebilir. Bu sebeple depolama düğümleri ve vekil sunuculara erişim için kullanılan ağ mimarisi ölçeklenebilir bir tasarımı kullanmalıdır.

source: In the previous version of OpenStack, all ``nova-compute`` services required direct access to the database hosted on the cloud controller. This was problematic for two reasons: security and performance. With regard to security, if a compute node is compromised, the attacker inherently has access to the database. With regard to performance, ``nova-compute`` calls to the database are single-threaded and blocking. This creates a performance bottleneck because database requests are fulfilled serially rather than in parallel.
tr_tr: OpenStack'in önceki sürümünde tüm ``nova-compute`` servisleri bulut kontrol biriminde sunulan veritabanına doğrudan erişim gerektiriyordu. Bu iki sebepten sorunludur: güvenlik ve başarım. Güvenliğe nazaran, bir hesaplama düğümü ele geçirilirse, saldırgan veritabanına erişim sağlayabilir. Başarımı düşünürsek, veritabanına yapılan ``nova-compute`` çağrıları tek iş ipliklidir ve engelleyicidir. Bu da veritabanı istekleri paralel yerine seri işleneceğinden başarım sorunları oluşturur.

source: In this example, Ceph presents a swift-compatible REST interface, as well as a block level storage from a distributed storage cluster. It is highly flexible and has features that enable reduced cost of operations such as self healing and auto balancing. Using erasure coded pools are a suitable way of maximizing the amount of usable space.
tr_tr: Bu örnekte, Ceph swift-uyumlu bir REST arayüzü ve dağıtım depolama kümesinden blok seviyesinde depolama sunar. Oldukça esnektir ve kendini iyileştirme ve otomatik dengeleme gibi işlemlerin maliyetini azaltan özelliklere sahiptir. Silinti kodlu havuzlar kullanmak azami kullanılır alana sahip olmak için uygun bir yöntemdir.

source: In this option, each compute node is specified with a significant amount of disk space, but a distributed file system ties the disks from each compute node into a single mount.
tr_tr: Bu seçenekte, her hesaplama düğümü kayda değer miktarda disk alanıyla belirtilir, ama dağıtık bir dosya sistemi her bir hesaplama düğümünden diskleri tek bir bağlama noktasına bağlar.

source: In this option, each compute node is specified with enough disks to store the instances it hosts.
tr_tr: Bu seçenekte, her hesaplama düğümü sunduğu sunucuları saklamak için yeterli diskle belirtilir.

source: In this option, the disks storing the running instances are hosted in servers outside of the compute nodes.
tr_tr: Bu seçenekte, çalışan sunucuları saklayan diskler hesaplama düğümleri dışındaki sunucularda sunulur.

source: In-memory key-value Store (a simplified internal storage structure)
tr_tr: Hafızada anahtar-değer saklama (basitleştirilmiş dahili depolama yapısı)

source: Increasing OpenStack Object Storage means network bandwidth needs to be taken into consideration. Running OpenStack Object Storage with network connections offering 10 GbE or better connectivity is advised.
tr_tr: OpenStack Nesne Depolamanın artırılması demek ağ genişliğinin hesaba katılması demektir. OpenStack Nesne Depolamanın 10 GbE veya daha iyi bağlantı sağlayan ağ bağlantılarıyla çalıştırılması önerilir.

source: Increasing the size of the supporting compute environment increases the network traffic and messages, adding load to the controllers and administrative services used to support the OpenStack cloud or networking nodes. When considering hardware for controller nodes, whether using the monolithic controller design, where all of the controller services live on one or more physical hardware nodes, or in any of the newer shared nothing control plane models, adequate resources must be allocated and scaled to meet scale requirements. Effective monitoring of the environment will help with capacity decisions on scaling. Proper planning will help avoid bottlenecks and network oversubscription as the cloud scales.
tr_tr: Destekleyen hesaplama ortamının boyutunu artırmak ağ trafiği ve iletileri de artırır, OpenStack bulutunu veya ağ düğümlerini desteklemek için kullanılan kontrol birimlerine ve yönetim servislerine ek yük bindirir. Kontrol düğümlerine donanım eklemeyi düşünürken, tüm kontrol servislerinin bir ya da daha fazla fiziksel donanım düğümlerinde çalıştığı tek parça kontrol tasarımı kullanılıyor olsa da, daha yeni hiçbir şeyin paylaşılmadığı kontrol düzlemi modellerinden birinde olunsa da ölçekleme gereksinimlerini karşılamak için yeterli kaynak ayrılmalı ve ölçeklenmelidir. Ortamın etkin şekilde izlenmesi ölçeklemede kapasite seçimine yardımcı olacaktır. Düzgün planlama bulut ölçeklendikçe ağ abonelik aşımlarını ve darboğazların olmasını engeller.

source: Indicates which resources to use first; for example, spreading out where instances are launched based on an algorithm
tr_tr: İlk önce hangi kaynakların kullanılacağını belirtir, örneğin bir algoritmaya göre sunucuların başlatıldığı yayılım

source: Indicates which users can do what actions on certain cloud resources; quota management is spread out among services, howeverauthentication
tr_tr: Hangi kullanıcıların hangi eylemleri belirli bulut kaynaklarına göre yapabileceğini gösterir; kota yönetimi servisler arasına dağılmıştır, ancak yetkilendirme

source: Input-Output performance requirements require researching and modeling before deciding on a final storage framework. Running benchmarks for Input-Output performance provides a baseline for expected performance levels. If these tests include details, then the resulting data can help model behavior and results during different workloads. Running scripted smaller benchmarks during the lifecycle of the architecture helps record the system health at different points in time. The data from these scripted benchmarks assist in future scoping and gaining a deeper understanding of an organization's needs.
tr_tr: Girdi-Çıktı başarım gereksinimleri depolama çatısının son haline karar verilmeden araştırılmalı ve modellenmelidir. Girdi-Çıktı başarımı için değerlendirme deneyleri çalıştırmak beklenen başarım seviyeleri için temel bir çizgi sağlar. Bu deneyler ayrıntıları içerirse, sonuçta alınan veri farklı iş yükleri için davranış ve sonuç modellemede yardımcı olabilir. Mimarinin yaşam sürecinde betik halinde daha küçük değerlendirme deneyleri çalıştırmak sistem sağlığını zamanda farklı noktalarda kaydetmede yardımcı olur. Bu betik halindeki değerlendirme deneylerinden gelen veri ilerdeki kapsamın belirlenmesinde ve bir kurumun ihtiyaçlarının daha derinden anlanabilmesinde yardımcı olur.

source: Input-Output requirements
tr_tr: Girdi-Çıktı gereksinimleri

source: Installs a virtual environment and runs tests.
tr_tr: Sanal bir ortam kurar ve denemeler çalıştırır.

source: Instance and image locations
tr_tr: Sunucu ve imaj konumları

source: Instance density
tr_tr: Sunucu yoğunluğu

source: Instance storage solutions
tr_tr: Sunucu depolama çözümleri

source: Insufficient disk capacity could also have a negative effect on overall performance including CPU and memory usage. Depending on the back end architecture of the OpenStack Block Storage layer, capacity includes adding disk shelves to enterprise storage systems or installing additional Block Storage nodes. Upgrading directly attached storage installed in Compute hosts, and adding capacity to the shared storage for additional ephemeral storage to instances, may be necessary.
tr_tr: Yetersiz disk kapasitesinin de işlemci ve hafıza kullanımıyla birlikte genel başarımda negatif etkisi vardır. OpenStack Blok Depolama katmanının arka uç mimarisine bağlı olarak, kapasite kurumsal depolama sistemlerine disk eklemeyi veya ek Blok Depolama düğümleri eklemeyi içerir. Hesaplama düğümlerine doğrudan ekli deoplamayı yükseltmek, ve sunuculara ek geçici depolama için paylaşımlı depolamaya kapasite eklemek gerekli olabilir.

source: Integration with OpenStack Identity, and works with the OpenStack Dashboard.
tr_tr: OpenStack Kimlik ile tümleşik, ve OpenStack Kontrol Paneli ile birlikte çalışır.

source: Internet Small Computer Systems Interface (iSCSI) is a network protocol that operates on top of the Transport Control Protocol (TCP) for linking data storage devices. It transports data between an iSCSI initiator on a server and iSCSI target on a storage device.
tr_tr: İnternet Küçük Bilgisayar Sistemleri Arayüzü (iSCSI) Aktarım Kontrol İletişim Kuralı (TCP) üzerinde çalışan veri depolama aygıtlarını bağlamak için kullanılan bir ağ iletişim kuralıdır. Bir sunucu üzerindeki iSCSI başlatıcı ile depolama aygıtındaki iSCSI hedefi arasında veri aktarır.

source: Is it interoperable with all of the projects you are planning on using in your cloud?
tr_tr: Bulutunuzda kullanmayı düşündüğünüz tüm projelerle birlikte çalışabilir mi?

source: Is the storage proven with the OpenStack platform?
tr_tr: Depolama OpenStack platformuyla uyumlu mu?

source: Isolate virtual networks using encapsulation technologies.
tr_tr: Kapsülleme teknolojilerini kullanarak sanal ağları yalıtın.

source: Issues with live migration
tr_tr: Canlı göç ile ilgili sorunlar

source: It can be difficult to troubleshoot a network without IP addresses and ICMP.
tr_tr: IP adresleri ve ICMP olmadan bir ağda sorun gidermek zordur.

source: It is also important to consider how costs will increase as your cloud scales. Choices that have a negligible impact in small systems may considerably increase costs in large systems. In these cases, it is important to minimize capital expenditure (CapEx) at all layers of the stack. Operators of massively scalable OpenStack clouds require the use of dependable commodity hardware and freely available open source software components to reduce deployment costs and operational expenses. Initiatives like Open Compute (more information available in the `Open Compute Project <http://www.opencompute.org>`_) provide additional information.
tr_tr: Bulutunuz ölçeklendiğinde masrafların da nasıl artacağını göz önünde tutmak önemlidir. Küçük sistemlerde önemsiz etkisi olan seçimler sistem büyüdüğünde masrafları kayda değer ölçüde artırabilir. Bu gibi durumlarda, yığının tüm katmanlarında sermaye masrafını (CapEx) asgariye düşürmek önemlidir. Büyük ölçekte OpenStack bulutlarını işletenlerin güvenilir donanım malları ve özgürce kullanılabilir açık kaynak yazılım bileşenlerini kullanarak kurulum ve işletme masraflarını düşürmeleri gereklidir. Açık Hesaplama gibi (daha fazla bilgi için bknz `Açık Hesaplama Projesi <http://www.opencompute.org>`_) girişimler ek bilgi sağlarlar.

source: It is also possible to run multiple hypervisors in a single deployment using host aggregates or cells. However, an individual compute node can run only a single hypervisor at a time.
tr_tr: Tek bir kurulumda sunucu takımları veya hücreler kullanarak birden çok hipervizör çalıştırmak da mümkün. Ancak, bağımsız bir hesaplama düğümü yalnızca tek bir hipervizör çalıştırabilir.

source: It is difficult to predict the amount of load a particular application might incur if the number of users fluctuates, or the application experiences an unexpected increase in use. It is possible to define application requirements in terms of vCPU, RAM, bandwidth, or other resources and plan appropriately. However, other clouds might not use the same meter or even the same oversubscription rates.
tr_tr: Belli bir uygulamanın kullanıcı sayısı dalgalandığında veya uygulama kullanımda beklenmedik artış yaşadığında alacağı yükü tahmin etmek zordur. Uygulama gereksinimlerini vCPU, RAM, bant genişliği, veeya diğer kaynaklara göre belirleyip uygun planlama yapmak mümkündür. Ancak, diğer bulutlar aynı ölçümleri hatta aynı abonelik aşım oranlarını kullanmıyor olabilir.

source: It is essentially an object storage system that manages disks and aggregates the space and performance of disks linearly in hyper scale on commodity hardware in a smart way. On top of its object store, Sheepdog provides elastic volume service and http service. Sheepdog does require a specific kernel version and can work nicely with xattr-supported file systems.
tr_tr: Özünde diskleri yöneten ve disklerin alanını ve başarımını doğrusal olarak büyük ölçekte ticari donanım üzerinde akıllıca bir yolla takımlayan nesne depolama sistemidir. Nesne depolamasının üstüne, Sheepdog esnek birim servisi ve http servisi sağlar. Sheepdog belirli bir çekirdek sürümüne ihtiyaç duyar ve xattr-destekli dosya sistemlerinde güzelce çalışabilir.

source: It is important to analyze the applications tolerance for latency and jitter when designing an environment to support network focused applications. Certain applications, for example VoIP, are less tolerant of latency and jitter. When latency and jitter are issues, certain applications may require tuning of QoS parameters and network device queues to ensure that they immediately queue for transmitting or guarantee minimum bandwidth. Since OpenStack currently does not support these functions, consider carefully your selected network plug-in.
tr_tr: Ağ odaklı uygulamaları destekleyen bir ortam tasarlarken uygulamanın gecikme ve titremeye karşı dayanıklılığını çözümlemek önemlidir. Bazı uygulamalar, örneğin VoIP gecikmeye pek gelmez. Gecikme ve titreme sorun olduğunda, bazı uygulamalar QoS parametreleri ve ağ aygıt kuyruklarıyla ayarlanarak iletim kuyruğuna anında alınmaları ya da asgari bant genişliği atamalarının yapılması sağlanabilir. OpenStack şu an bu özellikleri desteklemediğinden, seçtiğiniz ağ eklentisini dikkatle ele alın.

source: It is important to consider the functionality, security, scalability, availability, and testability of the network when choosing a CMP and cloud provider.
tr_tr: Bir CMP ve bulut sağlayıcısı seçerken ağın işlevsellik, güvenlik, ölçeklenebilirlik, kullanılabilirlik, ve denenebilirliğini göz önüne almak önemlidir.

source: It is important to determine as part of the SLA negotiation which party is responsible for monitoring and starting up the Compute service instances if an outage occurs.
tr_tr: Bir kesinti durumunda hangi tarafın Hesaplama servisi sunucularını başlatmaktan ve takip etmekten sorumlu olduğunu SLA el sıkışmalarında tanımlamak önemlidir.

source: It is important to know that layer-2 has a very limited set of network management tools. It is difficult to control traffic as it does not have mechanisms to manage the network or shape the traffic. Network troubleshooting is also troublesome, in part because network devices have no IP addresses. As a result, there is no reasonable way to check network delay.
tr_tr: Katman-2'nin çok kısıtlı ağ yönetim araçları olduğunu bilmek önemlidir. Ağı yönetmek ve trafiği şekillendirmek için mekanizmaları olmadığından trafiği kontrol etmek zordur. Kısmen ağ aygıtlarının IP adresi olmadığından, ağda sorun giderme de sorunludur. Sonuç olarak, ağ gecikmesini kontrol edecek makul bir yol yoktur.

source: It is important to understand what happens to the replication of objects and data between the sites when a site goes down. If this causes queues to start building up, consider how long these queues can safely exist until an error occurs.
tr_tr: Bir konum çalışmaz hale geldiğinde nesnelerin kopyalarına ve konumlar arasındaki veriye ne olduğunu anlamak önemlidir. Eğer bu kuyrukların oluşmasına sebep oluyorsa, bu kuyrukların bir hata oluşmadan ne kadar uzun var olabileceklerini düşünün.

source: It is possible to gain more performance out of a single storage system by using specialized network technologies such as RDMA, SRP, iSER and SCST. The specifics of using these technologies is beyond the scope of this book.
tr_tr: RDMA, SRP, iSER ve SCST gibi özelleştirilmiş ağ teknolojilerini kullanarak tek bir depolama sisteminden daha çok başarım almak mümkündür. Bu teknolojilerin kullanımı bu kitabın kapsamı dışında kalıyor.

source: It is recommended to have a single authentication domain rather than a separate implementation for each and every site. This requires an authentication mechanism that is highly available and distributed to ensure continuous operation. Authentication server locality might be required and should be planned for.
tr_tr: Her konum için ayrı bir uygulama yerine tek bir yetkilendirme alanının olması tavsiye edilir. Bu yüksek kullanılırlıklı ve dağıtık bir yetkilendirme mekanizması demektir. Yetkilendirme sunucusunun konumu planlanmalıdır.

source: It may be necessary to implement a third party caching layer for some applications to achieve suitable performance.
tr_tr: Uygun başarımı yakalamak için bazı uygulamalar için üçüncü taraf bir ön bellekleme katmanı uygulamak gerekebilir.

source: It may be possible to share the external storage for other purposes.
tr_tr: Harici depolamayı diğer amaçlar için paylaşmak mümkün olabilir.

source: It's also possible to use virtual machines for all or some of the services that the cloud controller manages, such as the message queuing. In this guide, we assume that all services are running directly on the cloud controller.
tr_tr: Bulut kontrol biriminin yönettiği ileti kuyruğu gibi bazı servisler ya da tüm servisler için sanal makineler kullanmak da mümkündür. Bu kılavuzda, tüm servislerin bulut kontrol biriminde çalıştığını varsayacağız.

source: Justification
tr_tr: Gerekçe

source: LDAP (such as OpenLDAP or Microsoft's Active Directory)
tr_tr: LDAP (OpenLDAP veya Microsoft Active Directory gibi)
