Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: Scaling storage solutions in a storage-focused OpenStack architecture design is driven by initial requirements, including :term:`IOPS <Input/output Operations Per Second (IOPS)>`, capacity, bandwidth, and future needs. Planning capacity based on projected needs over the course of a budget cycle is important for a design. The architecture should balance cost and capacity, while also allowing flexibility to implement new technologies and methods as they become available.
tr_tr: Depolama çözümlerini depolama-odaklı bir OpenStack mimari tasarımında ölçeklendirmek :term:`IOPS <Input/output Operations Per Second (IOPS)>`, kapasite, bant genişlği, ve gelecekti ihtiyaçlar gibi bazı gereksinimler ister. Bir bütçe dönemi boyunca öngörülen ihtiyaçlar doğrultusunda kapasite planlamak tasarım için önemlidir. Mimari, kapasite ve giderleri dengelemeli, yeni teknoloji ve yöntemleri kullanılabilir olduklarında uygulayacak esnekliğe sahip olmalıdır.

source: Scaling your cloud
tr_tr: Bulutunuzu ölçekleme

source: Scenario
tr_tr: Senaryo

source: Scheduling
tr_tr: Zamanlama

source: Scheduling services
tr_tr: Zamanlama servisleri

source: Script
tr_tr: Betik

source: Security
tr_tr: Güvenlik

source: Selecting hardware form factor
tr_tr: Donanım biçim katsayısı seçimi

source: Selecting storage hardware
tr_tr: Depolama donanımı seçmek

source: Selecting the proper zone design is crucial for allowing the Object Storage cluster to scale while providing an available and redundant storage system. It may be necessary to configure storage policies that have different requirements with regards to replicas, retention, and other factors that could heavily affect the design of storage in a specific zone.
tr_tr: Düzgün bölge tasarımını seçmek Nesne Depolama kümesine kullanılabilir ve yedekli depolama sistemi sunarken ölçekleme imkanı sağlar. Yedekler, koruma ve belirli bir bölgedeki depolamanın tasarımını derinden etkileyebilecek diğer etmenlere nazaran farklı gereksinimlere sahip depolama ilkeleri yapılandırmak gerekli olabilir.

source: Separation of Services
tr_tr: Servislerin Ayrılması

source: Server density
tr_tr: Sunucu yoğunluğu

source: Server hardware
tr_tr: Sunucu donanımı

source: Service level agreements
tr_tr: Servis seviyesi anlaşmaları

source: Service level agreements (SLA) must be developed in conjunction with business, technical, and legal input. Small, private clouds may operate under an informal SLA, but hybrid or public clouds generally require more formal agreements with their users.
tr_tr: Servis seviyesi anlaşmalaro (SLA) iş, teknik, ve yasal girdilerle birlikte geliştirilmelidir. Küçük, özel bulutlar resmi olmayan bir SLA ile çalışabilirler, ama melez veya açık bulutlar genellikle kullanıcılarıyla yasal anlaşmalar gerektirirler.

source: Service-level agreements (SLAs) define the levels of availability that will impact the design of an OpenStack cloud to provide redundancy and high availability.
tr_tr: Servis seviyesi anlaşmaları (SLA'lar) yedeklilik ve yüksek kullanılırlık sağlamak için bir OpenStack bulutunun tasarımını etkileyen kullanılırlık seviyelerini tanımlar.

source: Services providing RPC, such as ``RabbitMQ``.
tr_tr: ``RabbitMQ`` gibi RPC sağlayan servisler.

source: Set rate limits and quotas for specific shares and snapshots.
tr_tr: Belirli paylaşım ve anlık görüntüler için oran sınırları ve kotalar ayarla.

source: Shared File System storage
tr_tr: Paylaşımlı Dosya Sistemi depolama

source: Shared File Systems service does not apply any additional encryption above what the share’s back-end storage provides
tr_tr: Paylaşımlı Dosya Sistemleri servisi paylaşımın arka ucunun sağladığının dışında ek şifreleme uygulamaz

source: Shared storage including SAN based arrays, storage clusters such as ``Ceph``, and/or NFS services.
tr_tr: SAN tabanlı diziler dahil paylaşımlı depolama, ``Ceph``, ve/veya NFS servisleri gibi depolama kümeleri.

source: Sheepdog is a userspace distributed storage system. Sheepdog scales to several hundred nodes, and has powerful virtual disk management features like snapshot, cloning, rollback and thin provisioning.
tr_tr: Sheepdog kullanıcı uzayında çalışan dağıtık depolama sistemidir. Sheepdog yüzlerce düğüme ölçeklenebilir ve güçlü sanal disk yönetim özelliklerine sahiptir, örneğin anlık görüntüler, klonlama, geri dönme, ve ince hazırlama.

source: Should my persistent storage drives be contained in my compute nodes, or should I use external storage?
tr_tr: Kalıcı depolama sürücülerim hesaplama düğümlerinde mi olmalı, yoksa harici depolama mı kullanmalıyım?

source: Similarly, the default RAM allocation ratio of 1.5:1 means that the scheduler allocates instances to a physical node as long as the total amount of RAM associated with the instances is less than 1.5 times the amount of RAM available on the physical node.
tr_tr: Benzer şekilde, öntanımlı RAM ayırma oranı olan 1.5:1, zamanlayıcının sunucu ile ilişkili toplam RAM miktarının fiziksel düğümdeki RAM miktarının 1.5 katından az olduğu sürece fiziksel düğüme sunucu ayıracağı anlamına gelir.

source: Single Point Of Failure (SPOF)
tr_tr: Tek Kırılma Noktası (SPOF)

source: Site loss and recovery
tr_tr: Konum kaybı ve kurtarma

source: Size your database server accordingly, and scale out beyond one cloud controller if many instances will report status at the same time and scheduling where a new instance starts up needs computing power.
tr_tr: Veritabanı sunucunuzu uygun şekilde boyutlandırın, ve eğer bir çok sunucu aynı anda durum raporu verecekse bir bulut kontrol biriminden öteye ölçekleyin, yeni bir sunucu başlarken hesaplama gücü isteyecektir.

source: Sizing determined by…
tr_tr: Boyutlandırmaya karar verme kriteri...

source: Software to provide load balancing
tr_tr: Yük dengeleme sağlayacak yazılım

source: Solutions that employ Galera/MariaDB require at least three MySQL nodes.
tr_tr: Galera/MariaDB dahil eden çözümler en az üç MySQL düğümü gerektirir.

source: Some applications are tolerant of a lack of synchronized object storage, while others may need those objects to be replicated and available across regions. Understanding how the cloud implementation impacts new and existing applications is important for risk mitigation, and the overall success of a cloud project. Applications may have to be written or rewritten for an infrastructure with little to no redundancy, or with the cloud in mind.
tr_tr: Bazı uygulamalar eşzamanlı nesne depolamanın olmayışına müsamaha gösterebilirler, diğerleri is bu nesnelerin çoğaltılmış ve bölgeler arasında kullanılabilir olmasını gerektirebilir. Bulut kurulumunun yeni ve mevcut uygulamaların risk azaltımını, veya projenin genel başarısını nasıl etkilediğini anlamak önemlidir. Uygulamaların bulut göz önünde bulundurularak çok az yedeklilik olan ya da hiç olmayan alt yapılar için yazılması veya tekrar yazılması gerekebilir.

source: Some basic benchmarks for small read/writes:
tr_tr: Küçük okuma/yazmalar için bazı değerlendirme deneyleri:

source: Some of the key considerations in the selection of networking hardware include:
tr_tr: Ağ donanımı seçerken göz önüne alınacak bazı anahtar etmenler şunlardır:

source: Some other potential design impacts include:
tr_tr: Diğer bazı tasarım etmenleri şunlardır:

source: Some services are commonly shared between multiple regions, including the Identity service and the Dashboard. In this case, it is necessary to ensure that the databases backing the services are replicated, and that access to multiple workers across each site can be maintained in the event of losing a single region.
tr_tr: Bazı servisler genellikle birden çok bölge arasında paylaşılırlar, örneğin Kimlik servisi ve Kontrol Paneli. Bu durumda servisleri destekleyen veritabanlarının çoğaltıldığından, ve bir bölgenin kaybı durumunda her bir konumdaki birden çok işçiye erişimin sağlandığından emin olunmalıdır.

source: Specific meters that are critically important to capture include:
tr_tr: Yakalanması önemli belirli ölçütler şunlardır:

source: Specify access rules and security services for existing shares.
tr_tr: Mevcut paylaşımlar için erişim kuralları ve güvenlik servislerini belirt.

source: Speed
tr_tr: Hız

source: Starting instances and deleting instances is demanding on the compute node but also demanding on the controller node because of all the API queries and scheduling needs.
tr_tr: API sorguları ve zamanlama gereksinimleri sebebiyle sunucuları başlatmak ve silmek hesaplama düğümünde olduğu kadar kontrol düğümünde de yük yaratır.

source: Storage
tr_tr: Depolama

source: Storage architecture
tr_tr: Depolama mimarisi

source: Storage can be a significant portion of the overall system cost. For an organization that is concerned with vendor support, a commercial storage solution is advisable, although it comes with a higher price tag. If initial capital expenditure requires minimization, designing a system based on commodity hardware would apply. The trade-off is potentially higher support costs and a greater risk of incompatibility and interoperability issues.
tr_tr: Depolama genel sistem masrafları arasında önemli bir kısmı tutabilir. Üretici desteğiyle ilgili endişes olan bir kurum için ticari bir çözüm tavsiye edilebilir, her ne kadar daha pahalı olacaksa da. Eğer ilk ana para giderleri asgari olmayı gerektiriyorsa emtia donanım tabanlı bir sistem tasarlamak tavsiye edilebilir. Verilen ödün muhtemel yüksek destek giderleri ve uyumsuzluk ve birlikte çalışılabilirlik sorunları olacaktır.

source: Storage cloud
tr_tr: Depolama bulutu

source: Storage concepts
tr_tr: Depolama kavramları

source: Storage design
tr_tr: Depolama tasarımı

source: Storage hardware architecture is determined by selecting specific storage architecture. Determine the selection of storage architecture by evaluating possible solutions against the critical factors, the user requirements, technical considerations, and operational considerations. Consider the following factors when selecting storage hardware:
tr_tr: Depolama donanımı mimarisine belirli depolama mimarisi seçilerek karar verilir. Ciddi etmenler, kullanıcı gereksinimleri, teknik etmenler ve işlevsel etmenlere karşı uygun çözümleri değerlendirerek depolama mimarisini seçin. Depolama donanımı seçerken şu etmenlere dikkat edin:

source: Storage hardware:
tr_tr: Depolama donanımı:

source: Storage is found in many parts of the OpenStack cloud environment. It is important to understand the distinction between :term:`ephemeral <ephemeral volume>` storage and :term:`persistent <persistent volume>` storage:
tr_tr: Depolama OpenStack bulut ortamının bir çok kısmında bulunur. :term:`geçici <ephemeral volume>` depolama ve :term:`kalıcı <persistent volume>` depolama: arasındaki farkı bilmek önemlidir.

source: Storage is found in many parts of the OpenStack cloud environment. This chapter describes storage type, design considerations and options when selecting persistent storage options for your cloud environment.
tr_tr: Depolama OpenStack bulut ortamının çoğu kısmında bulunur. Bu bölüm bulut ortamınız için kalıcı depolama seçerken kullanacağınız depolama türü, tasarım etmenleri ve seçeneklerini tanımlar.

source: Storage requirements
tr_tr: Depolama gereksinimleri

source: Storage-focused OpenStack clouds must address I/O intensive workloads. These workloads are not CPU intensive, nor are they consistently network intensive. The network may be heavily utilized to transfer storage, but they are not otherwise network intensive.
tr_tr: Depolama odaklı OpenStack bulutları I/O ağırlıklı iş yüklerini ele almalıdır. Bu iş yükleri CPU ağırlıklı değildir, ayrıca tutarlı olarak ağ ağırlıklı da değillerdir. Ağ ağır şekilde depolama aktarımı için kullanılıyor olabilir, ama aksi halde ağ ağırlıklı değillerdir.

source: Storage-focused architecture depends on specific use cases. This section discusses three example use cases:
tr_tr: Depolama odaklı mimari belirli kullanım durumlarına bağımlıdır. Bu kısım üç örnek kullanım durumunu tartışır:

source: Storage-intensive use cases like HPC and Big Data clouds
tr_tr: HPC ve Büyük Veri bulutları gibi depolama yoğunluklu kullanım durumları

source: Store data, including VM images
tr_tr: VM imajları dahil veri sakla

source: Stores and serves images with metadata on each, for launching in the cloud
tr_tr: Herbirinde metaveri ile bulutta çalıştırmak üzere imajları kaydeder ve sunar

source: Sufficient monitoring and data collection should be in-place from the start, such that timely decisions regarding capacity, input/output metrics (IOPS) or storage-associated bandwidth can be made.
tr_tr: Yeterli izleme ve veri toplama en baştan yerli yerinde çalışmalıdır, kapasiteyle ilgili, girdi/çıktı ölçümleri (IOPS) veya depolama ilişkili bant genişliği kararları böylece vaktinde yapılabilir.

source: Support an indeterminate variety of platforms and applications.
tr_tr: Kesin olmayan çeşitlilikte platform ve uygulamayı destekleyin.

source: Support and maintenance
tr_tr: Destek ve bakım

source: Support for the distributed file-system interface `CephFS <http://ceph.com/docs/master/cephfs/>`_.
tr_tr: Dağıtık dosya sistemi arayüzü `CephFS <http://ceph.com/docs/master/cephfs/>`_ için destek.

source: Supporting asymmetric links
tr_tr: Asimetrik bağlantıları desteklemek

source: Table. Cloud controller hardware sizing considerations
tr_tr: Tablo. Bulut kontrol birimi donanım boyutlandırma etmenleri

source: Table. Deployment scenarios
tr_tr: Tablo. Kurulum senaryoları

source: Table. OpenStack storage
tr_tr: Tablo. OpenStack depolama

source: Technical details
tr_tr: Teknik ayrıntılar

source: Telemetry service
tr_tr: Telemetri servisi

source: Telemetry uses MongoDB.
tr_tr: Telemetri MongoDB kullanır.

source: The Architecture Design Guide provides information on planning and designing an OpenStack cloud. It explains core concepts, cloud architecture design requirements, and the design criteria of key components and services in an OpenStack cloud. The guide also describes five common cloud use cases.
tr_tr: Mimari Tasarım Kılavuzu bir OpenStack bulutu planlama ve tasarlama üstüne bilgi sağlar. Çekirdek kavramları, bulut mimari tasarım gereksinimlerini, ve OpenStack bulutundaki anahtar bileşenlerin ve servislerin tasarım kriterlerini açıklar. Kılavuz ayrıca beş genel bulut kullanım durumunu tanımlar.

source: The Block Storage service supports multiple back ends in the form of drivers. Your choice of a storage back end must be supported by a block storage driver.
tr_tr: Blok Depolama servisi sürücüler biçiminde bir çok arka ucu destekler. Depolama arka ucu seçiminiz blok depolama sürücüsü tarafından desteklenmelidir.

source: The Logical Volume Manager (LVM) is a Linux-based system that provides an abstraction layer on top of physical disks to expose logical volumes to the operating system. The LVM back-end implements block storage as LVM logical partitions.
tr_tr: Mantıksal Birim Yöneticisi (LVM) işletim sistemine mantıksal birimler sunmak için fiziksel diskler üstüne bir soyutlama katmanı ekleyen Linux tabanlı sistemdir. LVM arka uu blok depolamayı LVM mantıksal bölümleri olarak uygular.

source: The Logstash filter performs intermediary processing on each event. Conditional filters are applied based on the characteristics of the input and the event. Some examples of filtering are:
tr_tr: Logstash süzgeci her olayda ara işlemeyi gerçekleştirir. Girdinin ve olayın ayırıcı niteliğine göre süzgeçler uygulanır. Bazı süzme örnekleri şöyledir:

source: The Networking service provides full control over creation of virtual network resources to tenants. This is often accomplished in the form of tunneling protocols that establish encapsulated communication paths over existing network infrastructure in order to segment tenant traffic. This method varies depending on the specific implementation, but some of the more common methods include tunneling over GRE, encapsulating with VXLAN, and VLAN tags.
tr_tr: Ağ servisi kiracılara sanal ağ kaynaklarının oluşturulmasında tam kontrol sağlar. Bu da genellikle kiracı trafiğini dilimlemek için mevcut ağ alt yapısı üstünde kapsüllenmiş iletişim yolları sağlayan tünelleme iletişim kuralları biçiminde başarılır. Bu yöntem belirli uygulamaya göre değişim gösterir, ama yaygın yöntemlerden bazıları GRE üzerinden tünelleme, VXLAN ile kapsülleme, ve VLAN etiketleridir.

source: The OpenStack Compute API is extensible. An extension adds capabilities to an API beyond those defined in the core. The introduction of new features, MIME types, actions, states, headers, parameters, and resources can all be accomplished by means of extensions to the core API. This allows the introduction of new features in the API without requiring a version change and allows the introduction of vendor-specific niche functionality.
tr_tr: OpenStack Hesaplama API'si eklentilenebilir. Eklenti API'ye çekirdekte tanımlanmamış yetenekler ekler. Yeni özelliklerin tanıtımı, MIME türleri, eylemler, durumlar, başlıklar, parametreler, ve kaynaklar hep çekirdek API'ye eklenti olarak elde edilebilir. Bu API'ye yeni özelliklerin bir sürüm değişikliğine gidilmeden getirilebilmesi ve üreticiye özel işlevselliğe izin verilmesi demektir.

source: The OpenStack Image service consists of two parts: ``glance-api`` and ``glance-registry``. The former is responsible for the delivery of images; the compute node uses it to download images from the back end. The latter maintains the metadata information associated with virtual machine images and requires a database.
tr_tr: OpenStack imaj servisi iki bölümden oluşur: ``glance-api`` ve ``glance-registry``. İlki imajların getirilmesinden sorumludur, hesaplama düğümü arka uçtan imajları indirmek için kullanır. Sonraki sanal makine imajlarıyla ilişkili metaveri bilgisini yönetir ve bir veritabanına ihtiyaç duyar.

source: The OpenStack dashboard (horizon) provides a web-based user interface to the various OpenStack components. The dashboard includes an end-user area for users to manage their virtual infrastructure and an admin area for cloud operators to manage the OpenStack environment as a whole.
tr_tr: OpenStack kontrol paneli (horizon) çeşitli OpenStack bileşenleri için web tabanlı kullanıcı arayüzü sunar. Kontrol paneli kullanıcılar için sanal alt yapılarını yönetebilecekleri bir son kullanıcı alanı ve bulut yöneticilerinin OpenStack ortamını yönetebildikleri bir yönetici alanı içerir.

source: The OpenStack services themselves should be deployed across multiple servers that do not represent a single point of failure. Ensuring availability can be achieved by placing these services behind highly available load balancers that have multiple OpenStack servers as members.
tr_tr: OpenStack'in kendi servisleri tek bir kırılma noktası olmayan birden çok sunucuda kurulmalıdır. Kullanılırlıktan emin olmak için bu servisleri birden çok OpenStack sunucu üyesine sahip yüksek kullanılırlıklı yük dengeleyicilerin arkasına koyabilirsiniz.

source: The REST API
tr_tr: REST API

source: The Shared File Systems service is persistent storage and can be mounted to any number of client machines. It can also be detached from one instance and attached to another instance without data loss. During this process the data are safe unless the Shared File Systems service itself is changed or removed.
tr_tr: Paylaşımlı Dosya Sistemleri servisi kalıcı depolamadır ve istenen sayıda istemci makineye bağlanabilir. Ayrıca veri kaybı olmadan bir sunucudan ayrılıp başka bir sunucuya bağlanabilir. Bu süreçte Paylaşımlı Dosya Sistemleri servisinin kendisi değiştirilmediği ya da kaldırılmadığı sürece veri güvendedir.

source: The Solaris iSCSI driver for OpenStack Block Storage implements blocks as ZFS entities. ZFS is a file system that also has the functionality of a volume manager. This is unlike on a Linux system, where there is a separation of volume manager (LVM) and file system (such as, ext3, ext4, xfs, and btrfs). ZFS has a number of advantages over ext4, including improved data-integrity checking.
tr_tr: OpenStack Blok Depolama için Solaris iSCSI sürücüsü blokları ZFS girdileri olarak uygular. ZFS bir birim yönetici işlevselliğine de sahip olan bir dosya sistemidir. Bu birim yönetimi (LVM) ile dosya sistemi (ext3, ext3, xfs, btrfs vs.) ayrımı olan bir Linux sistemi gibi değildir. ZFS'in ext4'e göre bir takım avantajları vardır, geliştirilmiş veri tutarlılığı kontrolü de bunlardan biridir.

source: The ZFS back end for OpenStack Block Storage supports only Solaris-based systems, such as Illumos. While there is a Linux port of ZFS, it is not included in any of the standard Linux distributions, and it has not been tested with OpenStack Block Storage. As with LVM, ZFS does not provide replication across hosts on its own, you need to add a replication solution on top of ZFS if your cloud needs to be able to handle storage-node failures.
tr_tr: OpenStack Blok Depolama için ZFS arka ucu yalnızca Illumos gibi Solaris tabanlı sistemleri destekler. ZFS'in bir Linux portu olsa da standart Linux dağıtımlarıyla birlikte gelmez, ve OpenStack Blok Depolama ile test edilmemiştir. LVM ile, ZFS sunucular arasında yedeklemeyi kendi başına sağlamaz, bulut ihtiyaçlarınız depolama düğümü arızalarına dayanıklı olmak zorundaysa ZFS üstüne bir yedekleme çözümü koymalısınız.

source: The `API Specifications <https://developer.openstack.org/api-guide/quick-start/index.html>`_ define the core actions, capabilities, and mediatypes of the OpenStack API. A client can always depend on the availability of this core API, and implementers are always required to support it in its entirety. Requiring strict adherence to the core API allows clients to rely upon a minimal level of functionality when interacting with multiple implementations of the same API.
tr_tr: `API Özellikleri <https://developer.openstack.org/api-guide/quick-start/index.html>`_ OpenStack API'sinin çekirdek eylemlerini, yeteneklerini ve ortam türlerini tanımlar. Bir istemci her zaman bu çekirden API'nin kullanılırlığına güvenebilir, ve bu API'yi uygulayanlar tamamını desteklemek durumundadır. Çekirdek API'ye sıkı sıkıya bağlılığı gerektirmek aynı API'nin farklı uygulamalarıyla etkileşime geçen istemcilerin asgari düzeyde işlevselliğe sahip olması demektir.

source: The ``glance-api`` part is an abstraction layer that allows a choice of back end. Currently, it supports:
tr_tr: ``glance-api`` kısmı bir arka uç seçimine izin veren soyutlama katmanıdır. Şunları destekler:

source: The ``nova-conductor`` service is horizontally scalable. To make ``nova-conductor`` highly available and fault tolerant, just launch more instances of the ``nova-conductor`` process, either on the same server or across multiple servers.
tr_tr: ``nova-conductor`` servisi yatay ölçeklenebilirdir. Yüksek kullanılırlıklı ve arızaya dayanıklı bir ``nova-conductor`` için, ``nova-conductor`` sürecindeki sunuculardan aynı sunucuda ya da birden çok sunucuda daha fazla başlatın yeter.

source: The ability to create pools or availability zones for unpredictable workloads should be considered. In some cases, the demand for certain instance types or flavors may not justify individual hardware design. Allocate hardware designs that are capable of servicing the most common instance requests. Adding hardware to the overall architecture can be done later.
tr_tr: Beklenmedik iş yükleri için havuzlar veya kullanılırlık bölgeleri oluşturmak göz önüne alınmalıdır. Bazı durumlarda, belirli sunucu türlerine veya niteliklerine duyulan ihtiyaç donanım tasarımıyla eşleşmeyebilir. En yaygın sunucu isteklerini karşılayabilecek donanım tasarımlarını ayırın. Genel mimariye donanım eklemek daha sonra da yapılabilir.
