Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: All nodes within an OpenStack cloud require network connectivity. In some cases, nodes require access to more than one network segment. The design must encompass sufficient network capacity and bandwidth to ensure that all communications within the cloud, both north-south and east-west traffic, have sufficient resources available.
tr_tr: OpenStack bulutundaki tüm düğümlerin ağ bağlantısına ihtiyacı vardır. Bazı durumlarda, düğümler birden fazla ağ dilimine ihtiyaç duyabilir. Tasarım bulut içindeki tüm iletişimin, hem kuzey-güney hem doğu-batı trafiğinde yeterli kullanılabilir kaynağa sahip olduğuna, ağ kapasitesi ve bant genişliğinin yeterli olduğuna emin olmalıdır.

source: All public access, whether direct, through a command-line client, or through the web-based dashboard, uses the API service. Find the API reference at `Development resources for OpenStack clouds <https://developer.openstack.org/>`_.
tr_tr: Tüm açık erişim, doğrudan ya da komut satırı istemcisi üzerinden, veya web tabanlı kontrol panelinden, API servisini kullanır. `OpenStack bulutlar için geliştirme kaynaklarında <https://developer.openstack.org/>`_ API kaynaklarını bulabilirsiniz.

source: All servers running OpenStack components should be able to access an appropriate NTP server. You may decide to set up one locally or use the public pools available from the `Network Time Protocol project <http://www.pool.ntp.org/>`_.
tr_tr: OpenStack bileşenleri çalıştıran tüm sunucular uygun bir NTP sunucusuna erişebilmelidir. Yerel bir tane kurabilir ya da `Ağ Zaman İletişim Kuralı projesinden <http://www.pool.ntp.org/>`_ açık havuzlardan bir tanesini kullanabilirsiniz.

source: Allows you to fetch images from Amazon S3.
tr_tr: İmajları Amazon S3'den getirmenizi sağlar.

source: Allows you to fetch images from a web server. You cannot write images by using this mode.
tr_tr: İmajları bir web sunucudan getirmenizi sağlar. Bu kipi kullanarak imaj yazamazsınız.

source: Allows you to store images as objects.
tr_tr: İmajları nesne olarak saklamanızı sağlar.

source: Also consider the routing of network traffic. For some applications, develop a complex policy framework for routing. To create a routing policy that satisfies business requirements, consider the economic cost of transmitting traffic over expensive links versus cheaper links, in addition to bandwidth, latency, and jitter requirements.
tr_tr: Ağ trafiğinin yönlendirilmesini de dikkate alın. Bazı uygulamalar için, yönlendirme için karmaşık ilke çatıları geliştirin. İş gereksinimlerini karşılayacak bir yönlendirme ilkesi oluşturmak için, ucuz bağlantılarla pahalı bağlantılar üzerinden trafik aktarım maliyetlerini, ek olarak bant genişliği, gecikme ve kararsızlık gereksinimlerini dikkate alın.

source: Also, you need to decide whether you want to support object storage in your cloud. The two common use cases for providing object storage in a compute cloud are to provide:
tr_tr: Ayrıca, bulutunuzda nesne depolamayı destekleyip desteklemeyeceğinize de karar vermelisiniz. Bir hesaplama bulutunda nesne depolama sunmak için iki yaygın kullanım sebebi bulunur:

source: Although it is not a substitute for IP networking, networking at layer-2 can be a powerful adjunct to IP networking.
tr_tr: IP ağlarının yerine geçmese de, katman-2 ağları IP ağına ek olarak güçlü bir seçenektir.

source: Among :term:`object`, :term:`container`, and :term:`account servers <account server>`
tr_tr: :term:`nesne`, :term:`kapsayıcı`, and :term:`hesap sunucuları <account server>` arasında

source: Amount of available physical storage
tr_tr: Kullanılabilir fiziksel depolama miktarı

source: An API driven S3 compatible object store for application use.
tr_tr: Uygulama kullanımı için API güdümlü S3 uyumlu nesne depolama.

source: An application that requires additional resources may suit a multiple cloud architecture. For example, a retailer needs additional resources during the holiday season, but does not want to add private cloud resources to meet the peak demand. The user can accommodate the increased load by bursting to a public cloud for these peak load periods. These bursts could be for long or short cycles ranging from hourly to yearly.
tr_tr: Ek kaynaklar gerektiren bir uygulama çoklu bulut mimarisi için uygun olabilir. Örneğin, bir satıcı tatil sezonunda ek kaynaklara ihtiyaç duyar, ama yüksek talebi karşılamak için ek özel bulut kaynakları eklemek istemez. Kullanıcı bu yük dönemlerinin tepe noktasında artan yükü açık bir buluta yönlendirerek karşılayabilir. Bu artışlar saatlik ya da yıllık gibi uzun ya da kısa döngüler halinde olabilir.

source: An important consideration in running a cloud over time is projecting growth and utilization trends in order to plan capital expenditures for the short and long term. Gather utilization meters for compute, network, and storage, along with historical records of these meters. While securing major anchor tenants can lead to rapid jumps in the utilization of resources, the average rate of adoption of cloud services through normal usage also needs to be carefully monitored.
tr_tr: Bir bulutun zamanla işleyişindeki önemli etmenlerden biri proje büyümesi ve kullanım trendlerinin kısa ve uzun vadede maddi planlamasının yapılmasıdır. Hesaplama, ağ ve depolama için kullanım ölçütlerini ve bunların geçmiş kayıtlarını toplayın. Büyük kiracıların alınması kaynak kullanımının aniden artmasına sebep olacağı gibi, bulut servislerinin zamanla ortalama artışı da dikkatlice izlenmelidir.

source: An important factor in your choice of hypervisor is your current organization's hypervisor usage or experience. Also important is the hypervisor's feature parity, documentation, and the level of community experience.
tr_tr: Hipervizör seçiminizdeki önemli etmen mevcut kurumunuzun hipervizör kullanımı veya deneyimidir. Hipervizörün özellik eşitliği, belgelendirmesi ve topluluk deneyimi seviyesi de önemlidir.

source: An object store with a RESTful interface
tr_tr: RESTful arayüzlü nesne depolama

source: An online classified advertising company wants to run web applications consisting of Tomcat, Nginx, and MariaDB in a private cloud. To meet the policy requirements, the cloud infrastructure will run in their own data center. The company has predictable load requirements but requires scaling to cope with nightly increases in demand. Their current environment does not have the flexibility to align with their goal of running an open source API environment. The current environment consists of the following:
tr_tr: Çevrimiçi gizli bir reklam şirketi Tomcat, Nginx, ve MariaDB'den oluşan web uygulamalarını özel bir bulutta çalıştırmak istiyor. İlke gereksinimlerini karşılamak için, bulut alt yapısı kendi veri merkezlerinde çalışacak. Şirketin ön görülebilen yük gereksinimleri var ama gece yük artışlarını karşılayabilmek için ölçeklemeye de ihtiyaç duyuyor. Mevcut ortamları açık kaynak bir API ortamı çalıştırma amaçlarıyla örtüşmüyor. Mevcut ortam şunlardan oluşuyor:

source: An operations staff supports, manages, and maintains an OpenStack environment. Their skills may be specialized or varied depending on the size and purpose of the installation.
tr_tr: Bir işletme ekibi OpenStack ortamını destekler, yönetir ve bakım yapar. Kurulumun amacı ve boyutuna bağlı olarak yetenekleri değişken olabilir.

source: An organization designs a large scale cloud-based web application. The application scales horizontally in a bursting behavior and generates a high instance count. The application requires an SSL connection to secure data and must not lose connection state to individual servers.
tr_tr: Bir kurum büyük ölçekli bulut tabanlı web uygulaması tasarlar. Uygulama artan şekilde yatay olarak ölçeklenir ve yüksek sunucu sayısına ulaşır. Uygulama veriyi güvene almak için SSL bağlantısına ihtiyaç duyar ve bağımsız sunuculara bağlantı durumunu kaybetmemelidir.

source: An organization may have certain legal obligations and regulatory compliance measures which could require certain workloads or data to not be located in certain regions.
tr_tr: Bir kurumun belirli iş yüklerini veya veriyi belirli bölgelerde tutmamasını gerektiren yasal sorumluluklar veya hükümlülükleri olabilir.

source: An overly complex network design can be difficult to maintain and troubleshoot. While device-level configuration can ease maintenance concerns and automated tools can handle overlay networks, avoid or document non-traditional interconnects between functions and specialized hardware to prevent outages.
tr_tr: Aşırı karmaşık bir ağ tasarımının yönetilmesi ve sorun giderilmesi zor olabilir. Aygıt seviyesinde yapılandırma yönetim endişelerini azaltabilse, ve otomatik araçlar üst katman ağları ele alabilse de, özel donanımlarla işlevler arasındaki geleneksel olmayan bağlantıları belgelendirin ve kesintileri giderebilmek için özelleşmiş donanımlar kullanın.

source: Analytics of large data sets are dependent on the performance of the storage system. Clouds using storage systems such as Hadoop Distributed File System (HDFS) have inefficiencies which can cause performance issues.
tr_tr: Büyük veri kümelerinin çözümlenmesi depolama sisteminin başarımına bağlıdır. Hadoop Dağıtık Dosya Sistemi (HDFS) gibi depolama sistemlerini kullanan bulutlar başarım sorunları yaratabilecek verimsizliklere sahiptir.

source: Another common use case for OpenStack environments is providing a cloud-based file storage and sharing service. You might consider this a storage-focused use case, but its network-side requirements make it a network-focused use case.
tr_tr: OpenStack ortamları için yaygın başka bir kullanım alanı da bulut tabanlı dosya depolama ve paylaşım servisi sağlamaktır. Bunu depolama odaklı kullanım durumu olarak ele alabilirsiniz, ama ağ taraflı gereksinimleri bir ağ odaklı kullanım durumu yapar.

source: Another consideration is when a new file is being uploaded, the proxy server must write out as many streams as there are replicas, multiplying network traffic. For a three-replica cluster, 10 Gbps in means 30 Gbps out. Combining this with the previous high bandwidth bandwidth private versus public network recommendations demands of replication is what results in the recommendation that your private network be of significantly higher bandwidth than your public network requires. OpenStack Object Storage communicates internally with unencrypted, unauthenticated rsync for performance, so the private network is required.
tr_tr: Diğer etmen de yeni bir dosyanın yüklendiği durumda oluşur, vekil sunucu yedek sayısı kadar akışa yazmak durumundadır, bu da ağ trafiğini katlar. Üç yedekli bir kümede, 10 Gbps içe gelen veri 30 Gbps dışa giden veri demektir. Bunu daha önceki özel ağlar ile açık ağlar için bant genişliği önerileriyle birleştirince özel ağınızın açık ağınızdan daha yüksek bant genişliğine sahip olması gerektiği sonucu ortaya çıkar. OpenStack Nesne Depolama daha iyi başarım için dahili olarak şifrelenmemiş, yetkilendirilmemiş rsync kullanır, yani özel bir ağ mecburidir.

source: Another option is to assess the average workloads and increase the number of instances that can run within the compute environment by adjusting the overcommit ratio. This ratio is configurable for CPU and memory. The default CPU overcommit ratio is 16:1, and the default memory overcommit ratio is 1.5:1. Determining the tuning of the overcommit ratios during the design phase is important as it has a direct impact on the hardware layout of your compute nodes.
tr_tr: Başka bir seçenek de ortalama iş yükünü değerlendirmek ve hesaplama ortamında çalışabilecek sunucu sayısını kaynak aşımı oranına oranlamaktır. Bu oran CPU ve bellek için yapılandırılabilir. Öntanımlı işlemci kaynak aşım oranı 16:1 dir, ve öntanımlı hafıza kaynak aşım oranı 1.5:1 dir. Tasarım aşamasında kaynak aşımı oranlarının ayarlanmasına karar vermek hesaplama düğümlerinizin donanım düzeni üzerinde doğrudan etkilidir.

source: Another option to address the higher host count is to use a quad-socket platform. Taking this approach decreases host density which also increases rack count. This configuration affects the number of power connections and also impacts network and cooling requirements.
tr_tr: Yüksek sunucu sayısını ele almak için kullanılacak diğer seçenek dörtlü-soket platform kullanmaktır. Bu yöntemi takip etmek sunucu yoğunluğunu azaltır bu da kabin sayısını azaltır. Bu yapılandırma güç bağlantılarının sayısını ve ağ ve soğutma gereksinimlerini etkiler.

source: Any SLA negotiation must also take into account the reliance on third parties for critical aspects of the design. For example, if there is an existing SLA on a component such as a storage system, the SLA must take into account this limitation. If the required SLA for the cloud exceeds the agreed uptime levels of the cloud components, additional redundancy would be required. This consideration is critical in a hybrid cloud design, where there are multiple third parties involved.
tr_tr: Tüm SLA el sıkışmaları tasarımın kritik bölgelerinde güven duyulan üçüncü tarafları da hesaba katmalıdır. Örneğin, bir depolama sistemi gibi bir bileşen için mevcut bir SLA varsa, SLA bu sınırlandırmayı hesaba katmalıdır. Bulut için gerekli SLA bulut bileşenleri için anlaşılan hizmet zamanlarını aşıyorsa, ek yedeklilik gerekecektir. Bu etmen birden fazla üçüncü taraf bulunan melez bulut tasarımında kritiktir.

source: Anywhere
tr_tr: Heryerden

source: Application
tr_tr: Uygulama

source: Application Programming Interface (API)
tr_tr: Uygulama Programlama Arayüzü (API)

source: Application design must also be factored into the capabilities of the underlying cloud infrastructure. If the compute hosts do not provide a seamless live migration capability, then it must be expected that if a compute host fails, that instance and any data local to that instance will be deleted. However, when providing an expectation to users that instances have a high-level of uptime guaranteed, the infrastructure must be deployed in a way that eliminates any single point of failure if a compute host disappears. This may include utilizing shared file systems on enterprise storage or OpenStack Block storage to provide a level of guarantee to match service features.
tr_tr: Altta yatan bulut alt yapısının yeteneklerine uygulama tasarımı da dahil edilmelidir. Eğer hesaplama sunucuları akıcı bir canlı göç yeteneği sunmuyorsa, bir hesaplama sunucusu bozulduğunda, bu sunucu ve sunucuya özel tüm verinin silineceği beklenmelidir. Ancak kullanıcılara sunucuların yüksek seviyede çalışma zamanına sahip olduğu garanti edilirken alt yapı da bir hesaplama sunucusu ortadan kaybolursa kırılma noktası oluşturmayacak şekilde kurulmalıdır. Bu servis özellikleriyle eşleşecek seviyede garanti sağlamak için paylaşımlı dosya sistemleri veya OpenStack Blok depolama kullanmayı da içerebilir.

source: Application momentum
tr_tr: Uygulama ivmesi

source: Application readiness
tr_tr: Uygulama hazırlığı

source: Approximately 60 Gb of total bandwidth to the back-end storage cluster
tr_tr: Arka uç depolama kümesine yaklaşık 60 Gb toplam bant genişliği

source: Architecture requirements
tr_tr: Mimari gereksinimleri

source: Architecture, OpenStack
tr_tr: Mimari, OpenStack

source: Are my storage needs mostly read, or write, or mixed?
tr_tr: Depolama ihtiyacım çoğunlukla okuma ya da yazma mı, yoksa karışık mı?

source: Are there read, write, or random access performance requirements?
tr_tr: Okuma, yazma, veya rasgele erişim başarım gereksinimlerim var mı?

source: As a general guideline, increasing the complexity of a cloud architecture increases the cost of building and maintaining it. For example, a hybrid or multi-site cloud architecture involving multiple vendors and technical architectures may require higher setup and operational costs because of the need for more sophisticated orchestration and brokerage tools than in other architectures. However, overall operational costs might be lower by virtue of using a cloud brokerage tool to deploy the workloads to the most cost effective platform.
tr_tr: Genel prensip olarak, bir bulut mimarisinin karmaşıklığı arttıkça inşası ve yönetiminin maliyeti de artacaktır. Örneğin, birden fazla tedarikçi ve teknik mimariye ihtiyaç duyan melez ya da birden fazla ikameli bulut mimarisi diğer mimarilerin aksine sofistike orkestrasyon ve komisyon araçlarına ihtiyaç duyacağından daha fazla kurulum ve işletim maliyet çıkarabilir. Ancak, iş yükünü en uygun maliyetli platforma dağıtan komisyon aracı kullanmanın sonucu olarak genel işlem maliyetleri daha az tutabilir.

source: As another example, if you choose to use single-host networking where the cloud controller is the network gateway for all instances, then the cloud controller must support the total amount of traffic that travels between your cloud and the public Internet.
tr_tr: Başka bir örnek olarak, bulut kontrol biriminin tüm sunucular için ağ geçidi olduğu tek sunuculu ağı kullanırsanız, bulut kontrol birimi bulutunuz ve açık internet arasındaki toplam trafik miktarını da destekleyebilmelidir.

source: As another example, you could use pairs of servers for a collective cloud controller—one active, one standby—for redundant nodes providing a given set of related services, such as:
tr_tr: Başka bir örnek olarak, verilen ilişkili servisleri sağlayan yedekli düğümlere sahip olmak için toplu bir bulut kontrol birimi için—biri etkin, diğeri beklemede—olmak üzere sunucu çiftleri kullanabilirsiniz:

source: As demand for network resources increase, make sure your network design accommodates expansion and upgrades. Operators add additional IP address blocks and add additional bandwidth capacity. In addition, consider managing hardware and software lifecycle events, for example upgrades, decommissioning, and outages, while avoiding service interruptions for tenants.
tr_tr: Ağ kaynaklarına ihtiyaç arttıkça, ağ tasarımınızın genişlemeyi ve yükseltmeleri kaldıracağından emin olun. İşetmenler ek IP adresi blokları ve ek bant genişliği kapasitesi eklerler. Ek olarak, güncellemeler, emekliye ayrılma ve kesintiler gibi donanım ve yazılım yaşam döngüsü olaylarını da göz önüne alarak kiracılar için servis kesintilerini engelleyin.

source: As more tenants begin to access data within the cluster and their data sets grow, it is necessary to add front-end bandwidth to service data access requests. Adding front-end bandwidth to an Object Storage cluster requires careful planning and design of the Object Storage proxies that tenants use to gain access to the data, along with the high availability solutions that enable easy scaling of the proxy layer. We recommend designing a front-end load balancing layer that tenants and consumers use to gain access to data stored within the cluster. This load balancing layer may be distributed across zones, regions or even across geographic boundaries, which may also require that the design encompass geo-location solutions.
tr_tr: Gittikçe daha çok kiracı kümedeki veriye erişmeye başladıkça ve veri kümeleri büyüdükçe, veri erişim isteklerini karşılamak için ön uç bant genişliği eklemek gereklidir. Bir Nesne Depolama kümesine ön uç bant genişliği eklemek dikkatli planlama ve kiracıların veriye erişmek için kullandığı Nesne Depolama vekillerinin tasarımını gerektirir, bunun yanında vekil katmanının kolayca ölçeklenmesini sağlayan ön uç yük yüksek kullanılırlık çözümleri de düşünülmelidir. Kiracıların ve müşterilerin kümede saklanan veriye erişmek için kullandığı bir ön uç yük dengeleme katmanı tasarlamanızı öneririz. Bu yük dengeleme katmanı bölgeler arasına, kullanılırlık bölgelerine, hatta coğrafik sınırlara dağıtılabilir, bu da tasarımın coğrafik konum çözümlerini kaldırabilmesi demektir.

source: As of the Kilo release, key enhancements have been added to the OpenStack code to improve guest performance. These improvements allow the Compute service to take advantage of greater insight into a compute host's physical layout and therefore make smarter decisions regarding workload placement. Administrators can use this functionality to enable smarter planning choices for use cases like NFV (Network Function Virtualization) and HPC (High Performance Computing).
tr_tr: Kilo dağıtımından itibaren, OpenStack koduna misafir başarımını geliştirecek anahtar iyileştirmeler eklenmiştir. Bu iyileştirmeler Hesaplama servisinin bir hesaplama sunucusunun fiziksel düzenini hakkında daha fazla bilgi sahibi olmasını sağlar, böylece iş yükü yerleştirmede daha zekice davranır. Yöneticiler bu özelliği kullanarak NFV (Ağ İşlevi Sanallaştırma) ve HPC (Yüksek Başarımlı Hesaplama) gibi kullanım durumları için daha akıllıca planlama yapabilirler.

source: As of the Kilo release, there is no common image format that is usable by all clouds. Conversion or recreation of images is necessary if migrating between clouds. To simplify deployment, use the smallest and simplest images feasible, install only what is necessary, and use a deployment manager such as Chef or Puppet. Do not use golden images to speed up the process unless you repeatedly deploy the same images on the same cloud.
tr_tr: Kilo dağıtımıyla birlikte, tüm bulutlar tarafından kullanılabilir genel bir imaj biçimi yok. Bulutlar arasında göç yapılacaksa imajların dönüştürülmesi ya da yeniden oluşturulması gerekiyor. Kurulumu basitleştirmek için, en basit ve küçük imajları kullanın, yalnızca ihtiyacınız olan şeyleri kurun, ve Chef veya Puppet gibi bir kurulum yöneticisi kullanın. Tekrar tekrar aynı imajları aynı bulutta kurmuyorsanız süreci hızlandırmak için altın imajları kullanmayın.

source: As part of the architecture design for a compute cluster, you must specify storage for the disk on which the instantiated instance runs. There are three main approaches to providing temporary storage:
tr_tr: Hesaplama kümesinin mimari tasarımının bir parçası olarak, açılan sunucunun çalıştığı disk için depolama belirtmelisiniz. Geçici depolama sağlamak için üç ana yaklaşım vardır.

source: As per the recent OpenStack user survey, KVM is the most widely adopted hypervisor in the OpenStack community. Besides KVM, there are many deployments that run other hypervisors such as LXC, VMware, Xen, and Hyper-V. However, these hypervisors are either less used, are niche hypervisors, or have limited functionality compared to more commonly used hypervisors.
tr_tr: Yapılan son araştırmaya göre OpenStack topluluğunda en geniş kullanım alanına sahip hipervizör KVM. KVM'nin yanında LXC, VMware, Xen, ve Hyper-V gibi diğer hipervizörleri de çalıştıran bir sürü kurulum var. Ancak bu hipervizörler ya daha az kullanılıyorlar, niş hipervizörler, veya daha fazla kullanılan hipervizörlere göre sınırlı işlevselliğe sahipler.

source: As the cloud environment grows, the amount of log data increases exponentially. Enabling debugging on either the OpenStack services or the operating system further compounds the data issues.
tr_tr: Bulut ortamı büyüdükçe, günlük kaydı verisi üssel olarak artar. OpenStack servislerinde ya da işletim sisteminde hata ayıklamayı etkinleştirmek veri sorunlarını daha da artırır.

source: As with databases and message queues, having more than one :term:`API server` is a good thing. Traditional HTTP load-balancing techniques can be used to achieve a highly available ``nova-api`` service.
tr_tr: Veritabanları ve ileti kuyruklarında olduğu gibi birden fazla :term:`API sunucu` olması iyi bir şeydir. Geleneksel HTTP yük dengeleme teknikleri yüksek kullanılırlıklı bir ``nova-api`` servisi elde etmek için kullanılabilir.
