Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: The ability to deliver services or products within a flexible time frame is a common business factor when building a cloud. Allowing users to self-provision and gain access to compute, network, and storage resources on-demand may decrease time-to-market for new products and applications.
tr_tr: Bulut inşa ederken esnek zaman aralığında servis veya ürünleri yetiştirebilmek genel bir iş etmenidir. Kullanıcıların kendi hazırlıklarıyla ve hesaplama, ağ, ve depolama kaynaklarına ihtiyaçları olduğunda erişim kabiliyetleriyle iş yapmaları yeni ürün ve uygulamaların pazara sürüm süresini azaltabilir.

source: The administrator has more fine-grained control over data distribution and replication strategies.
tr_tr: Yöneticinin veri dağıtımı ve yedekleme stratejileri üzerinde daha ince ayrıntılı kontrolü bulunur.

source: The benefits of NFS is low implementation cost due to shared NICs and traditional network components, and a simpler configuration and setup process.
tr_tr: NFS'in faydaları paylaşımlı NIC'ler ve geleneksel ağ bileşenleri ile uygulama masraflarının düşük olması ve daha basit yapılandırma ve kurulum sürecidir.

source: The chassis size of the compute node can limit the number of spindles able to be used in a compute node.
tr_tr: Hesaplama düğümünün şasi boyutu bir hesaplama düğümünde kullanılabilecek mil sayısını sınırlayabilir.

source: The chosen high availability database solution changes according to the selected database. MySQL, for example, provides several options. Use a replication technology such as Galera for active-active clustering. For active-passive use some form of shared storage. Each of these potential solutions has an impact on the design:
tr_tr: Seçilen yüksek kullanılırlık veritabanı çözümü seçilen veritabanına göre değişir. MySQL örneğin, bir çok seçenek sunar. Etkin-etkin kümeleme için Galera gibi bir çoğaltma teknolojisi kullanın. Etkin-pasif kullanım için bir çeşit paylaşımlı depolama kullanın. Bu çözümlerden her birinin tasarımda belirli bir etkisi vardır:

source: The cloud controller manages the following services for the cloud:
tr_tr: Bulut kontrol birimi bulut için şu servisleri yönetir:

source: The cloud controller provides the central management system for OpenStack deployments. Typically, the cloud controller manages authentication and sends messaging to all the systems through a message queue.
tr_tr: Bulut kontrol birimi OpenStack kurulumları için merkezi yönetim sistemi sağlar. Genellikle bulut kontrol birimi yetkilendirmeyi yönetir ve bir mesaj kuyruğu aracılığıyla tüm sistemlere mesajlaşma gönderir.

source: The cloud networks are divided into a number of logical zones that support the network traffic flow requirements. We recommend defining at the least four distinct network zones.
tr_tr: Bulut ağları ağ trafik akış gereksinimlerini destekleyen bir takım mantıksal bölgelere bölünür. En az dört ayrı ağ bölgesi oluşturmanızı öneriyoruz.

source: The cloud user expects repeatable, dependable, and deterministic processes for launching and deploying cloud resources. You could deliver this through a web-based interface or publicly available API endpoints. All appropriate options for requesting cloud resources must be available through some type of user interface, a command-line interface (CLI), or API endpoints.
tr_tr: Bulut kullanıcısı bulut kaynaklarını başlatmak ve kurmak için tekrarlanabilir, güvenilir, ve belirleyici süreçler bekler. Bunu web tabanlı bir arayüz veya genele açık API uç noktaları kullanarak sağlayabilirsiniz. Bulut kaynakları istemekle ilgili kullanılabilir tüm seçenekler bir tür kullanıcı arayüzü aracılığıyla, komut satırı arayüzüyle (CLI) veya API uç noktalarıyla sunulmalıdır.

source: The company runs hardware load balancers and multiple web applications serving their websites and orchestrates environments using combinations of scripts and Puppet. The website generates large amounts of log data daily that requires archiving.
tr_tr: Şirket web sitelerini sunan donanımsal yük dengeleyiciler ve bir çok web uygulaması çalıştırır, ortamları betikler ve Puppet karışımı ile orkestre eder. Web site arşivlemeye ihtiyaç duyan günlük bol miktarda kayıt üretir.

source: The concepts supporting OpenStack's authentication and authorization are derived from well-understood and widely used systems of a similar nature. Users have credentials they can use to authenticate, and they can be a member of one or more groups (known as projects or tenants, interchangeably).
tr_tr: OpenStack'in kimlik doğrulama ve yetkilendirmesini destekleyen kavramlar iyice anlaşılmış ve geniş çapta kullanılan aynı doğadaki sistemlerden gelir. Kullanıcıların kimlik doğrulamada kullanabilecekleri kimlik bilgileri olur, ve bir ya da daha fazla grubun üyesi olabilirler (proje veya kiracı diye de bilinir).

source: The conductor service resolves both of these issues by acting as a proxy for the ``nova-compute`` service. Now, instead of ``nova-compute`` directly accessing the database, it contacts the ``nova-conductor`` service, and ``nova-conductor`` accesses the database on ``nova-compute``'s behalf. Since ``nova-compute`` no longer has direct access to the database, the security issue is resolved. Additionally, ``nova-conductor`` is a nonblocking service, so requests from all compute nodes are fulfilled in parallel.
tr_tr: Orkestra yönetim servisi bu sorunlardan ikisini de ``nova-compute`` servisi için vekil olarak davranarak çözer. Artık ``nova-compute`` veritabanına doğrudan erişmek yerine ``nova-conductor`` servisi ile iletişim kurar, ve ``nova-conductor`` veritabanına ``nova-compute``'nin yerine erişir. ``nova-compute`` artık doğrudan veritabanına erişemediğinden, güvenlik sorunu çözülmüş olur. Ek olarak, ``nova-conductor`` engelleyici bir servis olmadığından, tüm hesaplama düğümlerinden gelen istekler paralel olarak işlenebilir.

source: The dashboard is implemented as a Python web application that normally runs in :term:`Apache` ``httpd``. Therefore, you may treat it the same as any other web application, provided it can reach the API servers (including their admin endpoints) over the network.
tr_tr: Kontrol paneli normalde :term:`Apache` ``httpd`` çalıştıran bir Python web uygulaması olarak geliştirildi. Yani API sunucularına (yönetici uç noktaları da dahil) ağ üzerinden erişebildiği sürece herhangi bir web uygulaması gibi davranabilirsiniz.

source: The dashboard makes many requests, even more than the API access, so add even more CPU if your dashboard is the main interface for your users.
tr_tr: Kontrol paneli birçok istek yapar, API erişiminden bile daha fazla, yani kullanıcılarınız için ana arayüzünüz kontrol paneliyse daha fazla işlemci ekleyin.

source: The data center floor must be able to support the weight of the proposed number of hosts within a rack or set of racks. These factors need to be applied as part of the host density calculation and server hardware selection.
tr_tr: Veri merkezi zemini kabindeki veya kabin kümelerindeki hazırlanan sunucuların ağırlığını destekleyebilmelidir. Bu etmenler sunucu yoğunluk hesaplamalarının ve sunuc donanım seçiminin parçası olarak hesaplanmalıdır.

source: The default CPU allocation ratio of 16:1 means that the scheduler allocates up to 16 virtual cores per physical core. For example, if a physical node has 12 cores, the scheduler sees 192 available virtual cores. With typical flavor definitions of 4 virtual cores per instance, this ratio would provide 48 instances on a physical node.
tr_tr: Öntanımlı CPU ayırma oranı olan 16:1 zamanlayıcının fiziksel çekirdek başına 16 sanal çekirdek ayırdığı anlamına gelir. Örneğin, 12 çekirdekli fiziksel bir düğümü, zamanlayıcı 192 sanal çekirdek olarak görür. Genel nitelik tanımlarında olan sunucu başına 4 sanal çekirdek düşünüldüğünde, bu oran fiziksel düğüm başına 48 sunucu demektir.

source: The deployed applications need to continue to function and, more importantly, you must consider the impact on the performance and reliability of the application if a site is unavailable.
tr_tr: Kurulu uygulamalar çalışmaya devam etmeli, daha da önemlisi, bir konum kullanılamaz olduğunda uygulamanın başarım ve güvenilirliğine olan etkiyi göz önünde bulundurmalısınız.

source: The deployed applications need to continue to function and, more importantly, you must consider the impact on the performance and reliability of the application when a site is unavailable.
tr_tr: Kurulan uygulamaların çalışmaya devam etmesi gereklidir, daha önemlisi, bir konum kullanılamaz olduğunda uygulamanın başarım ve güvenilirliğine etkisini göz önünde bulundurmalısınız.

source: The design will require networking hardware that has the requisite port count.
tr_tr: Tasarım zorunlu bağlantı noktası sayısına sahip ağ donanımı gerektirecektir.

source: The edge zone is where network traffic transitions from the cloud overlay or SDN networks into the traditional network environments.
tr_tr: Uç bölge trafiğin bulut üst katmanından ya da SDN ağlarından geleneksel ağ ortamlarına geçiş yaptığı yere denir.

source: The example REST interface, presented as a traditional Object Store running on traditional spindles, does not require a high performance caching tier.
tr_tr: Örnek REST arayüzü, geleneksel miller üzerinde çalışan, yüksek başarımlı ön bellekleme katmanı gerektirmeyen geleneksel Nesne Depolama sundu.

source: The example below shows a REST interface without a high performance requirement. The following diagram depicts the example architecture:
tr_tr: Aşağıdaki örnek yüksek başarım gereksinimi olmayan bir REST arayüzünü gösterir. Aşağıdaki çizim örnek mimariyi tasvir eder:

source: The external network is defined as the configuration and components that are required to provide access to cloud resources and workloads, the external network is defined as all the components outside of the cloud edge gateways.
tr_tr: Harici ağ bulut kaynaklarına ve iş yüklerine erişim sağlamak için gerekli yapılandırma ve bileşenler olarak tanımlanır, harici ağ bulut kenar geçitleri dışında kalan tüm bileşenler olarak tanımlanır.

source: The figure below depicts an example design for this workload. In this example, a hardware load balancer provides SSL offload functionality and connects to tenant networks in order to reduce address consumption. This load balancer links to the routing architecture as it services the VIP for the application. The router and load balancer use the GRE tunnel ID of the application's tenant network and an IP address within the tenant subnet but outside of the address pool. This is to ensure that the load balancer can communicate with the application's HTTP servers without requiring the consumption of a public IP address.
tr_tr: Aşağıdaki şekil bu iş yükü için örnek bir tasarım tasvir eder. Bu örnekte, donanımsal bir yük dengeleyici SSL yükünü alır ve adres tüketimini azaltmak için kiracı ağlara bağlanır. Bu yük dengeleyici uygulama için VIP servis ederken yönlendirme mimarisine bağlanır. Yönlendirici ve yük dengeleyici uygulamanın kiracı ağını GRE tünel kimliğini ve kiracı alt ağındaki IP adresini adres havuzunun dışından kullanır. Bu yük dengeleyicinin uygulamanın HTTP sunucularıyla açık IP adreslerinin tüketimine gerek duymadan iletişim kurabildiğinden emin olmak içindir.

source: The following sections describe business, usage, and performance considerations for customers which will impact cloud architecture design.
tr_tr: Aşağıdaki kısımlar müşteriler için bulut mimari tasarımını iş, kullanım, ve başarım göz önüne alınarak tanımlar.

source: The formula for the number of virtual instances on a compute node is ``(OR*PC)/VC``, where:
tr_tr: Hesaplama düğümündeki sanal sunucu sayısının formülü ``(OR*PC)/VC``, şöyledir:

source: The hardware requirements and configuration are similar to those of the High Performance Database example below. In this case, the architecture uses Ceph's Swift-compatible REST interface, features that allow for connecting a caching pool to allow for acceleration of the presented pool.
tr_tr: Donanım gereksinimleri ve yapılandırma aşağıdaki Yüksek Başarımlı Veritabanı örneği ile aynıdır. Bu durumda, mimari Ceph'in Swift-uyumlu REST arayüzünü, mevcut havuzun hızlandırılmasına izin veren bir ön bellekleme havuzuna bağlanmayı sağlayan özellikleri kullanır.

source: The importance of security varies based on the type of organization using a cloud. For example, government and financial institutions often have very high security requirements. Security should be implemented according to asset, threat, and vulnerability risk assessment matrices. See `security-requirements`.
tr_tr: Güvenliğin önemi bulutu kullanan kurumun türüne bağlı olarak değişir. Örneğin, devlet ve finans enstitüleri genellikle yüksek güvenlik gereksinimlerine ihtiyaç duyar. Güvenlik varlık, tehdit ve kırılganlık risk matrislerine göre uygulanmalıdır. Bknz `security-requirements`.

source: The inclusion of clustering software, such as Corosync or Pacemaker, is primarily determined by the availability of the cloud infrastructure and the complexity of supporting the configuration after it is deployed. The `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/>`_ provides more details on the installation and configuration of Corosync and Pacemaker, should these packages need to be included in the design.
tr_tr: Corosync ya da Pacemaker gibi kümeleme yazılımının dahil edilmesine, bulut alt yapısının kullanılabilirliği ve kurulumundan sonra yapılandırmanın desteklenme karmaşıklığına bağlı olarak karar verilir. `OpenStack Yüksek Kullanılırlık Kılavuzu <https://docs.openstack.org/ha-guide/>`_ Corosync ve Pacemaker yapılandırması ve kurulumu hakkında - eğer tasarıma dahil edileceklerse - daha fazla ayrıntı verir.

source: The lack of a pre-defined usage model enables the user to run a wide variety of applications without having to know the application requirements in advance. This provides a degree of independence and flexibility that no other cloud scenarios are able to provide.
tr_tr: Ön tanımlı bir kullanım modelinin olmayışı kullanıcılara önceden uygulama gereksinimlerini bilmeden çok çeşitli uygulamaları çalıştırma imkanı verir. Bu diğer bulut senaryolarının sağlayamayacağı bir bağımsızlık ve esneklik derecesi sunar.

source: The location of a service may also impact the application or consumer experience. If an application serves differing content to different users, it must properly direct connections to those specific locations. Where appropriate, use a multi-site installation for these situations.
tr_tr: Bir servisin konumu da uygulama veya müşteri deneyimini etkileyebilir. Uygulama farklı içeriği farklı kullanıcılara sunarsa, bu belirli konumlara bağlantıları düzgün yönlendirmelidir. Uygun olduğunda, bu gibi durumlar için çoklu konumlu bir kurulum yapın.

source: The logs on the compute nodes, or any server running nova-compute (for example in a hyperconverged architecture), are the primary points for troubleshooting issues with the hypervisor and compute services. Additionally, operating system logs can also provide useful information.
tr_tr: Hesaplama düğümlerindeki günlük kayıtları, veya nova-compute çalıştıran herhangi bir sunucu (aşırı yakınsamalı bir mimarideki gibi) hipervizör ve hesaplama servisleriyle ilgili sorun gidermede birincil noktalardır. Ek olarak, işletim sistemi kayıtları da faydalı bilgi sağlayabilir.

source: The main advantage of this option is that it scales to external storage when you require additional storage.
tr_tr: Bu seçeneğin temel avantajı ek deoplamaya ihtiyacınız olduğunda harici depolamaya ölçeklenebilmesidir.

source: The main disadvantages to this approach are:
tr_tr: Bu yaklaşımın temel dezavantajları şunlardır:

source: The main limitation of layer-3 networking is that there is no built-in isolation mechanism comparable to the VLANs in layer-2 networks. Furthermore, the hierarchical nature of IP addresses means that an instance is on the same subnet as its physical host, making migration out of the subnet difficult. For these reasons, network virtualization needs to use IP encapsulation and software at the end hosts. This is for isolation and the separation of the addressing in the virtual layer from the addressing in the physical layer. Other potential disadvantages of layer-3 networking include the need to design an IP addressing scheme rather than relying on the switches to keep track of the MAC addresses automatically, and to configure the interior gateway routing protocol in the switches.
tr_tr: Katman-3 ağın temel kısıtlaması katman-2 ağlardaki VLAN'larla karşılaştırılabilecek yerleşik bir yalıtım mekanizması olmamasıdır. Dahası, IP adreslerin sıra düzenli olması sebebiyle bir sunucunun fiziksel sunucuyla aynı alt ağda bulunması gerekeceğinden alt ağdan dışarı göç zorlaşır. Bu sebeplerle, ağ sanallaştırma IP kapsülleme ve uç sunucularda yazılım kullanmak zorundadır. Bu, sanal katmandaki adreslemeyle fiziksel katmandaki adreslemeyi yalıtmak içindir. Katman-3 ağın başka bir dezavantajı da anahtarların MAC adreslerini otomatik takip etmesine bel bağlamak yerine bir IP adresleme şeması tasarlamak gerekliliğidir, ayrıca anahtarlarda bir dahili geçit yönlendirme iletişim kuralı yapılandırılmalıdır.

source: The main reason to use GFO rather than swift is if you also want to support a distributed file system, either to support shared storage live migration or to provide it as a separate service to your end users. If you want to manage your object and file storage within a single system, you should consider GFO.
tr_tr: Swift yerine GFO kullanmanın temel sebebi dağıtık bir dosya sistemini paylaşımlı depolama canlı göçünü desteklemek veya son kullanıcılarınıza ayrı bir servis olarak sunmak istediğiniz durumdur. Nesne ve dosya depolamanızı tek bir sistem içinde tutmak isterseniz, GFO kullanmayı düşünmelisiniz.

source: The maintenance function of an operator should be taken into consideration:
tr_tr: Bir işletmenin bakım işlevi dikkate alınmalıdır.

source: The network architecture determines which network hardware will be used. Networking software is determined by the selected networking hardware.
tr_tr: Ağ mimarisi hangi ağ donanımının kullanılacağını belirler. Ağ yazılımı seçilen ağ donanımına göre belirlenir.

source: The network design for an OpenStack cluster includes decisions regarding the interconnect needs within the cluster, the need to allow clients to access their resources, and the access requirements for operators to administrate the cluster. You should consider the bandwidth, latency, and reliability of these networks.
tr_tr: Bir OpenStack kümesi için ağ tasarımı kümeler arası bağlantı, istemcilerin kaynaklara erişimini sağlama, ve işletenlerin bulutu yönetmeleri için gerekli erişim gereksinimleri gibi kararları içerir. Bu ağların ağ genişliği, gecikme ve güvenilirliklerini göz önüne almalısınız.

source: The network design should encompass a physical and logical network design that can be easily expanded upon. Network hardware should offer the appropriate types of interfaces and speeds that are required by the hardware nodes.
tr_tr: Ağ tasarımı kolaylıkla genişleyebilir fiziksel ve mantıksal ağ tasarımını kapsamalıdır. Ağ donanımı donanım düğümleri tarafından ihtiyaç duyulan arayüz türlerini ve hızları sağlayabilmelidir.

source: The network design will be affected by the physical space that is required to provide the requisite port count. A higher port density is preferred, as it leaves more rack space for compute or storage components. This can also lead into considerations about fault domains and power density. Higher density switches are more expensive, therefore it is important not to over design the network.
tr_tr: Ağ tasarımı gerekli bağlantı noktası sayısını sağlamak için gerekli fiziksel alan tarafından da etkilenir. Yüksek bağlantı noktası yoğunluğu tercih edilir, çünkü bu hesaplama ve depolama bileşenlerine daha çok kabin alanı bırakır. Bu ayrıca arıza alanları ve güç yoğunluğuyla ilgili etmenlere götürebilir. Yüksek yoğunluklu anahtarlar daha pahalıdır, bu yüzden ağı gereğinden fazla tasrlamamak önemlidir.

source: The network design, in this case, is less dependent on availability and more dependent on being able to handle high bandwidth. As a direct result, it is beneficial to forgo redundant links in favor of bonding those connections. This increases available bandwidth. It is also beneficial to configure all devices in the path, including OpenStack, to generate and pass jumbo frames.
tr_tr: Ağ tasarımı, bu durumda, kullanılırlığa daha az bağımlıdır, daha çok yüksek bant genişliğini ele almaya bağımlıdır. Bunun doğrudan bir sonucu olarak, bu bağlantıları bağlamak için yedekli bağlantılara yönelmek faydalıdır. Bu kullanılabilir bant genişliğini artırır. Ayrıca yoldaki tüm aygıtları, OpenStack dahil, jumbo çerçeveleri geçirecek ve üretecek şekilde yapılandırmak faydalı olacaktır.

source: The network hardware selection needs to be supported by the logging, monitoring, and alerting software.
tr_tr: Ağ donanımı seçimi günlükleme, izleme ve uyarı yazılımı tarafından desteklenmelidir.

source: The networking hardware must support the proposed network speed, for example: 1 GbE, 10 GbE, or 40 GbE (or even 100 GbE).
tr_tr: Ağ donanımı teklif edilen ağ hızını desteklemelidir, örneğin: 1 GbE, 10 GbE, veya 40 GbE (hatta 100 GbE).

source: The number of CPU cores, how much RAM, or how much storage a given server delivers.
tr_tr: Sunucunun işlemci çekirdek sayısı, RAM miktarı veya ne kadar depola sunduğu.

source: The number of MACs stored in switch tables is limited.
tr_tr: Anahtar tablolarında saklanan MAC sayısı sınırlıdır.

source: The number of additional resources you can add to a server before it reaches capacity.
tr_tr: Kapasiteye ulaşmadan önce sunucuya ne kadar ek kaynak eklenebileceği.

source: The number of cores that the CPU has also affects your decision. It is common for current CPUs to have up to 24 cores. Additionally, if an Intel CPU supports hyper-threading, those 24 cores are doubled to 48 cores. If you purchase a server that supports multiple CPUs, the number of cores is further multiplied.
tr_tr: İşlemcinin sahip olduğu çekirdek sayısıda kararınızı etkiler. Mevcut işlemcilerin 24 çekirdeğe kadar çıkması normaldir. Ek olarak, eğer Intel bir işlemci hyper-threading destekliyorsa, bu 24 çekirdek 48 çekirdeğe katlanır. Birden çok işlemcili bir sunucu alırsanız, çekirdek sayısı daha da artacaktır.

source: The number of processor cores and threads impacts the number of worker threads which can be run on a resource node. Design decisions must relate directly to the service being run on it, as well as provide a balanced infrastructure for all services.
tr_tr: İşlemci çekirdek ve iş ipliği sayısı bir kaynak düğümünde kaç iş ipliği çalışabileceğini belirler. Tasarım kararı doğrudan üzerinde çalışacak servis ve tüm servisler için dengeli bir alt yapı sağlayarak ele alınmalıdır.

source: The overlay functionality design includes OpenStack Networking in Open vSwitch GRE tunnel mode. In this case, the layer-3 external routers pair with VRRP, and switches pair with an implementation of MLAG to ensure that you do not lose connectivity with the upstream routing infrastructure.
tr_tr: Üst katman işlevi mimarisi Open vSwitch GRE tünel kipinde OpenStack Ağını içerir. Bu durumda, katman-3 harici yönlendiriciler VRRP ile eşleşir, ve anahtarlar üst alt yapıya yönlendirmede bağlantınızı kaybetmemeniz için MLAG uygulamasıyla eşleşirler.
