Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: This example uses the following components:
tr_tr: Bu örnek aşağıdaki bileşenleri kullanır:

source: This guide is a work in progress. Contributions are welcome.
tr_tr: Bu kılavuz üstünde hala çalışılıyor. Katkılarınız hoş karşılanır.

source: This guide targets OpenStack Architects for architectural design
tr_tr: Bu kılavuz OpenStack Mimarlarını mimari tasarım için hedefler

source: This is not an issue for top of rack (ToR) switches. This may be an issue for spine switches in a leaf and spine fabric, or end of row (EoR) switches.
tr_tr: Bu kabin üstü (ToR) anahtarlar için sorun değildir. Bu yaprak ve omurga iskeletindeki, veya sıra sonundaki (EoR) anahtarlar için sorun olabilir.

source: This list expands upon the potential impacts for including a particular storage architecture (and corresponding storage hardware) into the design for a general purpose OpenStack cloud:
tr_tr: Bu liste genel amaçlı bir OpenStack bulut tasarımına belirli bir depolama mimarisini (ve ilişkili depolama donanımını) katmanın potansiyel etkilerini genişletir.

source: This list of open source file-level shared storage solutions is not exhaustive. Your organization may already have deployed a file-level shared storage solution that you can use.
tr_tr: Bu açık kaynak dosya-seviyesi paylaşım depolama çözümleri kapsamlı değil. Kurumunuz zaten kullanabileceğiniz dosya seviyesinde paylaşımlı depolama çözümü kurmuş olabilir.

source: This may also require a CMP that can determine which cloud can most efficiently run which types of workloads.
tr_tr: Bu ayrıca hangi bulutun ne tür iş yüklerini etkin çalıştırabildiğini tanımlayabilen bir CMP gerektirebilir.

source: This may cause issues for organizations that have preferred vendor policies or concerns with support and hardware warranties of non-tier 1 vendors.
tr_tr: Bu da belirli üretici ilkeleri olan veya birinci kat olmayan üreticilerle ilgili donanım garantisi ve desteği endişeleri olan kurumlar için sorun yaratabilir.

source: This section describes operational factors affecting the design of an OpenStack cloud.
tr_tr: Bu kısım bir OpenStack bulutunun tasarımını etkileyen işlevsel etmenleri tanımlar.

source: This section describes some of the choices you need to consider when designing and building your compute nodes. Compute nodes form the resource core of the OpenStack Compute cloud, providing the processing, memory, network and storage resources to run instances.
tr_tr: Bu kısım hesaplama düğümlerinizi tasarlarken ve inşa ederken hesaba katmanız gereken bazı seçimleri tanımlar. Hesaplama düğümleri OpenStack Hesaplama bulutunun kaynak çekirdeğini biçimlendirir, sunucularınız çalıştırmak için işleme, hafıza, ağ ve depolama kaynaklarını sağlar.

source: This system can provide additional performance. For example, in the database example below, a portion of the SSD pool can act as a block device to the Database server. In the high performance analytics example, the inline SSD cache layer accelerates the REST interface.
tr_tr: Bu sistem ek başarım sağlayabilir. Örneğin aşağıdaki veritabanı örneğinde SSD havuzunun bir kısmı Veritabanı sunucusu için blok aygıtı olarak davranabilir. Yüksek başarımlı çözümleme örneğinde, SSD önbellek katmanı REST arayüzünü hızlandırır.

source: Throughput
tr_tr: İşlem hacmi

source: Time synchronization is a critical element to ensure continued operation of OpenStack components. Ensuring that all components have the correct time is necessary to avoid errors in instance scheduling, replication of objects in the object store, and matching log timestamps for debugging.
tr_tr: Zaman eşzamanlama OpenStack bileşenlerinin çalışması için ciddi öneme sahiptir. Tüm bileşenlerin doğru zamana sahip olduğundan emin olmak sunucu zamanlamada, nesnelerin nesne deposunda yedeklenmesinde, ve günlük kayıtlarının hata ayıklama için zaman damgalarının eşleştirilmesinde önemlidir.

source: Time-to-market
tr_tr: Pazara sürme süresi

source: To calculate IOPS for a single drive you could use:
tr_tr: Tek bir sürücü için IOPS hesaplamak için şunu kullanabilirsiniz:

source: To calculate maximum IOPS for a disk array:
tr_tr: Bir disk dizisi için azami IOPS hesaplamak için:

source: To deploy your storage by using only commodity hardware, you can use a number of open-source packages, as described in :ref:`table_persistent_file_storage`.
tr_tr: Depolamanızı yalnızca ticari donanımla kurmak için, :ref:`table_persistent_file_storage` tablosunda tanımlandığı gibi bir takım açık kaynak paketleri kullanabilirsiniz.

source: To design, deploy, and configure OpenStack, administrators must understand the logical architecture. OpenStack modules are one of the following types:
tr_tr: OpenStack tasarlamak, kurmak ve yapılandırmak için yöneticiler mantıksal mimariyi anlamalıdır. OpenStack modülleri şu türlerden birindedir:

source: To effectively run cloud installations, initial downtime planning includes creating processes and architectures that support planned maintenance and unplanned system faults.
tr_tr: Bulut kurulumlarını etkin şekilde çalıştırmak için, arıza süresi planlama planlı bakım ve plansız sistem hatalarını destekleyen mimariler ve süreçler oluşturmayı içerir.

source: To ensure access to nodes within the cloud is not interrupted, we recommend that the network architecture identifies any single points of failure and provides some level of redundancy or fault tolerance. The network infrastructure often involves use of networking protocols such as LACP, VRRP or others to achieve a highly available network connection. It is also important to consider the networking implications on API availability. We recommend a load balancing solution is designed within the network architecture to ensure that the APIs and potentially other services in the cloud are highly available.
tr_tr: Buluttaki düğümlere erişimin kesilmediğinden emin olmak için, ağ mimarisinin tüm kırılma noktalarını tanımladığından ve belirli seviyede yedekleme veya hata toleransı sağladığından emin olunmasını öneriyoruz. Ağ mimarisi çoğunlukla LACP, VRRP veya diğerleri gibi ağ iletişim kuralları kullanarak yüksek kullanılırlıklı ağ bağlantıları elde eder. Ağ durumunun API kullanılırlığına etkisi de göz önünde bulundurulmalıdır. API ve diğer servislerin yüksek kullanılırlığı için bir yük dengeleme çözümünün de tasarlanmasını öneriyoruz.

source: To obtain greater than dual-socket support in a 1U rack-mount form factor, customers need to buy their systems from Original Design Manufacturers (ODMs) or second-tier manufacturers.
tr_tr: 1U kabine-bağlı biçim katsayısında çift-soket desteğinden fazlasını elde etmek için, müşteriler sistemlerini Asıl Tasarım Üreticilerinden (ODM'ler) ya da ikinci katman üreticilerden almalıdırlar.

source: To segregate traffic, allow applications to create a private tenant network for database and storage network traffic. Use a public network for services that require direct client access from the Internet. Upon segregating the traffic, consider :term:`quality of service (QoS)` and security to ensure each network has the required level of service.
tr_tr: Trafiği ayırmak için, uygulamaların depolama ve veritabanı trafiği için özel kiracı ağı oluşturmalarına izin verin. İnternetten doğrudan istemci erişimine izin gerektiren servisler için açık bir ağ kullanın. Trafiği ayırdıktan sonra, her ağın gerekli servis seviyesine sahip olduğundan emin olmak için :term:`servis kalitesini (QoS)` göz önüne alın.

source: Tolerant to rack level failure.
tr_tr: Kabin seviyesinde arızalara dayanıklılık.

source: Tracks current information about users and instances, for example, in a database, typically one database instance managed per service
tr_tr: Kullanıcılar ve sunucularla ilgili mevcut bilgiyi takip eder, örneğin bir veritabanında, genellikle servis başına bir veritabanı sunucusu yönetilir

source: Traditionally, replication has been the best method of protecting object store implementations. A variety of replication methods exist in storage architectures, for example synchronous and asynchronous mirroring. Most object stores and back-end storage systems implement methods for replication at the storage subsystem layer. Object stores also tailor replication techniques to fit a cloud's requirements.
tr_tr: Geleneksel olarak, çoğaltma, nesne depolama uygulamalarını korumanın en iyi yöntemi olmuştur. Depolama mimarilerinde bir takım çoğaltma yöntemi vardr, örneğin senkron ya da asenkron yansılama. Çoğu nesne depolama ve arka uç depolama sistemleri deoplama alt sistem katmanında çoğaltma yöntemlerini uygularlar. Nesne depoları ayrıca çoğaltma tekniklerini bulut gereksinimlerine uyacak şekilde uydururlar.

source: Traffic flow
tr_tr: Trafik akışı

source: Underlay
tr_tr: Altkatman

source: Upgrading, patching, and changing configuration items may require downtime for some services. Stopping services that form the Control Plane may not impact the Data Plane. Live-migration of Compute instances may be required to perform any actions that require downtime to Data Plane components.
tr_tr: Yükseltme, yamalama, ve yapılandırma ögelerinin değiştirilmesi bazı servisler için kesinti zamanı gerektirebilir. Kontrol Düzlemini oluşturan servisleri durdurmak Veri Düzlemini etkilemeyebilir. Veri Düzlemi bileşenlerinin kesintisini gerektiren herhangi bir eylemde Hesaplama sunucularının canlı göçü gerekli olabilir.

source: Usage
tr_tr: Kullanım

source: Use External Border Gateway Protocol (eBGP) to connect to the Internet up-link.
tr_tr: İnternet bağlantısına bağlanmak için Harici Sınır Geçit İletişim Kuralı (eBGP) kullanın.

source: Use Internal Border Gateway Protocol (iBGP) to flatten the internal traffic on the layer-3 mesh.
tr_tr: Dahili trafiği katman-3 örgüsünde düzleştirmek için Dahili Sınır Geçit İletişim Kuralı (iBGP) kullanın.

source: Use an external load balancer.
tr_tr: Harici yük dengeleyici kullan.

source: Use cases
tr_tr: Kullanım durumları

source: Use hierarchical addressing because it is the only viable option to scale a network ecosystem.
tr_tr: Sıra düzenli adresleme kullanın çünkü bir ağ ekosistemini ölçeklemek için uygulanabilir tek seçenek odur.

source: Use of DAS impacts the server hardware choice and affects host density, instance density, power density, OS-hypervisor, and management tools.
tr_tr: DAS kullanımı sunucu donanımı seçimini ve sunucu yoğunluğu, güç yoğunluğu, OS-hipervizörü, ve yönetim araçlarını etiler

source: Use of the network can decrease performance.
tr_tr: Ağın kullanımı başarımı düşürebilir.

source: Use traffic shaping for performance tuning.
tr_tr: Başarım artırma için trafik şekillendirmeyi kullanın.

source: Use virtual networking to isolate instance service network traffic from the management and internal network traffic.
tr_tr: Sanal ağ kullanarak sunucu servis ağını yönetim ve dahili ağ trafiğinden ayırın.

source: User dashboard
tr_tr: Kullanıcı kontrol paneli

source: User requirements for high availability and cost considerations influence the level of network hardware redundancy. Network redundancy can be achieved by adding redundant power supplies or paired switches.
tr_tr: Yüksek kullanılırlık ve masraf etmenleri için kullanıcı gereksinimleri ağ donanımı yedekliliğinin seviyesini etkiler. Ağ yedekliliği eşleşen anahtarlar veya yedekli güç kaynakları ekleyerek elde edilebilir.

source: User specification in initial request
tr_tr: İlk istekte kullanıcı tanımı

source: Users interact with the Shared File Systems service by mounting remote file systems on their instances with the following usage of those systems for file storing and exchange. The Shared File Systems service provides shares which is a remote, mountable file system. You can mount a share and access a share from several hosts by several users at a time. With shares, you can also:
tr_tr: Kullanıcılar Paylaşımlı Dosya Sistemleri servisi ile uzak dosya sistemlerini kendi sunucularına bu sistemlerin şu şekilde, dosya depolama ve değişimi için kullanmak için bağlayarak etkileşirler. Paylaşımlı Dosya Sistemleri servisi uzak, bağlanabilir dosya sistemi olan paylaşımlar sağlar. Bir paylaşımı bağlayabilir ve bir çok sunucudan bir çok kullanıcı ile aynı anda erişebilirsiniz. Paylaşımlarla ayrıca şunları yapabilirsiniz:

source: Users will indicate different needs for their cloud architecture. Some may need fast access to many objects that do not change often, or want to set a time-to-live (TTL) value on a file. Others may access only storage that is mounted with the file system itself, but want it to be replicated instantly when starting a new instance. For other systems, ephemeral storage is the preferred choice. When you select :term:`storage back ends <storage back end>`, consider the following questions from user's perspective:
tr_tr: Kullanıcılar bulut ihtiyaçları için farklı gereksinimler belirteceklerdir. Bazıları bir sürü pek fazla değişmeyen nesneye hızlı erişim isteyecek, ya da bir dosyaya yaşam süresi (TTL) değeri ayarlamak isteyecek. Diğerleri yalnızca dosya sistemine bağlı depolamaya erişim isteyebilir, ama yeni bir sunucu başlatırken anında kopyalanmasını isteyebilir. Diğer sistemler için geçici deoplama tercih edilen çözümdür. :term:`Depolama arka uçlarını <storage back end>` seçerken kullanıcının bakış açısına göre şu soruları yanıtlayın:

source: Users with a persistent storage mechanism for objects like images and video.
tr_tr: Resimler ve videolar gibi nesneler için geçici depolama mekanizması olan kullanıcılar.

source: Uses any traditional file system to store the images as files.
tr_tr: İmajları dosya olarak kaydetmek için herhangi bir geleneksel dosya sistemini kullanır.

source: Using Ceph as an applicable example, a potential architecture would have the following requirements:
tr_tr: Uygulanabilir bir örnek olarak Ceph kullanılsa, muhtemel bir mimari şu gereksinimlere sahip olurdu:

source: Using a scale-out storage solution with direct-attached storage (DAS) in the servers is well suited for a general purpose OpenStack cloud. Cloud services requirements determine your choice of scale-out solution. You need to determine if a single, highly expandable and highly vertical, scalable, centralized storage array is suitable for your design. After determining an approach, select the storage hardware based on this criteria.
tr_tr: Sunucularda doğrudan ekli depolamaya (DAS) sahip bir ölçekleme çözümü kullanmak genel amaçlı bir OpenStack bulutu için uygundur. Bulut servisi gereksinimleri ölçekleme çözümünüzü belirler. Tek bir genişleyebilir ve dikey, ölçeklenebilir, merkezi bir depolama dizisinin tasarımınıza uygun olup olmadığına karar vermelisiniz. Bir yaklaşım belirledikten sonra, bu kritere göre bir depolama donanımı seçin.

source: Using an SSD cache layer, you can present block devices directly to hypervisors or instances. The REST interface can also use the SSD cache systems as an inline cache.
tr_tr: Bir SSD önbellek katmanı kullanarak, blok aygıtları doğrudan hipervizörlere veya sunuculara sunabilirsiniz. REST arayüzü ayrıca SSD önbellek sistemlerini de satıriçi önbelleği olarak kullanabilir.

source: Using native OpenStack tools can help improve performance. For example, you can use Telemetry to measure performance and the Orchestration service (heat) to react to changes in demand.
tr_tr: Orjinal OpenStack araçlarını kullanmak başarımı artırabilir. Örneğin, Telemetri ile başarım ölçebilir Orkestrasyon servisi (heat) ile taleplerdeki değişikliklere tepki verebilirsiniz.

source: Using tunable networking components
tr_tr: Ayarlanabilir ağ bileşenlerinin kullanılması

source: VLANs are an easy mechanism for isolating networks.
tr_tr: VLAN'lar ağları yalıtmak için kolay bir yöntem sunarlar.

source: VM is terminated
tr_tr: VM sonlandırılınca

source: View usage of share resources.
tr_tr: Paylaşım kaynaklarının kullanımını görüntüle.

source: We recommend deploying high performing storage solutions such as SSD drives or flash storage systems for applications requiring additional performance out of Block Storage devices.
tr_tr: Blok Depoama aygıtlarından ek başarım bekleyen uygulamalar için SSD aygıtlar veya flash depolama sistemleri gibi yüksek başarımlı depolama çözümleri kurmanızı öneriyoruz.

source: We recommend leveraging existing monitoring systems to see if they are able to effectively monitor an OpenStack environment.
tr_tr: Mevcut izleme sistemlerini tetikleyerek OpenStack ortamını etkin şekilde izleyip izlemediklerine bakmanızı öneriyoruz.

source: We recommend that data be encrypted both in transit and at-rest. To this end, carefully select disks, appliances, and software. Do not assume these features are included with all storage solutions.
tr_tr: Verinin hem aktarımda hem de dururken şifreli olmasını öneriyoruz. Diskleri, gereçleri ve yazılımları dikkatli seçin. Bu özelliklerin tüm depolama çözümlerinde dahil olduğunu varsaymayın.

source: We recommend that you choose the option operators are most familiar with. NFS is the easiest to set up and there is extensive community knowledge about it.
tr_tr: İşletmenlerin daha aşina oldukları seçenekle devam etmenizi öneriyoruz. NFS kurulumu en kolay olandır ve geniş topluluk bilgisi sunar.

source: We recommend that you use a fast NIC, such as 10 GB. You can also choose to use two 10 GB NICs and bond them together. While you might not be able to get a full bonded 20 GB speed, different transmission streams use different NICs. For example, if the cloud controller transfers two images, each image uses a different NIC and gets a full 10 GB of bandwidth.
tr_tr: Hızlı bir NIC kullanmanızı öneriyoruz, örneğin 10 GB. İki 10 GB NIC kullanıp bağlamayı da tercih edebilirsiniz. Tam bağlı 20 GB hıza erişemeseniz de, farklı aktarım akışları farklı NIC'leri kullanacaktır. Örneğin bulut kontrol birimi iki imajı aktarıyorsa, her bir imaj farklı bir NIC kullanarak tam 10 GB bant genişliği kullanabilir.

source: We recommend using cloud orchestration tools for managing a diverse portfolio of systems and applications across multiple cloud platforms.
tr_tr: Birden çok bulut platformuna yayılan çok çeşitli sistemleri yönetmek için bulut orkestrasyon araçları kullanmanızı öneriyoruz.

source: Web scale cloud
tr_tr: Web ölçekli bulut

source: Web-scale or development clouds where storage is typically ephemeral in nature
tr_tr: Depolamanın doğası gereği geçici olduğu web ölçekli veya geliştirme bulutları

source: Weigh these considerations against each other to determine the best design for the desired purpose. For example, increasing server density means sacrificing resource capacity or expandability. It also can decrease availability and increase the chance of noisy neighbor issues. Increasing resource capacity and expandability can increase cost but decrease server density. Decreasing cost often means decreasing supportability, availability, server density, resource capacity, and expandability.
tr_tr: İstenen amaca göre en iyi tasarım için bu etmenleri tartın. Örneğin, sunucu yoğunluğunu artırmak demek kaynak kapasitesinden veya genişleyebilirlikten ödün vermek demektir. Ayrıca kullanılırlığı azaltabilir ve daha çok gürültülü komşu sorunları yaratabilir. Kaynak kapasitesi ve genişleyebilirliği artırmak masraflı olabilir ama sunucu yoğunluğunu azaltır. Masrafı azaltmak çoğu zaman desteklenebilirliği, kullanılırlığı, sunucu yoğunluğunu, kaynak kapasitesini ve genişleyebilirliği azaltmak demektir.

source: What OpenStack features and enhancements does the cinder driver enable?
tr_tr: Cinder sürücüsü hangi OpenStack özelliklerini ve iyileştirmelerini etkinleştiriyor?

source: What about SSD? DRAM SSD?
tr_tr: Peki ya SSD? DRAM SSD?

source: What are my workloads?
tr_tr: İş yüklerim neler?

source: What is my company currently using and can I use it with OpenStack?
tr_tr: Şirketim şu an ne kullanıyor ve bunu OpenStack ile kullanabilir miyim?

source: What is my forecast for the scaling of storage for compute?
tr_tr: Hesaplama için depolamada ilerisi için ölçekleme öngörüm nedir?

source: What is the desired attachment method: NFS, iSCSI, FC, or other?
tr_tr: Tercih edilen ekleme yöntemi nedir: NFS, iSCSI, FC, veya başka bir şey?

source: What is the level of support provided by the vendor within the community?
tr_tr: Üreticinin topluluk içinde sağladığı destek seviyesi nedir?

source: What storage is my enterprise currently using? Can it be re-purposed?
tr_tr: Kurumum şu an hangi depolamayı kullanıyor? Yeniden tasarlanabilir mi?

source: What type of performance do I need in regards to IOPS? Total IOPS and IOPS per instance? Do I have applications with IOPS SLAs?
tr_tr: IOPS bakımından nasıl bir başarıma ihtiyacım var? Toplam IOPS ve sunucu başına IOPS? IOPS SLA'ları olan uygulamalarım var mı?

source: When CPU pinning is requested for for a guest, it is assumed there is no overcommit (or, an overcommit ratio of 1.0). When dedicated resourcing is not requested for a workload, the normal overcommit ratios are applied.
tr_tr: Bir misafir için işlemci sabitleme istenildiğinde, kaynak aşımı olmadığı varsayılır (veyea 1.0 oranında kaynak aşımı denebilir). Bir iş yükü için adanmış kaynaklama istenmediğinde, normal kaynak aşım oranları uygulanır.

source: When a user uploads and stores content, that content moves into the OpenStack installation. When users download this content, the content moves out from the OpenStack installation. Because this service operates primarily as a backup, most of the traffic moves southbound into the environment. In this situation, it benefits you to configure a network to be asymmetrically downstream because the traffic that enters the OpenStack installation is greater than the traffic that leaves the installation.
tr_tr: Kullanıcı içerik yüklediğinde ve kaydettiğinde, bu içerik OpenStack kurulumuna taşınır. Kullanıcılar içeriği indirdiklerinde, içerik OpenStack kurulumundan dışarı taşınır. Bu servis birincil olarak yedekleme için servis vereceğinden, çoğu trafik güney taraflı olarak ortama doğru taşınır. Bu durumda, ağı asimetrik aşağı akışlı yapılandırmak faydalıdır çünkü OpenStack kurulumuna doğru giren trafik kurulumu terk eden trafikten büyüktür.

source: When architecting an OpenStack cloud, as part of the planning process, you must not only determine what hardware to utilize but whether compute resources will be provided in a single pool or in multiple pools or availability zones. You should consider if the cloud will provide distinctly different profiles for compute.
tr_tr: OpenStack bulutu imar ederken, planlama sürecinin bir parçası olarak hangi donanımın kullanılacağının yanı sıra hesaplama havuzlarının tek bir havuzda mı birden çok havuzda ya da kullanılırlık bölgesinde mi olacağına karar vermeniz gerekir. Bulutun hesaplama için farklı profiller sağlayıp sağlamayacağına karar vermelisiniz.

source: When attempting to deploy logging and monitoring facilities to a centralized location, care must be taken with the load placed on the inter-site networking links
tr_tr: Merkezi bir konuma günlükleme ve izleme kurulumuna teşebbüs edilirken, konumlar arası bağlantıya gelecek yük hesaba katılmalıdır
