Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: **(Optional) External or Public network** - This network is used to communicate externally from the VMs to the public network space. These addresses are typically handled by the neutron agent on the controller nodes and can also be handled by a SDN other than neutron. However, when using neutron DVR with OVS, this network must be present on the compute node since north and south traffic will not be handled by the controller nodes, but by the compute node itself. For more information on DVR with OVS and compute nodes, see `Open vSwitch: High availability using DVR <https://docs.openstack.org/ocata/networking-guide/deploy-ovs-ha-dvr.html>`_
tr_tr: **(İsteğe bağlı) Harici veya Açık ağ** - Bu ağ sanal makinelerden harici olarak açık ağ alanına iletişim için kullanılır. Bu adresler genellikle kontrol düğümündeki neutron aracısı tarafından ele alınır ve başka bir neutron ya da SDN tarafından da ele alınabilir. Ancak neutron DVR'yi OVS ile kullanırken bu ağ hesaplama düğümünde olmalıdır, çünkü kuzey ve güney trafiği kontrol düğümleri tarafından değil, hesaplama düğümü tarafından ele alınacaktır. OVS'li DVR ve hesaplama düğümleriyle ilgili daha fazla bilgi için `Open vSwitch: DVR ile yüksek kullanılırlığa <https://docs.openstack.org/ocata/networking-guide/deploy-ovs-ha-dvr.html>`_ göz atın.

source: **DRAM SSDs**: Small reads – 4091 IOPs (23x), Small writes – 4184 IOPs (14x)
tr_tr: **DRAM SSD'ler**: Küçük okumalar – 4091 IOPs (23x), Küçük yazmalar – 4184 IOPs (14x)

source: **File-level storage for live migration**
tr_tr: **Canlı göç için dosya-seviyesi depolama**

source: **Flash SSDs**: Small reads – 1075 IOPs (6x), Small writes – 21 IOPs (0.1x)
tr_tr: **Flash SSD'ler**: Küçük okumalar – 1075 IOPs (6x), Küçük yazmalar – 21 IOPs (0.1x)

source: **HDDs**: Small reads – 175 IOPs, Small writes – 280 IOPs
tr_tr: **HDD'ler**: Küçük okumalar – 175 IOPs, Küçük yazmalar – 280 IOPs

source: **Install or OOB network** - Typically used by most distributions and provisioning tools as the network for deploying base software to the OpenStack compute nodes. This network should be connected at a minimum of 1Gb and no routing is usually needed.
tr_tr: **Yükleme veya OOB ağı** - OpenStack hesaplama düğümlerine temel yazılım kurulumu için olan ağ olarak çoğu dağıtım ve hazırlık aracı tarafından kullanılır. Bu ağ en az 1Gb bağlanmalıdır, genellikle yönlendirmeye gerek yoktur.

source: **Internal or Management network** - Used as the internal communication network between OpenStack compute and control nodes. Can also be used as a network for iSCSI communication between the compute and iSCSI storage nodes. Again, this should be a minimum of a 1Gb NIC and should be a non-routed network. This interface should be redundant for high availability (HA).
tr_tr: **Dahili veya Yönetim ağı** - OpenStack kontrol ve hesaplama düğümleri arasında dahili iletişim ağı olarak kullanılır. Hesaplama ile iSCSI depolama düğümleri arasında iSCSI iletişimi için de kullanılabilir. Bu da asgari 1Gb NIC'e sahip olmalı ve yönlendirilmeyen ağ olmalıdır. Bu arayüz yüksek kullanılırlık (HA) için yedekli olmalıdır.

source: **Multithread Considerations**
tr_tr: **Çoklu İş Parçacığı Etmenleri**

source: **Storage driver support**
tr_tr: **Depolama sürücüsü desteği**

source: **Storage network** - A private network which could be connected to the Ceph frontend or other shared storage. For HA purposes this should be a redundant configuration with suggested 10Gb NICs. This network isolates the storage for the instances away from other networks. Under load, this storage traffic could overwhelm other networks and cause outages on other OpenStack services.
tr_tr: **Depolama ağı** - Ceph önyüzüne ya da diğer paylaşımlı depolamaya bağlanabilecek özel bir ağ. Yüksek kullanılırlık amacıyla bu tavsiye edilen 10Gb NIC'lere sahip yedekli yapılandırmada olmalıdır. Bu ağ sunucular için depolamayı diğer ağlardan yalıtır. Yük altında, bu depolama trafiği diğer ağları boğabilir ve diğer OpenStack servislerinde kesintilere yol açabilir.

source: **Tenant network** - A private network that enables communication between each tenant's instances. If using flat networking and provider networks, this network is optional. This network should also be isolated from all other networks for security compliance. A 1Gb interface should be sufficient and redundant for HA.
tr_tr: **Kiracı ağı** - Her bir kiracının sunucuları arasında iletişimi etkinleştiren özel bir ağ. Düz ağ ve sağlayıcı ağlar kullanılıyorsa, bu ağ isteğe bağlıdır. Bu ağ ayrıca güvenlik uyumu için diğer tüm ağlardan yalıtılmalıdır. Yüksek kullanılırlık ve yedek için 1Gb arayüz yeterli olmalıdır.

source: 10 GB first disk, 30 GB second disk
tr_tr: 10 GB ilk disk, 30 GB ikinci disk

source: 10 GbE horizontally scalable spine leaf back-end storage and front end network.
tr_tr: 10 GbE yatay ölçeklenebilir omurga yaprak arka uçlu depolama ve ön yüz ağı.

source: 10 GbE horizontally scalable spine leaf back-end storage and front-end network
tr_tr: 10 GbE yatay ölçeklenebilir omurga yaprak arka uç depolama ve ön yüz ağı

source: 10 storage servers each with 12x4 TB disks equaling 480 TB total space with approximately 160 TB of usable space after replicas.
tr_tr: Yedeklerden sonra yaklaşık 160 TB kullanılabilir alanı olan toplam 480 TB alana eşit 12x4 TB disklere sahip 10 depolama sunucusu.

source: 10 storage servers each with 12x4 TB disks which equals 480 TB total space with about approximately 160 TB of usable space after 3 replicas
tr_tr: 3 yedekten sonra 160 TB kullanılır alana sahip olacak 480 TB toplam alana denk gelen her biri 12x4 TB diske sahip 10 depolama sunucusu

source: 10s of TBs of dataset storage
tr_tr: 10'larca TB verikümesi depolama

source: 1U rack-mounted servers have the ability to offer greater server density than a blade server solution, but are often limited to dual-socket, multi-core CPU configurations. It is possible to place forty 1U servers in a rack, providing space for the top of rack (ToR) switches, compared to 32 full width blade servers.
tr_tr: 1U kabine-bağlı sunucular blade sunucu çözümüne göre çok daha iyi sunucu yoğunluğuna sahiptirler, ama çoğunlukla çift-soket çoklu-çekirdek işlemci yapılandırmalarıyla sınırlıdırlar. Kabine kırk 1U sunucu sığdırarak kabin üstü (ToR) anahtarlara yer sağlamak mümkündür, blade sunucularla bu rakam 32'dir.

source: 2U rack-mounted servers provide quad-socket, multi-core CPU support, but with a corresponding decrease in server density (half the density that 1U rack-mounted servers offer).
tr_tr: 2U kabine-bağlı sunucular dört-soket çoklu-çekirdek işlemci desteği sağlar, ama sunucu yoğunluğunu buna bağlı olarak düşürür (1U kabine-bağlı sunucuların yarı yoğunluğunu sunarlar).

source: 2x10 GbE back-end bonds
tr_tr: 2x10 GbE arka uç bağları

source: 2x10 GbE bonded front end
tr_tr: 2x10 GbE bağlı ön yüz

source: 3x proxies
tr_tr: 3x vekil

source: 5 storage servers for caching layer 24x1 TB SSD
tr_tr: Ön bellekleme katmanı için 5 depolama sunucusu 24x1 TB SSD

source: :ref:`logical_architecture` shows one example of the most common integrated services within OpenStack and how they interact with each other. End users can interact through the dashboard, CLIs, and APIs. All services authenticate through a common Identity service, and individual services interact with each other through public APIs, except where privileged administrator commands are necessary.
tr_tr: :ref:`logical_architecture` OpenStack içinde en tümleşik servislerden bir örnek ve birbirleriyle nasıl iletişim kurduklarını gösterir. Son kullanıcılar kontrol paneli, CLI'ler, ve API'ler aracılığıyla iletişim kurabilirler. Tüm servisler genel bir Kimlik servisi aracılığıyla kimlik doğrulaması yaparlar, ve bağımsız servisler birbirleriyle açık API'ler aracılığıyla iletişim kurarlar, istisna yetkili yönetici komutlarının gerekli olduğu durumlardır.

source: :ref:`table_controller_hardware` contains common considerations to review when sizing hardware for the cloud controller design.
tr_tr: :ref:`table_controller_hardware` bulut kontrol birimi tasarımı için donanım boyutlandırırken gözden geçirilecek etmenleri içerir.

source: :ref:`table_openstack_storage` explains the differences between Openstack storage types.
tr_tr: :ref:`table_openstack_storage` tablosu Openstack depolama türleri arasındaki farkları açıklar.

source: :term:`Quality of Service (QoS)` also has a great impact on network intensive workloads as it provides instant service to packets which have a higher priority due to the impact of poor network performance. In applications such as Voice over IP (VoIP), differentiated services code points are a near requirement for proper operation. You can also use QoS in the opposite direction for mixed workloads to prevent low priority but high bandwidth applications, for example backup services, video conferencing, or file sharing, from blocking bandwidth that is needed for the proper operation of other workloads. It is possible to tag file storage traffic as a lower class, such as best effort or scavenger, to allow the higher priority traffic through. In cases where regions within a cloud might be geographically distributed it may also be necessary to plan accordingly to implement WAN optimization to combat latency or packet loss.
tr_tr: Zayıf ağ başarımı nedeniyle yüksek önceliğe sahip olan paketlere anında servis sağladığından :term:`Servis Kalitesi (QoS)`nin de ağ ağırlıklı iş yükleri üzerinde büyük etkisi vardır. IP üzerinden Ses (VoIP) gibi uygulamalarda, düzgün işlem için farklı servislerin kod noktaları aynı ölçüde gereklidir. Karışık iş yüklerinde de düşük öncelikli ama yüksek bant genişlikli uygulamaları önlemek için QoS'u aksi yönde kullanabilirsiniz, örneğin yedekleme servisleri, video konferansı, dosya paylaşımı gibi uygulamaların diğer iş yüklerinin işlemesi için gereken bant genişliğini engellememesi için. Bulut içindeki bölgelerin coğrafi olarak dağıtık olduğu durumlarda gecikme ve paket kayıplarıyla savaşmak için de WAN iyileştirmeleri planlamak gerekli olabilir.

source: A RAID 5 array only has 25% of the write IOPS of the read IOPS while a RAID 1 array in this case would produce a maximum of 975 IOPS.
tr_tr: Bir RAID 1 dizisi azami 975 IOPS üretecekken RAID 5 dizisi yalnızca okuma IOPS'unun 25% kadarına sahiptir.

source: A Shared File Systems service share (either manila managed or an external one registered in manila) that can be partitioned, formatted and mounted (such as /dev/vdc)
tr_tr: Bölümlenebilir, biçimlendirilmiş, ve bağlı (/dev/vdc gibi) Paylaşımlı Dosya Sistemleri servisi paylaşımı (manila tarafından yönetilen veya manila'ya harici olarak kaydedilmiş)

source: A basic understanding of networking principles and protocols.
tr_tr: Ağ prensipleri ve iletişim kurallarıyla ilgili temel anlayış.

source: A block device that can be partitioned, formatted, and mounted (such as, /dev/vdc)
tr_tr: Bölümlenebilir, biçimlendirilmiş, ve bağlı bir blok aygıt (/dev/vdc gibi)

source: A cloud controller's hardware can be the same as a compute node, though you may want to further specify based on the size and type of cloud that you run.
tr_tr: Bir bulut kontrol biriminin donanımı hesaplama düğümüyle aynı olabilir, yine de çalıştırdığınız bulut türüne ve boyutuna göre belirleme yapabilirsiniz.

source: A cloud environment fundamentally changes the ways that networking is provided and consumed. Understanding the following concepts and decisions is imperative when making architectural decisions. For detailed information on networking concepts, see the `OpenStack Networking Guide <https://docs.openstack.org/ocata/networking-guide/>`_.
tr_tr: Bulut ortamı ağın sağlandığı ve tüketildiği yönleri özünde değiştirir. Mimari kararlar alırken takip eden kavramları ve kararları anlamak faydalı olacaktır. Ağ kavramlarıyla ilgili ayrıntılı bilgi için `OpenStack Ağ Kılavuzuna <https://docs.openstack.org/ocata/networking-guide/>`_ göz atın.

source: A disk within a single node
tr_tr: Tek bir düğümdeki bir disk

source: A distributed shared file system. As of Gluster version 3.3, you can use Gluster to consolidate your object storage and file storage into one unified file and object storage solution, which is called Gluster For OpenStack (GFO). GFO uses a customized version of swift that enables Gluster to be used as the back-end storage.
tr_tr: Dağıtık bir paylaşımlı dosya sistemi. Gluster sürüm 3.3'den itibaren nesne depolama ve dosya depolamanızı tek bir dosya ve nesne depolama çözümü şeklinde pekiştirebilirsiniz, buna OpenStack için Gluster (GFO) denir. GFO Gluster'in arka uç depolama olarak kullanılabilmesini sağlayan özelleştirilmiş bir swift sürümü kullanır.

source: A file system
tr_tr: Bir dosya sistemi

source: A firewall, switches and load balancers on the public facing network connections.
tr_tr: Açık taraftaki ağ bağlantıları üzerinde bir güvenlik duvarı, anahtarlar ve yük dengeleyiciler.

source: A general purpose OpenStack cloud has multiple options. The key factors that will have an influence on selection of storage hardware for a general purpose OpenStack cloud are as follows:
tr_tr: Genel amaçlı bir OpenStack bulutu birden çok seçeneğe sahiptir. Genel amaçlı bir OpenStack bulutu için depolama donanımı seçimini etkileyebilecek anahtar etmenler şunlardır:

source: A hypervisor provides software to manage virtual machine access to the underlying hardware. The hypervisor creates, manages, and monitors virtual machines. OpenStack Compute (nova) supports many hypervisors to various degrees, including:
tr_tr: Hipervizör altta yatan donanıma erişmek için sanal makine erişimini yöneten yazılımı sağlar. Hipervizör sanal makineleri oluşturur, yönetir ve izler. OpenStack Hesaplama (nova) bir çok hipervizörü belli derecede destekler:

source: A key consideration in a storage-focused OpenStack cloud is latency. Using solid-state disks (SSDs) to minimize latency and, to reduce CPU delays caused by waiting for the storage, increases performance. Use RAID controller cards in compute hosts to improve the performance of the underlying disk subsystem.
tr_tr: Depolama odaklı bir OpenStack bulutunda anahtar etmenlerden biri gecikmedir. SSD diskler kullanmak gecikmeyi asgaride tutabilir, ve depolama için beklenen CPU gecikmelerini azaltarak başarımı artırır. Altta yapan disk alt sisteminin başarımını iyileştirmek için hesaplama sunucularında RAID kontrol kartlarını kullanın.

source: A measure of how many servers can fit into a given measure of physical space, such as a rack unit [U].
tr_tr: Fiziksel alana kaç tane sunucu sığacağının ölçümü, örneğin kabin birimi [U].

source: A scalable, reliable data store for OpenStack virtual machine images.
tr_tr: OpenStack sanal makine imajları için ölçeklenebilir, güvenilir veri depolama.

source: A storage system presents a LUN backed by a set of SSDs using a traditional storage array with OpenStack Block Storage integration or a storage platform such as Ceph or Gluster.
tr_tr: Bir depolama sistemi OpenStack Blok Depolama tümleşimi veya Ceph veya Gluster gibi bir depolama platformu ile geleneksel depolama dizisi kullanarak bir takım SSD destekli LUN arka ucu sunar.

source: A three node MariaDB and Galera cluster, each with 4 vCPUs and 8 GB of RAM
tr_tr: Üç düğümlü MariaDB ve Galera kümesi, her biri 4 vCPU ve 8 GB RAM'e sahip

source: A web service architecture has many options and optional components. Due to this, it can fit into a large number of other OpenStack designs. A few key components, however, need to be in place to handle the nature of most web-scale workloads. You require the following components:
tr_tr: Bir web servisi mimarisi bir çok seçeneğe ve isteğe bağlı bileşenlere sahiptir. Bu yüzden, yüksek sayıda diğer OpenStack tasarımlarının içine sığabilir. Yine de çoğu web ölçekli iş yüklerinde bazı anahtar kavramların yerinde olması gerekir. Şu bileşenlere ihtiyaç duyarsınız:

source: A well-considered auditing plan is essential for quickly finding issues. Keeping track of changes made to security groups and tenant changes can be useful in rolling back the changes if they affect production. For example, if all security group rules for a tenant disappeared, the ability to quickly track down the issue would be important for operational and legal reasons. For more details on auditing, see the `Compliance chapter <https://docs.openstack.org/security-guide/compliance.html>`_ in the OpenStack Security Guide.
tr_tr: İyi düşünülmüş bir denetleme planı sorunları bulmak için gereklidir. Güvenlik gruplarına yapılan değişiklikler ve kiracı değişikliklerini takip etmek değişiklikleri üretimi etkilemeleri durumunda geri almak için kullanışlı olabilir. Örneğin, bir kiracı için tüm güvenlik grupları ortadan kaybolursa, yasal ve işlevsel sebeplerle sorunu çabucak bulabilmek önemli olur. Denetlemeyle ilgili daha fazla ayrıntı için, OpenStack Güvenlik Kılavuzundaki `Uyumluluk bölümüne <https://docs.openstack.org/security-guide/compliance.html>`_ göz atın.

source: A wide variety of use case requirements dictate the nature of the storage back end. Examples of such requirements are as follows:
tr_tr: Geniş kullanım durumu gereksinim çeşitliliği depolama arka ucunun doğasını belirler. Bu tür gereksinimlere örnek vermek gerekirse:

source: A zone within an Object Storage cluster is a logical division. Any of the following may represent a zone:
tr_tr: Bir Nesne Depolama kümesindeki bölge mantıksal bir bölümdür. Aşağıdakilerin her biri bir bölgeyi temsil edebilir:

source: API availability guarantees implying multiple infrastructure services and highly available load balancers.
tr_tr: API kullanılırlığı çeşitli alt yapı servislerini ve yüksek kullanılırlıklı yük dengeleyicileri kasteder.

source: API differences
tr_tr: API farkları

source: API endpoints
tr_tr: API uç noktaları

source: Abstract
tr_tr: Özet

source: Accessed through…
tr_tr: Şunun aracılığıyla erişildi...

source: Accessible from…
tr_tr: Şuradan erişilebilir...

source: Add additional persistent storage to a virtual machine
tr_tr: Bir sanal makineye ek kalıcı depolama ekle

source: Add additional persistent storage to a virtual machine (VM)
tr_tr: Bir sanal makineye (VM) ek kalıcı depolama ekle

source: Adding back-end storage capacity to an Object Storage cluster requires careful planning and forethought. In the design phase, it is important to determine the maximum partition power required by the Object Storage service, which determines the maximum number of partitions which can exist. Object Storage distributes data among all available storage, but a partition cannot span more than one disk, so the maximum number of partitions can only be as high as the number of disks.
tr_tr: Bir Nesne Depolama kümesine arka uç depolama kapasitesi eklemek dikkatli planlama ve ileri görüş ister. Tasarım aşamasında, Nesne Depolama servisi tarafından ihtiyaç duyulan azami bölüm gücüne karar vermek önemlidir, bu var olabilecek azami bölüm sayısını tanımlar. Nesne Depolama veriyi tüm kullanılabilir depolamaya dağıtır, ama bir bölüm bir diskten ötesine geçemez, yani azami bölüm sayısı disklerin sayısı kadar büyük olabilir.

source: Adding more layers to the Ethernet frame only slows the networking process down. This is known as nodal processing delay.
tr_tr: Ethernet çerçevesine daha fazla katman eklemek yalnızca ağ sürecini yavaşlatır. Buna düğümsel işleme gecikmesi denir.

source: Additional capabilities can be realized by moving static web content to be served from OpenStack Object Storage containers, and backing the OpenStack Image service with OpenStack Object Storage.
tr_tr: Statik web içeriğinin OpenStack Nesne Depolama kapsayıcılarından sunulmasıyla ve OpenStack İmaj servisinin OpenStack Nesne Depolamayla desteklenmesiyle ek yeteneklerin farkına varılabilir.

source: Additional network design considerations
tr_tr: Ek ağ tasarım etmenleri

source: Additional networking services
tr_tr: Ek ağ servisleri

source: Additionally there are several codecs that can be used to change the data representation of events such as:
tr_tr: Ek olarak olayların veri sunumunu değiştirmek için kullanılabilecek değişik kodlayıcılar da bulunmaktadır:

source: Additionally, CPU selection may not be one-size-fits-all across enterprises, but more of a list of SKUs that are tuned for the enterprise workloads.
tr_tr: Ek olarak, işlemci seçimi kurumlar arasında hepsine uygun tek boy şeklinde değil de, daha çok kurumsal iş yükleri için ayarlanmış SKU'lar listesi şeklinde olabilir.

source: Address network-focused applications when considering certain operational realities. For example, consider the impending exhaustion of IPv4 addresses, the migration to IPv6, and the use of private networks to segregate different types of traffic that an application receives or generates. In the case of IPv4 to IPv6 migrations, applications should follow best practices for storing IP addresses. We recommend you avoid relying on IPv4 features that did not carry over to the IPv6 protocol or have differences in implementation.
tr_tr: Belirli işlevsel gerçekleri göz önüne alırken ağ odaklı uygulamaları da göz önüne alın. Örneğin yaklaşan IPv4 adreslerinin bitişini, IPv6'ya geçişi, ve bir uygulamanın aldığı ya da ürettiği değişik türde trafik için özel ağlar ayırmayı göze alın. IPv4'den IPv6'ya geçiş durumunda, uygulamalar IP adreslerini depolamak için en iyi yöntemleri takip etmelidirler. IPv6 iletişim kurallarına taşınmamış ya da uygulanmasında farklılıklar olan IPv4 özelliklerinden uzak durmanızı öneririz.

source: Admin establishing `encrypted volume type <https://docs.openstack.org/admin-guide/dashboard-manage-volumes.html>`_, then user selecting encrypted volume
tr_tr: Yönetici `şifreli bölüm türü <https://docs.openstack.org/admin-guide/dashboard-manage-volumes.html>`_ yerleştirir, ardından kullanıcı şifreli birimi seçer

source: Administrator configuration of size settings, known as *flavors*
tr_tr: Boyut ayarları için yönetici yapılandırması, *nitelikler* olarak bilinir

source: After an outage, ensure that operations of a site are resumed when it comes back online. We recommend that you architect the recovery to avoid race conditions.
tr_tr: Bir kesintiden sonra, bölge çevrimiçi olduğunda işlemlerin devam ettiğinden emin olun. Kurtarmanın yarış koşullarından etkilenmeyecek şekilde tasarlandığından emin olun.

source: After an outage, ensure the method for resuming proper operations of a site is implemented when it comes back online. We recommend you architect the recovery to avoid race conditions.
tr_tr: Bir kesintiden sonra, konum tekrar çevrimiçi olduğunda yapılması gereken işlemlerin doğruluğundan emin olun. Kurtarmayı yarış durumlarına sebep olmayacak şekilde tasarlamanızı öneriyoruz.

source: All :term:`Advanced Message Queuing Protocol (AMQP)` messages for services are received and sent according to the queue broker
tr_tr: Servisler için tüm :term:`Gelişmiş İleti Kuyruklama İletişim Kuralı (AMQP)` iletileri kuyruk aracısına göre gönderilir ya da alınır

source: All network devices need to be aware of all MACs, even instance MACs, so there is constant churn in MAC tables and network state changes as instances start and stop.
tr_tr: Tüm ağ aygıtları tüm MAC'lerden, hatta sunucu MAC'lerinden haberdar olmalıdır, yani sunucular başlatılıp durduruldukça ağ durumu ve MAC tabloları sürekli değişir.
