Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: Consider the scenario where an entire server fails and 24 TB of data needs to be transferred "immediately" to remain at three copies — this can put significant load on the network.
tr_tr: Bir sunucunun tamamen arızalandığını ve üç kopyanın sağlanabilmesi için 24 TB verinin "anında" aktarılması gerektiğini düşünün — bu ağda oldukça yüksek yüke sebep olabilir.

source: Consider the security of data between the client and the endpoint, and of traffic that traverses the multiple clouds.
tr_tr: İstemci ve uç nokta arasındaki verinin güvenliğini ve birden çok bulut arasında akan trafiğin güvenliğini dikkate alın.

source: Consider these main traffic flows for an Object Storage network:
tr_tr: Bir Nesne Depolama ağı için şu ana trafik akışlarını göz önüne alın:

source: Consideration
tr_tr: Etmen

source: Considerations affecting storage architecture (and corresponding storage hardware) of a Storage-focused OpenStack cloud include:
tr_tr: Depolama odaklı bir OpenStack bulutunun depolama mimarisini etkileyen etmenleri (ve ilişkili depolama donanımı) şunları içerir:

source: Considerations when choosing hardware
tr_tr: Donanım seçerken göz önüne alınacaklar

source: Considering non-uniform memory access (NUMA) is important when selecting CPU sizes and types, as there are use cases that use NUMA pinning to reserve host cores for operating system processes. These reduce the available CPU for workloads and protects the operating system.
tr_tr: İşlemci boyut ve türünü seçerken düzensiz hafıza erişimi (NUMA) önemlidir, çünkü işletim sistemi süreçleri için sunucu çekirdeklerini ayırmak için NUMA sabitlemesinin kullanıldığı durumlar bulunur. Bu, iş yükler için kullanılabilir işlemciyi azaltarak işletim sistemini korur.

source: Considering these requirements, we recommend the following:
tr_tr: Bu gereksinimleri göz önüne alarak, şunları öneriyoruz:

source: Consolidation of object storage and block storage.
tr_tr: Nesne depolama ve blok depolamanın pekiştirilmesi.

source: Consult the vendor documentation to check for virtualization support. For Intel CPUs, see `Does my processor support Intel® Virtualization Technology? <https://www.intel.com/content/www/us/en/support/processors/000005486.html>`_. For AMD CPUs, see `AMD Virtualization <https://www.amd.com/en-us/innovations/software-technologies/server-solution/virtualization>`_. Your CPU may support virtualization but it may be disabled. Consult your BIOS documentation for how to enable CPU features.
tr_tr: Sanallaştırma desteği için üretici belgelendirmesine danışın. Intel işlemciler için, `İşlemcim Intel® Sanallaştırma Teknolojisini destekliyor mu? <https://www.intel.com/content/www/us/en/support/processors/000005486.html>`_ ve AMD işlemciler için `AMD Sanallaştırma <https://www.amd.com/en-us/innovations/software-technologies/server-solution/virtualization>`_ belgelerine göz atın. İşlemciniz sanallaştırmayı desteklemesine rağmen bu özellik kapalı olabilir. İşlemci özelliklerini etkinleştirmeyle ilgili bilgi için BIOS belgelendirmenize göz atın.

source: Consumers of external clouds rarely have control over provider changes to APIs, and changes can break compatibility. Using only the most common and basic APIs can minimize potential conflicts.
tr_tr: Harici bulut tüketicilerinin sağlayıcıların API'lere yaptığı değişiklikler üzerinde kontrolleri çoğunlukla olmaz, ve değişiklikler uyumluluğu bozabilir. Yalnızca en genel ve temel API'leri kullanmak çakışmaları asgari düzeye indirebilir.

source: Consumption model
tr_tr: Tüketim modeli

source: Contents
tr_tr: İçindekiler

source: Control Plane
tr_tr: Kontrol Düzlemi

source: Control Plane - ancillary services such as API endpoints, and services that control CRUD operations. The services in this category are usually subject to a different SLA expectation and may be better suited on separate hardware or containers from the Data Plane services.
tr_tr: Kontrol Düzlemi - API uç noktaları, ve CRUD işlemlerini kontrol eden ikincil servisler. Bu kategorideki servisler genellikle farklı SLA beklentilerine sahiptirler ve Veri Düzlemi servislerinden ayrı donanım veya kapsayıcılar için daha uygundurlar.

source: Controlling traffic with routing metrics is straightforward.
tr_tr: Yönlendirme ölçütleriyle trafiği kontrol etmek kolaydır.

source: Cost
tr_tr: Maliyet

source: Cost The relative cost of the hardware weighed against the total amount of capacity available on the hardware based on predetermined requirements.
tr_tr: Önceden belirlenmiş gereksinimlere göre donanımın donanım tam kapasitedeykenki haline göre fiyat oranı.

source: Create a share from a snapshot.
tr_tr: Anlık görüntüden paylaşım oluştur.

source: Create a share on either a share server or standalone, depending on the selected back-end mode, with or without using a share network.
tr_tr: Seçili arka uç kipine göre bir paylaşım ağı kullanarak ya da kullanmayarak bir paylaşım sunucusu ya da tek başına sunucuda paylaşım oluştur.

source: Create a share specifying its size, shared file system protocol, visibility level.
tr_tr: Boyutunu, paylaşım dosya sistemi iletişim kuralını, görünürlük seviyesini belirterek bir paylaşım oluşturun.

source: Create a snapshot of a selected share or a share group for storing the existing shares consistently or creating new shares from that snapshot in a consistent way.
tr_tr: Mevcut paylaşımları tutarlı tutmak ya da bu anlık görüntüden tutarlı bir yolla yeni paylaşımlar oluşturmak için seçili bir paylaşımın veya paylaşım grubunun anlık görüntüsünü oluştur.

source: Daemon
tr_tr: Artalan İşlemi

source: Dashboard
tr_tr: Kontrol Paneli

source: Data Plane - services that provide virtualization, networking, and storage. Customers usually require these services to be continuously available.
tr_tr: Veri Düzlemi - sanallaştırma, ağ ve deoplama sağlayan servisler. Müşteriler genellikle bu servislerin sürekli kullanılır olmasını beklerler.

source: Data centers have a specified amount of power fed to a given rack or set of racks. Older data centers may have power densities as low as 20A per rack, and current data centers can be designed to support power densities as high as 120A per rack. The selected server hardware must take power density into account.
tr_tr: Veri merkezlerinde bir kabin ya da kabin kümesine belirli miktarda güç beslemesi yapılır. Eski veri merkezlerinin kabin başına 20A kadar düşük olabilirken, mevcut veri merkezleri kabin başına 120A yüksekliği destekleyecek güçle tasarlanabilir. Seçilen donanımda güç yoğunluğu hesaba katılmalıdır.

source: Data in an OpenStack cloud moves between instances across the network (known as east-west traffic), as well as in and out of the system (known as north-south traffic). Physical server nodes have network requirements that are independent of instance network requirements and must be isolated to account for scalability. We recommend separating the networks for security purposes and tuning performance through traffic shaping.
tr_tr: OpenStack bulutunda veri sunucular arasında ağlar üzerinden (doğu-batı trafiği olarak bilinir), ve sistemden dışarı (kuzey-güney trafiği olarak bilinir) hareket eder. Ölçeklenebilirliğin devamı için sunucu ağı gereksinimlerinden farklı ihtiyaçları olan fiziksel sunucu düğümlerinin ağı yalıtılmalıdır. Güvenlik amacıyla ve trafik şekillendirme ile başarımın artırılması için ağların ayrılmasını öneriyoruz.

source: Data plane and control plane
tr_tr: Veri ve kontrol düzlemi

source: Data security recommendations:
tr_tr: Veri güvenliği önerileri:

source: Database
tr_tr: Veritabanı

source: Database and message queue server (such as MySQL, RabbitMQ)
tr_tr: Veritabanı ve ileti kuyruğu sunucusu (MySQL, RabbitMQ gibi)

source: Database services, such as ``MySQL`` or ``PostgreSQL``.
tr_tr: ``MySQL`` veya ``PostgreSQL`` gibi veritabanı servisleri.

source: Database software
tr_tr: Veritabanı yazılımı

source: Databases
tr_tr: Veritabanları

source: Databases are a common workload that benefit from high performance storage back ends. Although enterprise storage is not a requirement, many environments have existing storage that OpenStack cloud can use as back ends. You can create a storage pool to provide block devices with OpenStack Block Storage for instances as well as object interfaces. In this example, the database I-O requirements are high and demand storage presented from a fast SSD pool.
tr_tr: Veritabanları yüksek başarımlı depolama arka uçlarından faydalanan yaygın iş yükleridir. Kurumsal depolama gereklilik olmasa da, çoğu ortam OpenStack bulutunun arka uç olarak kullanabileceği mevcut depolamaya sahiptir. Sunucular ve nesne arayüzleri için OpenStack Blok Depolama ile blok aygıtlar sunmask için depolama havuzları oluşturabilirsiniz. Bu örnekte veritabanı I/O gereksinimleri yüksektir ve hızlı SSD havuzundan sunulan depolamaya ihtiyaç duyulur.

source: Decide on a network framework and design minimum functionality tests. This ensures testing and functionality persists during and after upgrades.
tr_tr: Bir ağ çatısında karar kılın ve asgari işlevsellik denemelerini tasarlayın. Bu yükseltme sürecinde ve sonrasında işlevselliğin kalıcı olduğunu denemenizi sağlar.

source: Deleted by user
tr_tr: Kullanıcı tarafından silindi

source: Depending on design, heavy I/O usage from some instances can affect unrelated instances.
tr_tr: Tasarıma bağlı olarak, bazı sunuculardaki ağır I/O kullanımı ilgisiz sunucuları etkileyebilir.

source: Depending on the design, some network service functions may fall into both the Control and Data Plane categories. For example, the neutron L3 Agent service may be considered a Control Plane component, but the routers themselves would be a Data Plane component.
tr_tr: Tasarıma bağlı olarak, bazı ağ servisi işlevleri hem Kontrol hem Veri Düzlemi kategorisine girebilir. Örneğin, neutron L3 Aracı servisi Kontrol Düzlemi bileşeni sayılabilir, ama yönlendiricilerin kendileri Veri Düzlemi bileşenidir.

source: Depending on the storage architecture, you can adopt a scale-out solution, or use a highly expandable and scalable centralized storage array. If a centralized storage array meets your requirements, then the array vendor determines the hardware selection. It is possible to build a storage array using commodity hardware with Open Source software, but requires people with expertise to build such a system.
tr_tr: Depolama mimarisine bağlı olarak, bir dışa ölçekleme çözümü edinebilirsiniz, veya yüksek genişleyebilirlikli ve ölçeklenebilir merkezi depolama dizisi kullanabilirsiniz. Eğer merkezi depolama dizisi gereksinimlerinizi karşılıyorsa, dizi üreticisi donanım seçiminizi belirler. Ticari donanımla ve Açık Kaynaklı yazılımlarla depolama dizisi inşa etmek de mümkündür, ama böyle bir sistemi inşa edecek deneyimli kişilere ihtiyaç duyulur.

source: Depends completely on the size of back-end storage specified when a share was being created. In case of thin provisioning it can be partial space reservation (for more details see `Capabilities and Extra-Specs <https://docs.openstack.org/developer/manila/devref/capabilities_and_extra_specs.html?highlight=extra%20specs#common-capabilities>`_ specification)
tr_tr: Tamamen bir paylaşım oluşturulduğunda tanımlanan arka uç depolamanın boyutuna bağlıdır. İnce hazırlık durumunda kısmi alan ayrımı olabilir (daha fazla ayrıntı için `Kapasite ve Ek Özellikler <https://docs.openstack.org/developer/manila/devref/capabilities_and_extra_specs.html?highlight=extra%20specs#common-capabilities>`_ tanımına göz atın)

source: Deployment considerations
tr_tr: Kurulum etmenleri

source: Design
tr_tr: Tasarım

source: Design a Layer-3 network architecture rather than a layer-2 network architecture.
tr_tr: Katman-2 ağ mimarisindense katman-2 ağ mimarisi tasarlayın.

source: Design a dense multi-path network core to support multi-directional scaling and flexibility.
tr_tr: Çok yönlü ölçeklenebilirlik ve esneklik sağlamak için yoğun çok yollu bir ağ tasarlayın.

source: Design for cost efficient operations to take advantage of massive scale.
tr_tr: Büyük ölçekten faydalanabilmek için uygun maliyetli işlemler tasarlayın.

source: Design model
tr_tr: Tasarım modeli

source: Designing an OpenStack cloud requires a understanding of the cloud user's requirements and needs to determine the best possible configuration. This chapter provides guidance on the decisions you need to make during the design process.
tr_tr: OpenStack bulutu tasarlamak bulut kullanıcılarının ihtiyaçlarının anlaşılmasını ve en iyi uygun yapılandırmayı anlamayı gerektirir. Bu bölüm tasarım sürecinde almanız gereken kararlar için yönlendirme sağlar.

source: Designing an OpenStack network
tr_tr: Bir OpenStack ağı tasarlama

source: Determine if the use case has consistent or highly variable latency.
tr_tr: Kullanım durumunun sürekli veya yüksek değişkenlikte gecikmesi olup olmadığını belirleyin.

source: Determine the most effective configuration for block storage network.
tr_tr: Blok depolama ağı için en etkin yapılandırmaya karar verin.

source: Determine the requirements for the cloud prior to constructing the cloud, and plan for hardware lifecycles, and expansion and new features that may require different hardware.
tr_tr: Bulutu inşa etmeden önce bulut gereksinimlerini göz önüne alın, yeni donanım gerektirebilecek yeni özellikleri, donanım yaşam döngüleri ve genişleme için plan yapın.

source: Determine the security policy of your organization and understand the data sovereignty of your cloud geography and plan accordingly.
tr_tr: Kurumunuzun güvenlik ilkesine karar verin ve bulut coğrafyanızın veri hakimiyetini anlayarak buna göre plan yapın.

source: Determining the maximum *write* IOPS is a little different because most administrators configure disk replication using RAID and since the RAID controller requires IOPS itself, there is a write penalty. The severity of the write penalty is determined by the type of RAID used.
tr_tr: Azami *yazma* IOPS'u biraz farklıdır çünkü çoğu yönetici disk yedeklemeyi RAID kullanarak yapar ve RAID kontrolcüsü de IOPS'a ihtiyaç duyduğundan, bir yazma verimsizliği olur. Bu verimsizliğin seviyesi kullanılan RAID türüne göre belirlenir.

source: Development cloud
tr_tr: Geliştirici bulutu

source: Differences between storage types
tr_tr: Depolama türleri arasındaki farklar

source: Disaster recovery and business continuity
tr_tr: Felaktten kurtulma ve işin devamlılığı

source: Disks selected for object storage services do not need to be fast performing disks. We recommend that object storage nodes take advantage of the best cost per terabyte available for storage. Contrastingly, disks chosen for block storage services should take advantage of performance boosting features that may entail the use of SSDs or flash storage to provide high performance block storage pools. Storage performance of ephemeral disks used for instances should also be taken into consideration.
tr_tr: Nesne depolama servisleri için seçilen disklerin hızlı başarıma sahip olması gerekmez. Nesne depolama düğümlerinin terabayt başına en iyi fiyata sahip disklerden faydalanmalarını öneriyoruz. Buna ters olarak blok depolama servisleri için seçilen diskler blok depolama havuzları için SSD veya flash depolama gerektiren başarım artırma özelliklerine sahip disklerden seçilmelidir. Sunucular için kullanılan geçici disklerin depolama başarımı da göz önüne alınmalıdır.

source: Do I need block storage?
tr_tr: Blok depolamaya ihtiyacım var mı?

source: Do I need file-based storage?
tr_tr: Dosya tabanlı depolamaya ihtiyacım var mı?

source: Do I need more than one storage choice? Do I need tiered performance storage?
tr_tr: Birden fazla depolama seçimine ihtiyacım var mı? Sıralı başarım depolamaya ihtiyacım var mı?

source: Do I need object storage?
tr_tr: Nesne depolamaya ihtiyacım var mı?

source: Do I need to support live migration?
tr_tr: Canlı göçü desteklemem gerekiyor mu?

source: Do my workloads have IOPS requirements?
tr_tr: İş yüklerimin IOPS gereksinimi var mı?

source: Does it include tools to help troubleshoot and resolve performance issues?
tr_tr: Başarım sorunlarını gidermek ve çözmek için yardımcı araçlar içeriyor mu?

source: Does your authentication system also verify externally?
tr_tr: Kimlik doğrulama sisteminiz harici de çalışıyor mu?

source: Due to the amount of logs being sent from servers in the OpenStack environment, an optional in-memory data structure store can be used. Common examples are Redis and Memcached. In newer versions of Elastic Stack, a file buffer called `Filebeat <https://www.elastic.co/products/beats/filebeat>`_ is used for a similar purpose but adds a "backpressure-sensitive" protocol when sending data to Logstash or Elasticsearch.
tr_tr: OpenStack ortamında sunuculardan gönderilen günlük kayıtlarının miktarı sebebiyle isteğe bağlı bir hafızada veri yapısı depolama kullanılabilir. Redis ve Memcached yaygın örneklerdir. Elastic Stack'in yeni sürümlerinde `Filebeat <https://www.elastic.co/products/beats/filebeat>`_ isimli dosya ara belleği benzer amaçlı kullanılır ama veriyi Logstash veya Elasticsearch'e gönderirken arka basınca duyarlı bir iletişim kuralı ekler.

source: Dynamic resource expansion or bursting
tr_tr: Dinamik kaynak genişletme ya da patlama

source: Each Object Storage zone should be self-contained within its own availability zone. Each availability zone should have independent access to network, power, and cooling infrastructure to ensure uninterrupted access to data. In addition, a pool of Object Storage proxy servers providing access to data stored on the object nodes should service each availability zone. Object proxies in each region should leverage local read and write affinity so that local storage resources facilitate access to objects wherever possible. We recommend deploying upstream load balancing to ensure that proxy services are distributed across the multiple zones and, in some cases, it may be necessary to make use of third-party solutions to aid with geographical distribution of services.
tr_tr: Her bir Nesne Depolama bölgesi kendi kullanılırlık bölgesinde kullanılabilir olmalıdır. Veriye kesintisiz erişim için her kullanılabilirlik bölgesinin ağ, güç ve soğutma alt yapısına bağımsız erişimi olmalıdır. Ek olarak her bir kullanılırlık bölgesine nesne düğümlerinde saklanan veriye erişim sağlayan Nesne Depolama vekil sunucuları havuzu servis vermelidir. Her bölümdeki nesne vekilleri yerel okuma ve yazma benzerliği eğiliminde olmalıdır böylece yerel depolama kaynakları nesnelere uygun olunan her yerde erişimi kolaylaştırır. Vekil servislerin birden çok bölgede dağıtıldığından emin olmak için yukarı akış yük dengeleme kurmanızı öeriyoruz, bazı durumlarda servislerin coğrafi olarak dağıtımı için üçüncü taraf çözümlere ihtiyaç duyulabilir.

source: Each host can have different storage profiles for hosts aggregation and availability zones.
tr_tr: Her sunucu sunucu takımı ve kullanılırlık bölgeleri için farklı depolama profillerine sahip olabilir.

source: East/West - The internal traffic flow between workload within the cloud as well as the traffic flow between the compute nodes and storage nodes falls into the East/West category. Generally this is the heaviest traffic flow and due to the need to cater for storage access needs to cater for a minimum of hops and low latency.
tr_tr: Doğu/Batı - Bulut içindeki iş yüklerinin dahili trafik akışı ve hesaplama düğümleri ile depolama düğümleri arasındaki trafik akışı Doğu/Batı kategorisine girer. Genellikle bu en ağır trafik akışıdır ve depolama erişimi gereksinimi için temin edilmesi gereken asgari adım ve düşük gecikme temin edilmelidir.

source: Edge
tr_tr: Kenar

source: Elastic Stack consists of mainly three components: Elasticsearch (log search and analysis), Logstash (log intake, processing and output) and Kibana (log dashboard service).
tr_tr: Elastic Stack temelde üç bileşenden oluşur. Elasticsearch (kayıt arama ve analiz), Logstash (kayıt alımı, işleme ve çıktı) ev Kibana (kayıt kontrol paneli servisi).

source: Eliminating single points of failure in a multi-region design
tr_tr: Birden çok bölgeli tasarımda tek kırılma noktasını eleme

source: Eliminating single points of failure within each site
tr_tr: Tüm konumlarda kırılma noktalarının elenmesi

source: Enables users to submit API calls to OpenStack services through commands.
tr_tr: Kullanıcıların komutlar aracılığıyla OpenStack servislerine API çağrıları göndermelerini etkinleştirir.

source: Encryption configuration
tr_tr: Şifreleme yapılandırması

source: Ensure that the network structure connects all clouds to form an integrated system. Also consider the state of handoffs which must be reliable and have minimal latency for optimal performance of the system.
tr_tr: Ağ yapısının tümleşik bir sistem oluşturmak için bağlandığından emin olun. Ayrıca sistemin başarımı için asgari gecikmeye sahip olması gereken elde tutulanlara da dikkat edin.

source: Ensure that the physical data center provides the necessary power for the selected network hardware.
tr_tr: Fiziksel veri merkezinin seçilen ağ donanımı için gerekli gücü sağladığından emin olun.

source: Ensure that the selected logging, monitoring, or alerting tools support the proposed OS-hypervisor combination.
tr_tr: Seçili günlükleme, izleme, ve uyarı araçlarının teklif edilen OS-hipervizör katışımını desteklediğinden emin olun.

source: Ensure that the storage solution throughput is optimized for your application requirements.
tr_tr: Depolama çözümü işlem hacminin uygulama gereksinimlerinize göre ayarlandığından emin olun.

source: Ensure that there is no single point of failure in the cloud ecosystem.
tr_tr: Bulut ekosisteminde tek bir kırılma noktası olmadığından emin olun.

source: Ensure that your messaging queue handles requests successfully and size accordingly.
tr_tr: İleti kuyruğunuzun istekleri başarıyla aldığından emin olun duruma göre boyutlandırın.

source: Ensure the connectivity matches the storage solution requirements. We recommend confirming that the network characteristics minimize latency to boost the overall performance of the design.
tr_tr: Bağlantının depolama çözümü gereksinimleriyle eşleştiğinden emin olun. Ağ karakteristiğinin tasarımın genel başarımını artıracak şekilde gecikmeleri en aza indirdiğinden emin olmanızı öneriyoruz.

source: Enterprise requirements
tr_tr: Kurumsal gereksinimler

source: Ephemeral storage
tr_tr: Geçici depolama

source: Ephemeral storage - If you only deploy OpenStack :term:`Compute service (nova)`, by default your users do not have access to any form of persistent storage. The disks associated with VMs are ephemeral, meaning that from the user's point of view they disappear when a virtual machine is terminated.
tr_tr: Geçici depolama - Yalnızca OpenStack :term:`Hesaplama servisi (nova)` kurarsanız, öntanımlı olarak kullanıcılarınız herhangi bir kalıcı depolama biçimine sahip olmaz. Sanal makineler ile ilişkili diskler geçicidir, yani kullanıcı bakış açısıyla sanal makine kapandığında ortadan kaybolurlar.

source: Error reporting has received some attention in Mitaka and Newton but there are improvements needed.
tr_tr: Mitaka ve Newton'da hata raporlama biraz daha ilgi gördü ama iyileştirmelere hala ihtiyaç var.

source: Ethernet frames can carry any kind of packet. Networking at layer-2 is independent of the layer-3 protocol.
tr_tr: Ethernet çerçeveleri her tür paketi taşıyabilir. Katman-2 ağı katman-3 iletişim kurallarından bağımsızdır.

source: Ethernet frames contain all the essentials for networking. These include, but are not limited to, globally unique source addresses, globally unique destination addresses, and error control.
tr_tr: Ethernet çerçeveleri ağ için tüm esasları içerir. Bunlar benzersiz kaynak adresleri, benzersiz hedef adresleri ve hata kontrolünü ve fazlasını içerir.
