Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: Network functions is a broad category but encompasses workloads that support the rest of a system's network. These workloads tend to consist of large amounts of small packets that are very short lived, such as DNS queries or SNMP traps. These messages need to arrive quickly and do not deal with packet loss as there can be a very large volume of them. There are a few extra considerations to take into account for this type of workload and this can change a configuration all the way to the hypervisor level. For an application that generates 10 TCP sessions per user with an average bandwidth of 512 kilobytes per second per flow and expected user count of ten thousand concurrent users, the expected bandwidth plan is approximately 4.88 gigabits per second.
tr_tr: Ağ işlevleri geniş bir kategori ama bir sistemin ağının geri kalanını destekleyen iş yüklerini kapsar. Bu iş yükleri çok sayıda kısa ömürlü küçük paketten oluşma eğilimindedir, örneğin DNS sorguları ya da SNMP tuzakları gibi. Bu iletiler çabukça gelmelidir ve paket kaybıyla ilgilenmezler çünkü çok sayıdadırlar. Bu tür iş yükü için hesaba katılması gereken bir kaç ek etmen de bulunur ve bu yapılandırmayı hipervizör seviyesine kadar değiştirebilir. Kullanıcı başına 10 TCP oturumu üreten, saniyede 512 kilobayt ortalama bant genişliği olan, aynı anda on bin beklenen kullanıcısı olan bir uygulama için beklenen bant genişliği planı saniyede 4.88 gigabittir.

source: Network hardware
tr_tr: Ağ donanımı

source: Network hardware requirements
tr_tr: Ağ donanım gereksinimleri

source: Network level tuning for this workload is minimal. :term:`Quality of Service (QoS)` applies to these workloads for a middle ground Class Selector depending on existing policies. It is higher than a best effort queue but lower than an Expedited Forwarding or Assured Forwarding queue. Since this type of application generates larger packets with longer-lived connections, you can optimize bandwidth utilization for long duration TCP. Normal bandwidth planning applies here with regards to benchmarking a session's usage multiplied by the expected number of concurrent sessions with overhead.
tr_tr: Bu iş yükü için Ağ seviyesi ayarlama asgaridir. :term:`Servis Kalitesi (QoS)` bu iş yüklerine bir orta nokta Sınıf Seçici için mevcut ilkelere göre uygulanır. En iyi çaba kuyruğundan daha yüksektir ama Hızlandırılmış Yönlendirme veya Garantili Yönlendirme kuyruğundan düşüktür. Bu tür bir uygulama uzun zaman alan bağlantıları olan büyük paketler ürettiğinden, bant genişliğini uzun süreli TCP ile kullanabilirsiniz. Normal bant genişliği planlama bir oturumun kullanımını değerlendirme deneyi yaparak beklenen aynı andaki oturum sayısını abonelik aşımını ekleyip çarparak kullanılabilir.

source: Network misconfigurations
tr_tr: Ağ bozuk yapılandırmaları

source: Network redundancy protocols
tr_tr: Ağ yedeklilik iletişim kuralları

source: Network software requirements
tr_tr: Ağ yazılım gereksinimleri

source: Network tuning
tr_tr: Ağ ayarlama

source: Network uptime guarantees affecting switch design, which might require redundant switching and power.
tr_tr: Ağ çalışma zamanı anahtar tasarımını etkiler, bu da yedekli anahtarlama ve güç anlamına gelir.

source: Network virtual function cloud
tr_tr: Ağ sanal işlev bulutu

source: Network zones
tr_tr: Ağ bölgeleri

source: Network-focused cloud examples
tr_tr: Ağ vurgulu bulut örnekleri

source: Network:
tr_tr: Ağ:

source: Networking
tr_tr: Ağ

source: Networking at large scales becomes a set of boundary questions. The determination of how large a layer-2 domain must be is based on the number of nodes within the domain and the amount of broadcast traffic that passes between instances. Breaking layer-2 boundaries may require the implementation of overlay networks and tunnels. This decision is a balancing act between the need for a smaller overhead or a need for a smaller domain.
tr_tr: Büyük ölçekte ağ düşünüldüğünde bu sınırsal sorulara dönüşür. Bir katman-2 alanın ne kadar geniş olacağını tanımlamak alandaki düğüm sayısı ve sunucular arasında geçen yayım trafiğinin miktarına bağlıdır. Katman-2 sınırların aşılması üst katman ağların veya tünellerin uygulanmasını gerektirebilir. Seçim daha küçük yük veya daha küçük alan arasında dengeleme hareketidir.

source: Networking at the frame level says nothing about the presence or absence of IP addresses at the packet level. Almost all ports, links, and devices on a network of LAN switches still have IP addresses, as do all the source and destination hosts. There are many reasons for the continued need for IP addressing. The largest one is the need to manage the network. A device or link without an IP address is usually invisible to most management applications. Utilities including remote access for diagnostics, file transfer of configurations and software, and similar applications cannot run without IP addresses as well as MAC addresses.
tr_tr: Çerçeve seviyesinde bir ağ paket seviyesinde IP adreslerinin varlığı hakkında hiçbir şey söylemez. LAN anahtarlarından oluşan bir ağdaki neredeyse tüm bağlantı noktaları, bağlantılar, ve aygıtlar ve tüm kaynak ve hedef sunucular da IP adreslerine sahiptir. IP adreslemeye olan sürekli ihtiyaç için bir çok sebep bulunur. En büyüğü ağın yönetimidir. IP adresi olmayan bir bağlantı veya aygıt genellikle çoğu yönetim uygulaması için görünmezdir. Sorun giderme için uzaktan erişim araçları, yapılandırma ve yazılımların dosya transferi, ve benzer uygulamalar IP adresleri ve MAC adresleri olmadan çalışamazlar.

source: Networking concepts
tr_tr: Ağ kavramları

source: Networking resources
tr_tr: Ağ kaynakları

source: Networking security policy requirements.
tr_tr: Ağ güvenlik ilkesi gereksinimleri.

source: Networking service (neutron)
tr_tr: Ağ servisi (neutron)

source: Next answer the following:
tr_tr: Ardından şunları yanıtlayın:

source: No need to keep track of address configuration as systems move around.
tr_tr: Sistemler hareket ettiklerinden adres yapılandırmalarını takip etmeye gerek yok.

source: No predefined usage model
tr_tr: Ön tanımlı kullanım modeli yok

source: Non-compute node based shared file system
tr_tr: Hesaplama dışı düğüm tabanlı paylaşımlı dosya sistemi

source: Non-standard features
tr_tr: Standart olmayan özellikler

source: North/South - The flow of traffic between the workload and all external networks, including clients and remote services. This traffic flow is highly dependant on the workload within the cloud and the type of network services being offered.
tr_tr: Kuzey/Güney - İş yükü ile tüm harici ağlar arasındaki trafik akışıdır, buna istemciler ve uzak servisler dahildir. Bu trafik akışı bulut içindeki iş yükü türüne ve teklif edilen ağ servislerinin türüne bağlıdır.

source: Not yet available
tr_tr: Henüz kullanılabilir değil

source: Now that you see the myriad designs for controlling your cloud, read more about the further considerations to help with your design decisions.
tr_tr: Bulutunuz yapılandırmak için sayısız tasarım gördüğünüze göre, tasarım kararlarınızda yardımcı olması için diğer etmenler hakkında okuyun.

source: Number of VLANs is limited to 4096.
tr_tr: VLAN sayısı 4096 ile sınırlıdır.

source: Number of physical cores
tr_tr: Fiziksel çekirdek sayısı

source: Number of virtual cores per instance
tr_tr: Sunucu başına sanal çekirdek sayısı

source: OR
tr_tr: VEYA

source: OS-hypervisor combination
tr_tr: OS-hipervizör katışımı

source: Object
tr_tr: Nesne

source: Object Storage frequent communicates among servers hosting data. Even a small cluster generates megabytes per second of traffic.
tr_tr: Nesne Depolama veri sunan sunucular arasında sıklıkla iletişim kurar. Küçük bir küme bile saniyede megabaytlarca trafik üretir.

source: Object storage
tr_tr: Nesne depolama

source: Object storage is implemented in OpenStack by the Object Storage service (swift). Users access binary objects through a REST API. If your intended users need to archive or manage large datasets, you should provide them with Object Storage service. Additional benefits include:
tr_tr: OpenStack'de nesne depolama Nesne Depolama servisi (swift) ile uygulanır. Kullanıcılar ikilik nesnelere REST API ile erişirler. Kullanıcılarınızın büyük veri kümeleri arşivlemesi veya yönetmesi gerekecekse onlara Nesne Depolama servisi sunmalısınız. Ek faydaları şunlardır:

source: Object storage resource nodes have no requirements for hardware fault tolerance or RAID controllers. It is not necessary to plan for fault tolerance within the object storage hardware because the object storage service provides replication between zones as a feature of the service. Block storage nodes, compute nodes, and cloud controllers should all have fault tolerance built in at the hardware level by making use of hardware RAID controllers and varying levels of RAID configuration. The level of RAID chosen should be consistent with the performance and availability requirements of the cloud.
tr_tr: Nesne depolama kaynak düğümlerinin donanım arızası dayanıklılığına veya RAID kontrolcülerine ihtiyacı yoktur. Nesne depolama donanımı içinde arıza dayanıklılığı için plan yapmaya gerek yoktur çünkü nesne depolama servisi bir servis özelliği olarak bölgeler arası yedekleme sağlar. Blok depolama düğümleri, hesaplama düğümleri, ve bulut kontrolcüleri çeşitli seviyelerde RAID yapılandırmaları ve donanım seviyesinde RAID kontrolcüleri kullanarak arıza dayanıklılığına sahip olmak zorundadırlar. Seçilen RAID seviyesi bulut gereksinimleriyle başarım ve kullanılırlık açısından uyuşmalıdır.

source: Off compute node storage—shared file system
tr_tr: Hesaplama dışı düğüm deposu—paylaşımlı dosya sistemi

source: Offers each service's REST API access, where the API endpoint catalog is managed by the Identity service
tr_tr: Her bir servisin REST API erişimini sunar, API uç nokta kataloğu Kimlik servisi tarafından yönetilir

source: On compute node storage—nonshared file system
tr_tr: Hesaplama düğüm depolama—paylaşımsız dosya sistemi

source: On compute node storage—shared file system
tr_tr: Hesaplama düğüm depolama-paylaşımlı dosya sistemi

source: On each host that will house block storage, an administrator must initially create a volume group dedicated to Block Storage volumes. Blocks are created from LVM logical volumes.
tr_tr: Blok depolamayı barındıracak her sunucuda, bir yönetici ilk önce Blok Depolama birimlerine adanmış bir birim grubu oluşturmalıdır. Bloklar LVM mantıksal birimlerinden oluşturulur.

source: On the other hand, a scale-out storage solution that uses direct-attached storage (DAS) in the servers may be an appropriate choice. This requires configuration of the server hardware to support the storage solution.
tr_tr: Diğer yandan, sunucularda doğrudan eklemeli depolama (DAS) kullanan bir dışa ölçek çözümü uygun seçim olabilir. Bu sunucu donanımının depolama çözümünü destekleyecek şekilde yapılandırılmasını gerektirir.

source: On-demand and self-service application
tr_tr: İstek halinde ve kendine servis uygulamalar

source: Once a configuration is complete, Kibana can be used as a visualization tool for OpenStack and system logging. This will allow operators to configure custom dashboards for performance, monitoring and security.
tr_tr: Yapılandırma tamamlandığında Kibana OpenStack ve sistem kayıtları için görselleştirme aracı olarak kullanılabilir. Bu işletmenlere başarım, izleme ve güvenlik için özel kontrol panelleri yapılandırma izni verir.

source: One choice that always comes up is whether to virtualize. Some services, such as ``nova-compute``, ``swift-proxy`` and ``swift-object`` servers, should not be virtualized. However, control servers can often be happily virtualized—the performance penalty can usually be offset by simply running more of the service.
tr_tr: Hep akla gelen bir seçenek de sanallaştırmanın yapılıp yapılmayacağıdır. ``nova-compute``, ``swift-proxy`` ve ``swift-object`` sunucuları gibi bazı servisler sanallaştırılmamalıdır. Ancak kontrol sunucuları rahatlıkla sanallaştırılabilir—başarım düşüklüğü genellikle servisten birden fazla çalıştırılarak giderilebilir.

source: One of the most important networking topics today is the exhaustion of IPv4 addresses. As of late 2015, ICANN announced that the final IPv4 address blocks have been fully assigned. Because of this, IPv6 protocol has become the future of network focused applications. IPv6 increases the address space significantly, fixes long standing issues in the IPv4 protocol, and will become essential for network focused applications in the future.
tr_tr: Bugünlerde ağ başlıklarından en önemlisi IPv4 adreslerinin bitiyor oluşu. 2015 sonuna doğru, ICANN son IPv4 adres bloklarının da atandığını açıkladı. Bu sebeple, ağ odaklı uygulamalar için gelecek IPv6 iletişim kuralı. IPv6 iletişim kuralı adres uzayını kat kat artırır, IPv4 ile uzun zamandır var olan sorunları düzeltir, ve gelecekte ağ odaklı uygulamalar için gerekli olacaktır.

source: One potential solution to this problem is the implementation of storage systems designed for performance. Parallel file systems have previously filled this need in the HPC space and are suitable for large scale performance-orientated systems.
tr_tr: Bu probleme muhtemel bir çözüm başarım için tasarlanmış depolama sistemlerinin uygulanmasıdır. Paralel dosya sistemleri daha önceleri bu ihtiyacı HPC alanında doldurdu ve büyük ölçekli başarım eksenli sistemler için uygundur.

source: One zone per node
tr_tr: Düğüm başına bir bölge

source: Ongoing maintenance operations are made much simpler if there is logical and physical separation of Data Plane and Control Plane systems. It then becomes possible to, for example, reboot a controller without affecting customers. If one service failure affects the operation of an entire server (``noisy neighbor``), the separation between Control and Data Planes enables rapid maintenance with a limited effect on customer operations.
tr_tr: Veri Düzlemi ve Kontrol Düzlemi sistemleri arasında mantıksal ve fiziksel ayrım varsa devam eden bakım işlemleri çok daha basit olur. Ardından örneğin bir kontrol birimini müşterileri etkilemeden yeniden başlatmak mümkün olur. Bir servisin bozulması tüm sunucunun işlemini etkilerse (``gürültülü komşu``), Kontrol ve Veri Düzlemlerinin ayrı olması müşteri işlemleri üstünden sınırlı bir etki ile hızlıca bakım yapılmasını sağlar.

source: OpenStack Architecture Design Guide
tr_tr: OpenStack Mimari Tasarım Kılavuzu

source: OpenStack Block Storage (cinder)
tr_tr: OpenStack Blok Depolama (cinder)

source: OpenStack Block Storage for use by compute instances, requiring persistent storage (such as databases for dynamic sites).
tr_tr: Hesaplama sunucuları tarafından kullanılmak üzere kalıcı depolama gerektiren (dinamik siteler için veritabanları gibi) OpenStack Blok Depolama.

source: OpenStack Compute (nova)
tr_tr: OpenStack Hesaplama (nova)

source: OpenStack Compute running KVM hypervisor
tr_tr: KVM hipervizörünü çalıştıran OpenStack Hesaplama

source: OpenStack Compute uses an SQL database to store and retrieve stateful information. MySQL is the popular database choice in the OpenStack community.
tr_tr: OpenStack Hesaplama durum bilgisini kaydetmek ve almak için bir SQL veritabanı kullanır. OpenStack topluluğu araında popüler seçim MySQL'dir.

source: OpenStack Controller service running Image service, Identity service, Networking service, combined with support services such as MariaDB and RabbitMQ, configured for high availability on at least three controller nodes.
tr_tr: En az üç kontrol düğümünde yüksek kullanılırlık için yapılandırılmış, MariaDB ve RabbitMQ gibi destek servisleri ile İmaj servisi, Kimlik servisi, Ağ servisi karışımını çalıştıran OpenStack Kontrol servisi.

source: OpenStack Controller services (Image service, Identity service, Networking service, and supporting services such as MariaDB and RabbitMQ)
tr_tr: OpenStack Kontrol sevisleri (İmaj servisi, Kimlik servisi, Ağ servisi, ve MariaDB ve RabbitMQ gibi destekleyen servisler)

source: OpenStack Identity provides authentication decisions and user attribute information, which is then used by the other OpenStack services to perform authorization. The policy is set in the ``policy.json`` file. For information on how to configure these, see `Managing Projects and Users <https://docs.openstack.org/ops-guide/ops-projects-users.html>`_ in the OpenStack Operations Guide.
tr_tr: OpenStack Kimlik kimlik doğrulama kararlarını ve kullanıcı özniteliği bilgisini sağlar, bu da diğer OpenStack servislerinin yetkilendirme yapmasında kullanılır. İlke ``policy.json`` dosyasında ayarlanır. Bunların nasıl yapılandırılacağıyla ilgili daha fazla bilgi için OpenStack İşlem Kılavuzundaki `Proje ve Kullanıcı Yönetimine <https://docs.openstack.org/ops-guide/ops-projects-users.html>`_ göz atın.

source: OpenStack Identity supports different plug-ins for authentication decisions and identity storage. Examples of these plug-ins include:
tr_tr: OpenStack Kimlik kimlik doğrulama kararları ve kimlik depolama için farklı eklentileri destekler. Bu eklentilere örnek verecek olursak:

source: OpenStack Logical Architecture
tr_tr: OpenStack Mantıksal Mimarisi

source: OpenStack Networking (neutron) is the component of OpenStack that provides the Networking service API and a reference architecture that implements a Software Defined Network (SDN) solution.
tr_tr: OpenStack Ağı (neutron) Ağ servisi API'si ve bir Yazılımla Tanımlanmış Ağ (SDN) çözümü uygulayan mimariye başvurudan oluşan OpenStack bileşenidir.

source: OpenStack Networking (neutron) provides a wide variety of networking services for instances. There are many additional networking software packages that can be useful when managing OpenStack components. Some examples include:
tr_tr: OpenStack Ağı (neutron) sunucular için geniş çeşitlilikte ağ servisleri sunar. OpenStack bileşenlerini yönetirken kullanışlı olabilecek bir çok ek ağ yazılım paketi bulunur. Bazı örnekler:

source: OpenStack Networking can be used to control hardware load balancers through the use of plug-ins and the Networking API. This allows users to control hardware load balance pools and instances as members in these pools, but their use in production environments must be carefully weighed against current stability.
tr_tr: OpenStack Ağı eklentiler ve Ağ API'si kullanılarak donanımsal yük dengeleyicileri kontrol etmek için kullanılabilir. Bu kullanıcılara donanımsal yük dengeleyici havuzlarını ve bu havuzların üyleri olan sunucuları kontrol etme olasılığı sağlar, ama üretim ortamlarında kullanımları mevcut kararlılığa göre değerlendirilmelidir.

source: OpenStack Networking, when configured for it, supports IPv6. To enable IPv6, create an IPv6 subnet in Networking and use IPv6 prefixes when creating security groups.
tr_tr: OpenStack Ağı, yapılandırıldığında IPv6 destekler. IPv6'yı etkinleştirmek için, Ağ kısmında bir IPv6 alt ağı oluşturun ve güvenlik grupları oluştururken IPv6 ön ekleri kullanın.

source: OpenStack Object Storage
tr_tr: OpenStack Nesne Depolama

source: OpenStack Object Storage (swift)
tr_tr: OpenStack Nesne Depolama (swift)

source: OpenStack Object Storage for serving static objects (such as images).
tr_tr: Statik nesneleri sunmak için OpenStack Nesne Depolama (imajlar gibi).

source: OpenStack Shared File System Storage (manila)
tr_tr: OpenStack Paylaşımlı Dosya Sistemi Depolama (manila)

source: OpenStack allows you to overcommit CPU and RAM on compute nodes. This allows you to increase the number of instances running on your cloud at the cost of reducing the performance of the instances. The Compute service uses the following ratios by default:
tr_tr: OpenStack hesaplama düğümlerinde CPU ve RAM için abonelik aşımına izin verir. Bu da sunucuların başarımını düşürmek pahasına bulutunuzda çalışan sunucu sayısını artırmanızı sağlar. Hesaplama servisi öntanımlı olarak şu oranları kullanır:

source: OpenStack can store your virtual machine (VM) images inside of an Object Storage system, as an alternative to storing the images on a file system.
tr_tr: İmajlarınızı bir dosya sisteminde saklamak yerine OpenStack sanal makine (VM) imajlarınızı Nesne Depolama sistemi içinde saklar.

source: OpenStack clouds do not present file-level storage to end users. However, it is important to consider file-level storage for storing instances under ``/var/lib/nova/instances`` when designing your cloud, since you must have a shared file system if you want to support live migration.
tr_tr: OpenStack bulutlar kullanıcılara dosya seviyesinde depolama sunmazlar. Ancak, bulutunuzu tasarlarken canlı göçü desteklemek istiyorsanız paylaşımlı dosya sisteminiz olması gerektiğinden ``/var/lib/nova/instances`` altında sunucularınız saklamak için dosya seviyesinde depolamayı göz önünde bulundurun.

source: OpenStack clouds explicitly support three types of persistent storage: *Object Storage*, *Block Storage*, and *File-based storage*.
tr_tr: OpenStack bulutları üç tür kalıcı depolamayı açıkça destekler: *Nesne Depolama*, *Blok Depolama*, ve *Dosya tabanlı depolama*.

source: OpenStack clouds require appropriate monitoring platforms to identify and manage errors.
tr_tr: OpenStack bulutları hataları tanımlamak ve yönetmek için uygun izleme platformları gerektirir.

source: OpenStack compute nodes running the KVM hypervisor.
tr_tr: KVM hipervizörünü çalıştıran OpenStack hesaplama düğümleri.

source: OpenStack design, generally, does not include shared storage. However, for some high availability designs, certain components might require it depending on the specific implementation.
tr_tr: OpenStack tasarımı genel olarak paylaşımlı depolama içermez. Ancak, bazı yüksek kullanılırlık tasarımları için bazı bileşenlerin duruma özel uygulamalar üzere ihtiyacı olabilir.

source: OpenStack does not currently provide DNS services, aside from the dnsmasq daemon, which resides on ``nova-network`` hosts. You could consider providing a dynamic DNS service to allow instances to update a DNS entry with new IP addresses. You can also consider making a generic forward and reverse DNS mapping for instances' IP addresses, such as ``vm-203-0-113-123.example.com.``
tr_tr: OpenStack ``nova-network`` sunucularında barınan dnsmasq artalan işi dışında şu an DNS servisleri sağlamıyor. Sunucuların yeni IP adresleriyle DNS girdilerini güncellemesini sağlamak için dinamik DNS servisi sağlamayı düşünebilirsiniz. Ayrıca sunucuların IP adresleri için genel bir ileri ve geri DNS eşleştirmesi yapmak isteyebilrisiniz, örneğin ``vm-203-0-113-123.ornek.com.``

source: OpenStack has integration with Hadoop to manage the Hadoop cluster within the cloud. The following diagram shows an OpenStack store with a high performance requirement:
tr_tr: OpenStack Hadoop kümesini bulutta yönetmeyi sağlamak için Hadoop tümleştirmesine sahiptir. Aşağıdaki çizim yüksek başarım gereksinimli bir OpenStack deposunu gösterir:

source: OpenStack input, output and filter examples can be found at https://github.com/sorantis/elkstack/tree/master/elk/logstash.
tr_tr: OpenStack girdi, çıktı ve süzme örnekleri https://github.com/sorantis/elkstack/tree/master/elk/logstash adresinde bulunabilir.
