Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: Here are some other factors to consider when selecting hardware for your compute servers.
tr_tr: Hesaplama sunucularınız için donanım seçerken göz önüne almanız gereken diğer etmenler şöyle.

source: High availability
tr_tr: Yüksek kullanılırlık

source: High availability architecture to meet customer SLA requirements.
tr_tr: Müşteri SLA gereksinimlerini karşılamak için yüksek kullanılırlıklı mimari.

source: High availability implementations vary in functionality and design. Examples of some common methods are active-hot-standby, active-passive, and active-active. Development of high availability and test frameworks is necessary to insure understanding of functionality and limitations.
tr_tr: Yüksek kullanılırlık uygulamaları işlevsellik ve tasarımda değişiklik gösterir. Genelde kullanılan yöntemlerden bazılarına örnek olarak etkin-sıcak-bekleme, etkin-pasif ve etkin-etkin gösterilebilir. İşlevsellik ve sınırlamaları iyi anlamak için yüksek kullanılırlık ve deneme çatılarının geliştirilmesi gereklidir.

source: High performance database
tr_tr: Yüksek başarımlı veritabanı

source: High performance database with Database service
tr_tr: Veritabanı servisiyle yüksek başarımlı veritabanı

source: High performance systems have SLA requirements for a minimum quality of service with regard to guaranteed uptime, latency, and bandwidth. The level of the SLA can have a significant impact on the network architecture and requirements for redundancy in the systems.
tr_tr: Yüksek başarım sistemleri garanti edilen hizmet süresi, gecikme ve bant genişliğiyle ilgili asgari servis kalitesi gereksinimleri için SLA'lara sahiptirler. SLA seviyesi ağ mimarisi üzerinde ve sistemlerdeki yedeklilik gereklilikleri üzerinde önemli etki sahibi olabilir.

source: Host density
tr_tr: Sunucu yoğunluğu

source: How do I manage the storage operationally?
tr_tr: Depolama işlemlerini nasıl yöneteceğim?

source: How long does a single instance run?
tr_tr: Tek bir sunucu ne kadar çalışıyor?

source: How many ``nova-api`` services do you run at once for your cloud?
tr_tr: Bulutunuz için bir kerede kaç ``nova-api`` servisi çalıştırıyorsunuz?

source: How many compute nodes will run at once?
tr_tr: Bir kerede kaç hesaplama düğümü çalışacak?

source: How many instances will run at once?
tr_tr: Bir kerede kaç sunucu çalışacak?

source: How many users will access the API?
tr_tr: Kaç kullanıcı API'ye erişecek?

source: How many users will access the dashboard versus the REST API directly?
tr_tr: REST API'nin tersine kaç kullanıcı kontrol paneline doğrudan erişecek?

source: How redundant and distributed is the storage? What happens if a storage node fails? To what extent can it mitigate my data-loss disaster scenarios?
tr_tr: Depolama ne kadar yedekli ve dağıtık? Bir depolama düğümü arızalanırsa ne olur? Veri kaybı olan felaket durumu senaryolarımı ne kadar azaltabilir?

source: How the particular storage architecture will be used is critical for determining the architecture. Some of the configurations that will influence the architecture include whether it will be used by the hypervisors for ephemeral instance storage, or if OpenStack Object Storage will use it for object storage.
tr_tr: Belirli depolama mimarisinin nasıl kullanılacağı mimarinin belirlenmesinde ciddi rol oynar. Hipervizörler tarafından geçici sunucu depolaması olarak mı, nesne depolama için OpenStack Nesne Depolama tarafından mı kullanılacağı mimariyi etkileyecek yapılandırmalardan bazılarıdır.

source: However, before choosing a storage architecture, a few generic questions should be answered:
tr_tr: Ancak, bir depolama mimarisi seçerken, bazı genel sorular yanıtlanmalıdır:

source: However, if you are more restricted in the number of physical hosts you have available for creating your cloud and you want to be able to dedicate as many of your hosts as possible to running instances, it makes sense to run compute and storage on the same machines or use an existing storage array that is available.
tr_tr: Bulutunuzu oluşturmak için kullanılabilir fiziksel sunucu sayısında kısıtlamalarınız varsa ve olabildiğince fazla sunucunuzu sunucu çalıştırmak için ayırmak istiyorsanız, hesaplama ve depolamayı aynı makinelerde kullanmak veya mevcut kullanılabilir depolama dizisini kullanmak isteyebilirsiniz.

source: However, this option has several disadvantages:
tr_tr: Ancak bu seçeneğin bir çok dezavantajı bulunur:

source: Hybrid cloud architecture enables the migration of applications between different clouds.
tr_tr: Melez bulut mimarisi uygulamaların farklı bulutlar arasında göçünü etkinleştirir.

source: Hybrid cloud designs must accommodate differences in SLAs between providers, and consider their enforceability.
tr_tr: Melez bulut tasarımları sağlayıcılar arasındaki SLA'ların farklılıklarına uyum sağlamalıdır, uygulanabilirliklerini göz önüne almalıdır.

source: Hyper-Threading is Intel's proprietary simultaneous multithreading implementation used to improve parallelization on their CPUs. You might consider enabling Hyper-Threading to improve the performance of multithreaded applications.
tr_tr: Hyper-Threading Intel'in işlemcilerinde paralelleştirmeyi iyileştirmek için kullandıkları tescilli eşzamanlı çoklu iplik uygulamasıdır. Çoklu iş ipliği ile çalışan uygulamalarda başarımı artırmak için Hyper-Threading desteğini etkinleştirmeyi düşünmelisiniz.

source: IOPS = 1 / (AverageLatency + AverageSeekTime) For example: Average Latency for Single Disk = 2.99ms or .00299 seconds Average Seek Time for Single Disk = 4.7ms or .0047 seconds IOPS = 1/(.00299 + .0047) IOPS = 130
tr_tr: IOPS = 1 / (OrtalamaGecikme + OrtalamaAramaSüresi) Örneğin: Tek Disk İçin Gecikme = 2.99ms veya .00299 saniye Tek Disk için Ortalama Arama Süresi = 4.7ms veya .0047 saniye IOPS = 1/(.00299 + .0047) IOPS = 130

source: Identity
tr_tr: Kimlik

source: If OpenStack is not set up in the right way, it is simple to have scenarios in which users are unable to contact their instances due to having only an incorrect DNS alias. Despite this, EC2 compatibility can assist users migrating to your cloud.
tr_tr: OpenStack düzgün ayarlanmamışsa, yalnızca yanlış bir DNS takma adı yüzünden kullanıcılar sunucularına erişemeyebilirler. Buna rağmen EC2 uyumluluğu kullanıcıların bulutunuza göçüne yardımcı olabilir.

source: If a compute node fails, instances are usually easily recoverable.
tr_tr: Bir hesap düğümü arızalanırsa, sunucular genellikle kolaylıkla kurtarılabilir.

source: If a compute node fails, the data associated with the instances running on that node is lost.
tr_tr: Bir hesaplama düğümü başarısız olursa, bu düğümde çalışan sunucularla ilişkili veri kaybolur.

source: If a replicator detects that a remote drive has failed, the replicator uses the ``get_more_nodes`` interface for the ring to choose an alternative node with which to synchronize. The replicator can maintain desired levels of replication in the face of disk failures, though some replicas may not be in an immediately usable location.
tr_tr: Bir çoğaltıcı uzak sürücünün arızalandığını algılarsa, çoğaltıcı halka için ``get_more_nodes`` arayüzünü kullanarak eşzamanlama yapılacak alternatif bir düğüm seçer. Çoğaltıcı disk arızaları durumunda istenen seviyede yedeklemeyi devam etirebilir, ama bazı yedekler anında kullanılabilir konumlarda olmayabilir.

source: If a significant portion of the cloud is on externally managed systems, prepare for situations where it may not be possible to make changes. Additionally, cloud providers may differ on how infrastructure must be managed and exposed. This can lead to delays in root cause analysis where a provider insists the blame lies with the other provider.
tr_tr: Bulutun büyük bölümü harici yönetilen sistemlerdeyse, değişiklik yapamayacağınız durumlar için hazırlıklı olun. Ek olarak, bulut sağlayıcılar alt yapının nasıl yönetilip ortaya çıkarılacağı konusunda farklılıklar gösterebilirler. Bu da bir sağlayıcının suçu diğer sağlayıcıya attığı durumlarda sorunun kökünü anlamada gecikmelere yol açabilir.

source: If additional storage is required, this option does not scale.
tr_tr: Ek depolama gerekirse, bu seçenek ölçeklenmez.

source: If applications running in a cloud are not cloud-aware, there should be clear measures and expectations to define what the infrastructure can and cannot support. An example would be shared storage between sites. It is possible, however such a solution is not native to OpenStack and requires a third-party hardware vendor to fulfill such a requirement. Another example can be seen in applications that are able to consume resources in object storage directly.
tr_tr: Eğer bulutta çalışan uygulamalar buluttan habersizlerse, alt yapının sağlayıp sağlayamayacağı şeyler arasında açık ölçütler olmalıdır. Konumlar arasındaki paylaşımlı depolama bir örnek olabilir. Yapmak mümkündür, ancak böyle bir çözüm OpenStack'te doğal olarak yoktur ve üçüncü şahıs bir donanım sağlayıcısının gereksinimi sağlaması gerekir. Başka bir örnek nesne depolamadan doğrudan kaynak tüketen uygulamalarda görülebilir.

source: If many users will make multiple requests, make sure that the CPU load for the cloud controller can handle it.
tr_tr: Bir çok kullanıcı bir çok istek yapacaksa, bulut kontrol biriminin işlemci yükünün bunu kaldırabileceğinden emin olun.

source: If storage protocols other than Ethernet are part of the storage solution, ensure the appropriate hardware has been selected. If a centralized storage array is selected, ensure that the hypervisor will be able to connect to that storage array for image storage.
tr_tr: Ethernet dışındaki depolama iletişim kuralları depolama çözümünün parçasıysa, uygun donanımın seçildiğinden emin olun. Merkezi bir depolama dizisi seçildiyse, hipervizörün bu depolama dizisine imaj depolama için erişebildiğinden emin olun.

source: If the cloud is initially built with near end of life, but cost effective hardware, then the performance and capacity demand of new workloads will drive the purchase of more modern hardware. With individual hardware components changing over time, you may prefer to manage configurations as stock keeping units (SKU)s. This method provides an enterprise with a standard configuration unit of compute (server) that can be placed in any IT service manager or vendor supplied ordering system that can be triggered manually or through advanced operational automations. This simplifies ordering, provisioning, and activating additional compute resources. For example, there are plug-ins for several commercial service management tools that enable integration with hardware APIs. These configure and activate new compute resources from standby hardware based on a standard configurations. Using this methodology, spare hardware can be ordered for a datacenter and provisioned based on capacity data derived from OpenStack Telemetry.
tr_tr: Bulut kullanım ömrünün sonunda, ama ucuz donanım ile kurulursa, yeni iş yüklerinin başarım ve kapasitesi daha modern donanımın alınmasını gerektirir. Bağımsız donanım bileşenlerinin zamanla değişmesiyle yapılandırmaları stok saklama birimleri (SKU) olarak yönetmeyi tercih edebilirsiniz. Bu yöntem bir kuruma herhangi bir IT servis yöneticisi veya üretici tarafından sağlanan sipariş sistemine dahil edilebilecek ve elle veya işlevsel otomasyonlarla tetiklenebilecek standart hesaplama (sunucu) yapılandırma birimi sağlar. Bu da sipariş, hazırlama, ve ek hesaplama kaynaklarının etkinleştirilmesini kolaylaştırır. Örneğin, bir çok ticari servis yönetim aracı için donanım API'leriyle tümleşimi etkinleştiren eklentiler bulunur. Bunlar standart yapılandırmalara dayanarak duran donanımdan yeni hesaplama kaynakları yapılandırır ve etkinleştirirler. Bu yöntemle, bir veri merkezi için yedek donanım sipariş verilebilir ve OpenStack Telemetrisinden gelen veriye göre hazırlanabilirler.

source: If the data store is highly changeable, the network requirements could have a significant effect on the operational cost of maintaining the sites.
tr_tr: Veri depolama çokça değişebiliyorsa, ağ gereksinimleri konumların yönetilmesinin işletme maliyetlerini çok etkileyebilir.

source: If the design incorporates more than one site, the ability to maintain object availability in both sites has significant implications on the Object Storage design and implementation. It also has a significant impact on the WAN network design between the sites.
tr_tr: Tasarım birden çok konum içeriyorsa, nesne kullanılırlığını tüm konumlarda sürdürmenin Nesne Depolama tasarımı ve kurulumunda büyük etkisi olacaktır. Ayrıca konumlar arasındaki WAN ağ tasarımında da büyük etki yaratır.

source: If the solution is a scale-out storage architecture that includes DAS, it will affect the server hardware selection. This could ripple into the decisions that affect host density, instance density, power density, OS-hypervisor, management tools and others.
tr_tr: Çözüm DAS içeren bir dışa ölçekleme depolama mimarisiyse, sunucu donanımı seçimini etkiler. Bu sunucu yoğunluğu, güç yoğunluğu, OS-hipervizör, yönetim araçları ve diğerlerini etkileyen kararların dalgalanmasına neden olur.

source: If this is the first time you are deploying a cloud infrastructure in your organization, your first conversations should be with your networking team. Network usage in a running cloud is vastly different from traditional network deployments and has the potential to be disruptive at both a connectivity and a policy level.
tr_tr: Kurumunuzda ilk bulut kurulumunuzu yapıyorsanız, yapacağınız ilk konuşma ağ takımınızla olmalıdır. Çalışan bir bulutta ağ kullanımı geleneksel ağ kurulumlarından farklıdır ve hem ilkesel hem bağlantısal seviyede yıkıcı olma potansiyeli vardır.

source: If using a storage design that includes shared access to centralized storage, ensure that this is also designed without single points of failure and the SLA for the solution matches or exceeds the expected SLA for the Data Plane.
tr_tr: Merkezi depoya paylaşımlı erişim sunan bir depolama tasarımı kullanılıyorsa, tek bir kırılma noktası olmayacak şekilde tasarlandığından, ve çözüm için SLA'nın Veri Düzlemi için beklenen SLA ile eşleştiğinden ya da daha iyi olduğundan emin olun.

source: If you are using ``nova-network`` and multi-host networking in your cloud environment, ``nova-compute`` still requires direct access to the database.
tr_tr: Bulut ortamınızda ``nova-network`` ve çoklu sunucu ağı kullanıyorsanız, ``nova-compute`` veritabanına erişim gerektirecektir.

source: If you have an OpenStack Object Storage service, we recommend using this as a scalable place to store your images. You can also use a file system with sufficient performance or Amazon S3—unless you do not need the ability to upload new images through OpenStack.
tr_tr: Bir OpenStack Nesne Depolama servisiniz varsa, bunu imajlarınızı saklamak için ölçeklenebilir bir yer olarak kullanmanızı öneririz. Yeterli başarıma sahip bir dosya sistemi veya Amazon S3'de kullanabilirsiniz—OpenStack üzerinden yeni imajlar yüklemeniz gerekmiyorsa.

source: If you plan to use live migration, we highly recommend a shared storage configuration. This allows the operating system and application volumes for instances to reside outside of the compute nodes and adds significant performance increases when live migrating.
tr_tr: Canlı göç kullanmayı planlıyorsanız, paylaşımlı depolama yapılandırmasını öneriyoruz. Bu işletim sisteminin ve sunucular için uygulama birimlerinin hesaplama düğümleri dışında durmasını sağlar ve canlı göç yaparken kayda değer başarım artışı ekler.

source: If you use separate compute and storage hosts, you can treat your compute hosts as "stateless". As long as you do not have any instances currently running on a compute host, you can take it offline or wipe it completely without having any effect on the rest of your cloud. This simplifies maintenance for the compute hosts.
tr_tr: Farklı hesaplama ve depolama sunucuları kullanıyorsanız, hesaplama sunucularınıza "durumsuz" olarak davranabilirsiniz. Bir hesaplama sunucusunda çalışan sunucularınız olmadığı sürece çevrimdışı hale getirebilir, bulutunuzu etkilemeyecek şekilde tamamen silebilirsiniz bile. Bu hesaplama sunucuları için bakım işini basitleştirir.

source: If you want to support shared-storage live migration, you need to configure a distributed file system.
tr_tr: Paylaşımlı depolama canlı göçünü desteklemek isterseniz, dağıtık bir dosya sistemi yapılandırmalısınız.

source: Image disk utilization
tr_tr: İmaj diski kullanımı

source: Image portability
tr_tr: İmaj taşınabilirliği

source: Image service for the image management
tr_tr: İmaj yönetimi için imaj servisi

source: Image-management services
tr_tr: İmaj-yönetim servisleri

source: Images
tr_tr: İmajlar

source: Implementing Block Storage
tr_tr: Blok Depolamanın Uygulanması

source: Implementing Object Storage
tr_tr: Nesne Depolamanın Uygulanması

source: In OpenStack, the infrastructure is integral to providing services and should always be available, especially when operating with SLAs. Ensuring network availability is accomplished by designing the network architecture so that no single point of failure exists. A consideration of the number of switches, routes and redundancies of power should be factored into core infrastructure, as well as the associated bonding of networks to provide diverse routes to your highly available switch infrastructure.
tr_tr: OpenStack'de alt yapı servis sağlamada ayrılmaz bir yere sahiptir ve her zaman kullanılır olmalıdır, özellikle SLA'larla işlem yapılırken. Ağ kullanılırlığından emin olmak tek bir kırılma noktasının olmadığı ağ mimarisi tasarlamakla elde edilir. Çekirdek alt yapıda anahtarların sayısı, yönlendiriciler ve gücün yedekliliği yanında rotaların yüksek kullanılırlıklı anahtar alt yapısına yönlendirilmesini sağlayan ağların bağlanması gibi ilişkiler göz önünde bulundurulmalıdır.

source: In a bin packing design, each independent resource pool provides service for specific flavors. Since instances are scheduled onto compute hypervisors, each independent node's resources will be allocated to efficiently use the available hardware. While bin packing can separate workload specific resources onto individual servers, bin packing also requires a common hardware design, with all hardware nodes within a compute resource pool sharing a common processor, memory, and storage layout. This makes it easier to deploy, support, and maintain nodes throughout their lifecycle.
tr_tr: Kutu paketleme tasarımında, her bağımsız kaynak havuzu belirli nitelikler için servis sağlar. Sunucular hesaplama hipervizörlerine zamanlandıklarından, her bağımsız düğümün kaynakları kullanılabilir donanımı etkin kullanmak üzere ayrılır. Kutu paketleme iş yüküne özel kaynakları bağımsız sunuculara dağıtabilse de, kutu paketleme genel bir donanım tasarımı gerektirir, bu tasarımda tüm donanım düğümleri genel bir işlemci, hafıza, ve depolama düzenini paylaşan hesaplama kaynak havuzundadır. Bu yaşam döngüleri süresince düğümleri kurmayı, desteklemeyi ve yönetmeyi kolaylaştırır.

source: In a cloud with significant demands on Block Storage, the network architecture should take into account the amount of East-West bandwidth required for instances to make use of the available storage resources. The selected network devices should support jumbo frames for transferring large blocks of data, and utilize a dedicated network for providing connectivity between instances and Block Storage.
tr_tr: Blok Depolamadan çokça talebi olan bir bulutta, ağ mimarisi sunucuların kullanılabilir depolama kaynaklarının kullanımı için ihtiyaç duyacakları Doğu-Batı bant genişliği miktarını hesaba katmalıdır. Seçilen ağ aygıtları büyük veri bloklarını aktarmak için jumbo çerçeveleri desteklemeli ve sunucular ve Blok Depolama arasındaki bağlantıyı kuran adanmış bir ağ kullanılmalıdır.

source: In a design with multiple regions, the SLA would also need to take into consideration the use of shared services such as the Identity service and Dashboard.
tr_tr: Birden çok bölgeden oluşan bir tasarımda, SLA Kimlik servisi ve Kontrol Paneli gibi paylaşımlı servislerin kullanımını da göz önüne almalıdır.

source: In a layer-2 network all devices are aware of all MACs, even those that belong to instances. The network state information in the backbone changes whenever an instance starts or stops. Because of this, there is far too much churn in the MAC tables on the backbone switches.
tr_tr: Katman-2 ağda tüm aygıtlar tüm MAC'lerden haberdardır, sunuculara ait olanlardan bile. Bir sunucu başladığında veya durduğunda omurgadaki ağ durum bilgisi değişir. Bunun yüzünden, omurga anahtarlarındaki MAC tablolarında çok daha fazla çalkalanma vardır.

source: In addition to the Block Storage resource nodes, it is important to design for high availability and redundancy of the APIs, and related services that are responsible for provisioning and providing access to storage. We recommend designing a layer of hardware or software load balancers in order to achieve high availability of the appropriate REST API services to provide uninterrupted service. In some cases, it may also be necessary to deploy an additional layer of load balancing to provide access to back-end database services responsible for servicing and storing the state of Block Storage volumes. It is imperative that a highly available database cluster is used to store the Block Storage metadata.
tr_tr: Blok Depolama kaynağı düğümlerine ek olarak, API'lerin yüksek kullanılırlık ve yedekliliği, ve depolamaya erişim sağlayan ve hazırlıkla görevli servisler için tasarım yapmak da önemlidir. Kesintisiz servis sağlamak için uygun REST API servislerine donanımsal veya yazılımsal yük dengeleyeciler katmanı ile erişim tasarlamanızı öneririz. Bazı durumlarda, Blok Depolama birimlerinin durumunu saklamak ve servis etmekle görevli arka uç veritabanı servislerine erişim için de ek bir yük dengeleyici katman kurmak gerekli olabilir. Blok Depolama metaverisini yüksek kullanılırlıklı bir veritabanı kümesi ile kullanmak şarttır.

source: In addition to the open source technologies, there are a number of proprietary solutions that are officially supported by OpenStack Block Storage. You can find a matrix of the functionality provided by all of the supported Block Storage drivers on the `CinderSupportMatrix wiki <https://wiki.openstack.org/wiki/CinderSupportMatrix>`_.
tr_tr: Açık kaynak teknolojilere ek olarak, OpenStack Blok Depolama tarafından resmen desteklenen tescilli çözümler de bulunur. Desteklenen tüm Blok Depolama sürücülerinin işlevsellik matrisini `CinderSupportMatrix wiki'sinde <https://wiki.openstack.org/wiki/CinderSupportMatrix>`_ bulabilirsiniz.

source: In an HDD, data transfer is sequential. The actual read/write head "seeks" a point in the hard drive to execute the operation. Seek time is significant. Transfer rate can also be influenced by file system fragmentation and the layout. Finally, the mechanical nature of hard disks also has certain performance limitations.
tr_tr: Bir HDD'de, veri aktarımı sıralıdır. İşlemi gerçekleştirmek için okuma/yazma kafası sabit diskte bir noktayı "arar". Arama süresi kayda değerdir. Aktarım oranı da dosya sistemi parçalanması ve düzeninden etkilenir. Son olarak sabit disklerin mekanik doğası başarım kısıtlaması oluşturur.

source: In an SSD, data transfer is *not* sequential; it is random so it is faster. There is consistent read performance because the physical location of data is irrelevant because SSDs have no read/write heads and thus no delays due to head motion (seeking).
tr_tr: Bİr SSD'de, veri aktarımı sıralı *değildir*; Rasgeledir yani daha hızlıdır. Verinin fiziksel konumu önemsiz olduğundan tutarlı okuma başarımı bulunur, SSD'lerin okuma/yazma kafası yoktur yani arama hareketi yüzünden gecikme oluşmaz.
