Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: storage replication and availability (both block and file/object storage)
tr_tr: depo kopyalama ve kullanılırlığı (hem blok hem dosya/nesne depolama)
