Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: The overlay zone is defined as any L3 connectivity between the cloud components and could take the form of SDN solutions such as the neutron overlay solution or 3rd Party SDN solutions.
tr_tr: Üst katman bölgesi bulut bileşenleri arasındaki herhangi bir L3 bağlantısı gibi tanımlanır ve neutron üst katman çözümü veya 3. Kişi SDN çözümleri gibi SDN çözümleri biçiminde de olabilir.

source: The power and cooling density requirements might be lower than with blade, sled, or 1U server designs due to lower host density (by using 2U, 3U or even 4U server designs). For data centers with older infrastructure, this might be a desirable feature.
tr_tr: Blade, sled veya 1U tasarımlarda sunucu yoğunluğunun az olmasından dolayı (2U, 3U hatta 4U sunucu tasarımlarını kullanarak) güç ve soğutma yoğunluğu gereksinimleri daha az olabilir. Eski alt yapıya sahip veri merkezlerinde bu istenen bir özellik olabilir.

source: The remaining point on bandwidth is the public-facing portion. The ``swift-proxy`` service is stateless, which means that you can easily add more and use HTTP load-balancing methods to share bandwidth and availability between them. More proxies means more bandwidth.
tr_tr: Bant genişliği hakkındaki başka bir nokta açık taraftaki yüzle ilgilidir. ``swift-proxy`` servisi durumsuzdur, yani kolaylıkla daha fazla ekleyebilirsiniz ve HTTP yük dengeleme yöntemlerini kullanarak bant genişliği ve kullanılabilirliği paylaştırabilirsiniz. Daha fazla vekil daha fazla bant genişliği demektir.

source: The remaining services, responsible for create, read, update and delete (CRUD) operations, metering, monitoring, and so on, are often referred to as the Control Plane. The SLA is likely to dictate a lower uptime requirement for these services.
tr_tr: Oluşturma, okuma, güncelleme ve silme (CRUD), ölçme, izleme vs. den sorumlu geri kalan servislere Kontrol Düzlemi denir. SLA bu servisler için muhtemelen daha düşük bir hizmet süresi belirleyecektir.

source: The replicator does not maintain desired levels of replication when other failures occur, such as entire node failures, because most failures are transient.
tr_tr: Çoğaltıcı diğer arıza durumlarında istenen yedekleme seviyelerini korumaz, örneğin tüm düğümün arızası durumunda, çünkü çoğu arıza geçicidir.

source: The scheduling services are responsible for determining the compute or storage node where a virtual machine or block storage volume should be created. The scheduling services receive creation requests for these resources from the message queue and then begin the process of determining the appropriate node where the resource should reside. This process is done by applying a series of user-configurable filters against the available collection of nodes.
tr_tr: Zamanlama servisleri hesaplama veya depolama düğümünde bir sanal makinenin veya blok depolama biriminin nerde oluşturulması gerektiğine karar verir. Zamanlama servisleri ileti kuyruğundan bu kaynaklar için oluşturma istekleri alırlar ve kaynağın oluşturulması gereken uygun düğüme karar verme sürecini başlatırlar. Bu süreç kullanılabilir düğüm koleksiyonlarına kullanıcı tarafından yapılandırılabilen süzgeçlerin uygulanmasıyla yapılır.

source: The selected server hardware must have the appropriate number of network connections, as well as the right type of network connections, in order to support the proposed architecture. Ensure that, at a minimum, there are at least two diverse network connections coming into each rack.
tr_tr: Seçili sunucu donanımı teklif edilen mimariyi destekleyebilmesi için uygun ağ bağlantısı sayısına ve doğru ağ bağlantısı türüne sahip olmalıdır. Emin olmak için her bir kabine en az iki ayrı ağ bağlantısının geldiğinden emin olun.

source: The selection of form factors or architectures affects the selection of server hardware. Ensure that the selected server hardware is configured to support enough storage capacity (or storage expandability) to match the requirements of selected scale-out storage solution. Similarly, the network architecture impacts the server hardware selection and vice versa.
tr_tr: Biçim katsayılarının veya mimarilerin seçimi sunucu donanımı seçimini etkiler. Seçili sunucu donanımının seçili depolama ölçeklendirme çözümünün gereksinimleriyle eşleşerek yeterli depolama kapasitesini (veya depolamanın genişleyebilirliğini) destekleyecek şekilde yapılandırıldığından emin olun. Benzer şekilde, ağ mimarisi de sunucu donanımı seçimini etkiler, tersi de doğrudur.

source: The selection of storage hardware determines the overall performance and scalability of a storage-focused OpenStack design architecture. Several factors impact the design process, including:
tr_tr: Depolama donanımının seçimi depolama odaklı bir OpenStack tasarım mimarisinin genel başarımını ve ölçeklenebilirliğini etkiler. Tasarım sürecini bir çok etmen etkiler, bazıları:

source: The services comprising an OpenStack cloud have a number of requirements that you need to understand in order to be able to meet SLA terms. For example, in order to provide the Compute service a minimum of storage, message queueing and database services are necessary as well as the networking between them.
tr_tr: Bir OpenStack bulutundan oluşan servislerin SLA koşullarını karşılamak için anlamanız gereken bir takım gereksinimleri olabilir. Örneğin, Hesaplama servisine asgari depolama sağlamak için, mesaj kuyruklama ve veritabanı servisleri ve aralandaki ağ zorunludur.

source: The solution would consist of the following OpenStack components:
tr_tr: Çözüm şu OpenStack bileşenlerinden oluşurdu:

source: The supporting network for this type of configuration needs to have a low latency and evenly distributed availability. This workload benefits from having services local to the consumers of the service. Use a multi-site approach as well as deploying many copies of the application to handle load as close as possible to consumers. Since these applications function independently, they do not warrant running overlays to interconnect tenant networks. Overlays also have the drawback of performing poorly with rapid flow setup and may incur too much overhead with large quantities of small packets and therefore we do not recommend them.
tr_tr: Bu tür bir yapılandırmada destek ağının düşük gecikmeye ve eşit dağıtılmış kullanılırlığa sahip olması gerekir. Bu iş yükü servislerin servisleri kullananlara yakın olmasından faydalanır. Yükü kullanıcılara olabildiğince yakın tutmak için farklı konumlar yaklaşımı yanında uygulamanın olabildiğince fazla kopyasını dağıtarak muhtemel tüketicilere olabildiğince yakınlaşın. Bu işlevler bağımsız çalıştıklarından, çalışan üst katmanların kiracı ağlarla dahili bağ kuracaklarını garantilemezler. Üst katmanlar ani akış kurulumuyla başarısız çalışabilir ve yüksek sayıda küçük paket olan durumlarda fazla ek yük bindirebilirler bu yüzden tavsiye etmiyoruz.

source: The three main approaches to instance storage are provided in the next few sections.
tr_tr: Sunucu depolamayla ilgili üç ana yaklaşım sonraki kısımlarda anlatılmıştır.

source: The type of CPU in your compute node is a very important decision. You must ensure that the CPU supports virtualization by way of *VT-x* for Intel chips and *AMD-v* for AMD chips.
tr_tr: Hesaplama düğümünüzdeki işlemcinin türü çok önemli bir karardır. İşlemcinin Intel çipler için *VT-x* ve AMD çipler için *AMD-v* yoluyla sanallaştırmayı desteklediğinden emin olun.

source: The underlay zone is defined as the physical network switching infrastructure that connects the storage, compute and control platforms. There are a large number of potential underlay options available.
tr_tr: Altkatman bölgesi depolama, hesaplama ve kontrol platformlarını bağlayan fiziksel ağ anahtarlama alt yapısı olarak tanımlanır. Çok sayıda altkatman seçeneği kullanılabilirdir.

source: The web application instances run from local storage on each of the OpenStack Compute nodes. The web application instances are stateless, meaning that any of the instances can fail and the application will continue to function.
tr_tr: Web uygulaması sunucuları her bir OpenStack Hesaplama düğümünde yerel depolamadan çalışıyor. Web uygulaması sunucuları durumsal değil, yani sunuculardan herhangi biri arızalanabilir ve uygulama çalışmaya devam edecektir.

source: There are a small number of OpenStack services which are intended to only run in one place at a time (for example, the ``ceilometer-agent-central`` service) . In order to prevent these services from becoming a single point of failure, they can be controlled by clustering software such as ``Pacemaker``.
tr_tr: Yalnızca tek bir yerde çalışması gereken küçük sayıda OpenStack servisi bulunur (örneğin, ``ceilometer-agent-central`` servisi). Bu servislerin kırılma noktasına dönüşmesini engellemek için, ``Pacemaker`` gibi kümeleme yazılımı ile kontrol edebilirsiniz.

source: There are a variety of well tested tools, such as Internet Control Message Protocol (ICMP) to monitor and manage traffic.
tr_tr: Trafiği izlemek ve yönetmek için İnternet Kontrol İletisi İletişim Kuralı (ICMP) gibi çok iyi denenmiş araçlar bulunur.

source: There are additional risks that arise from configuring the cloud network to take advantage of vendor specific features. One example is multi-link aggregation (MLAG) used to provide redundancy at the aggregator switch level of the network. MLAG is not a standard and, as a result, each vendor has their own proprietary implementation of the feature. MLAG architectures are not interoperable across switch vendors, which leads to vendor lock-in, and can cause delays or inability when upgrading components.
tr_tr: Bulut ağını üreticiye özel özellikleri kullanacak şekilde yapılandırmanın ek riskleri vardır. Bir örnek çoklu bağlantı toplama (MLAG) kullanarak ağın anahtar seviyesinde toplama yapmaktır. MLAG standart değildir, yani her üreticinin bu özelliği kendine has uygulaması vardır. MLAG mimariler anahtar üreticiler arasında eş çalıştırılabilir değildir, bu da belli üreticiye kitlenmeye sebep olur, ve bileşenler yükseltilirken gecikmelere veya engellemeye yol açar.

source: There are also output filters available that send event data to many different destinations. Some examples are:
tr_tr: Olay verisini bir çok hedefe gönderek çıktı süzgeçleri de bulunur. Bazı örnekler:

source: There are currently two schedulers: ``nova-scheduler`` for virtual machines and ``cinder-scheduler`` for block storage volumes. Both schedulers are able to scale horizontally, so for high-availability purposes, or for very large or high-schedule-frequency installations, you should consider running multiple instances of each scheduler. The schedulers all listen to the shared message queue, so no special load balancing is required.
tr_tr: Mevcut iki zamanlayıcı bulunur: sanal makineler için ``nova-scheduler`` ve blok depolama birimleri için ``cinder-scheduler``. Her iki zamanlayıcı da yatay ölçeklenebilirdir, yani yüksek kullanılırlık için, veya çok büyük veya yüksek zamanlama sıklığındaki kurulumlar için, her bir zamanlayıcıdan birden fazla çalıştırmayı düşünmelisiniz. Zamanlayıcılar paylaşımlı ileti kuyruğunu dinlerler, yani özel bir yük dengelemeye gerek yoktur.

source: There are many different storage architectures available when designing an OpenStack cloud. The convergence of orchestration and automation within the OpenStack platform enables rapid storage provisioning without the hassle of the traditional manual processes like volume creation and attachment.
tr_tr: OpenStack bulutu tasarlarken kullanılabilecek çok sayıda farklı depolama mimarileri bulunur. OpenStack platformundaki orkestrasyon ve otomasyonun birleşimi geleneksel elle işletilen birim oluşturma ve ekleme gibi süreçlerden kurtulmanızı sağlar.

source: There are many reasons an OpenStack network has complex requirements. One main factor is that many components interact at different levels of the system stack. Data flows are also complex.
tr_tr: Bir OpenStack ağının karmaşık gereksinimleri olmasının bir çok sebebi vardır. Ana etmenlerden biri de bir çok bileşenin sistem yığınıyla farklı seviyelerde iletişime geçmesidir. Veri akışları da karmaşıktır.

source: There are many services outside the realms of pure OpenStack code which affects the ability of a cloud design to meet SLAs, including:
tr_tr: OpenStack kodu alanı dışında kalan ve bulut tasarımının SLA'ları karşılamasını etkileyebilecek bir çok servis bulunur, bazıları:

source: There are more subtle design impacts that need to be considered. The selection of certain networking hardware (and the networking software) affects the management tools that can be used. There are exceptions to this; the rise of *open* networking software that supports a range of networking hardware means there are instances where the relationship between networking hardware and networking software are not as tightly defined.
tr_tr: Ele alınması gereken göze pek çarpmayan tasarım etkenleri bulunur. Belirli ağ donanımının seçilmesi (ve yazılımının) kullanılabilecek yönetim araçlarını da etkiler. Buna istisnalar da bulunur; geniş aralıkta ağ donanımını destekleyen *açık* ağ yazılımının yükselişi ağ donanımı ile ağ yazılımının sıkı sıkıya tanımlanmadığı durumların da olduğu anlamına geliyor.

source: There are several advantages to this approach:
tr_tr: Bu yaklaşımın bir çok avantajı bulunur:

source: There are several disadvantages:
tr_tr: Bir çok dezavantaj bulunur:

source: There are several factors to take into consideration when deciding on whether to use Layer 2 networking architecture or a layer 3 networking architecture. For more information about OpenStack networking concepts, see the `OpenStack Networking <https://docs.openstack.org/ocata/networking-guide/intro-os-networking.html#>`_ section in the OpenStack Networking Guide.
tr_tr: Katman 2 ağ mimarisi veya katman 3 ağ mimarisi seçerken hesaba katılması gereken çeşitli etmenler bulunur. OpenStack ağ kavramlarıyla ilgili daha fazla bilgi için OpenStack Ağ Kılavuzundaki `OpenStack Ağı <https://docs.openstack.org/ocata/networking-guide/intro-os-networking.html#>`_ kısmına göz atın.

source: There are several other considerations when designing a network-focused OpenStack cloud.
tr_tr: Ağ odaklı OpenStack bulutu tasarlarken ele alınacak bir çok etmen bulunur.

source: There are several reasons a network designed on layer-2 protocols is selected over a network designed on layer-3 protocols. In spite of the difficulties of using a bridge to perform the network role of a router, many vendors, customers, and service providers choose to use Ethernet in as many parts of their networks as possible. The benefits of selecting a layer-2 design are:
tr_tr: Katman-2 iletişim kurallarıyla tasarlanan bir ağın katman-3 ile tasarlananlara tercih edilmesinin çeşitli sebepleri vardır. Bir yönlendiricinin ağ rolünü üstlenmesi için köprü kullanmanın zorluklarına rağmen, çoğu üretici müşteriler ve servis sağlayıcılar ağlarının olabildiğince çok bölümünde Ethernet kullanmayı terchi ederler. Katman-2 tasarımını seçmenin faydaları şunlardır:

source: There are some specific configuration parameters that are needed to configure Logstash for OpenStack. For example, in order to get Logstash to collect, parse, and send the correct portions of log files to the Elasticsearch server, you need to format the configuration file properly. There are input, output and filter configurations. Input configurations tell Logstash where to recieve data from (log files/forwarders/filebeats/StdIn/Eventlog), output configurations specify where to put the data, and filter configurations define the input contents to forward to the output.
tr_tr: OpenStack için Logstash yapılandırılması için gereken belirli yapılandırma parametreleri bulunur. Örneğin Logstash'in günlük kayıtlarının doğru kısımlarını toplayıp ayrıştırıp Elasticsearch sunucusuna gönderebilmesi için, yapılandırma dosyasını düzgün biçimlendirmelisiniz. Girdi, çıktı ve süzgeç yapılandırmaları bulunur. Girdi yapılandırmaları Logstash'e verinin nerden alınacağını söyler (kayıt dosyası/yönlendiriciler/filebeat/StdIn/Olay kaydı), çıktı yapılandırmaları verinin nereye konacağını belirtir, süzgeç yapılandırmaları çıktıya yönlendirilecek girdi içeriğini tanımlar.

source: There are special considerations around erasure coded pools. For example, higher computational requirements and limitations on the operations allowed on an object; erasure coded pools do not support partial writes.
tr_tr: Bunlar silinti kodlu havuzlarla ilgili özel etmenlerdir. Örneğin, yüksek hesaplama gereksinimleri ve bir nesne üzerinde izin verilen işlemlerin sınırlandırılması; silinti kodlu havuzlar kısmi yazmaları desteklemez.

source: There are two main advantages:
tr_tr: İki temel avantaj bulunur:

source: There are two major classes of replicator: the db replicator, which replicates accounts and containers, and the object replicator, which replicates object data.
tr_tr: İki ana çoğaltıcı sınıfı bulunur; db çoğaltıcı, hesapları ve kapsayıcıları yedekler, ve nesne çoğaltıcı, nesne verisini yedekler.

source: There are two primary types of traffic flow within a cloud infrastructure, the choice of networking technologies is influenced by the expected loads.
tr_tr: Bir bulut altyapısında iki temel trafik akış türü bulunur, ağ teknolojilerinin seçimi beklenen yüke göre yapılır.

source: There are various commodity storage back end technologies available. Depending on your cloud user's needs, you can implement one or many of these technologies in different combinations.
tr_tr: Çok çeşitli ticari depolama arka uç teknolojileri bulunur. Bulut kullanıcılarınızın ihtiyaçları doğrultusunda, bu teknolojilerden birini ya da bir kaçını değişik birleştirmelerle uygulayabilirsiniz.

source: There is a trend for cloud operations systems being hosted within the cloud environment. Operators require access to these systems to resolve a major incident.
tr_tr: Bulut işletme sistemlerinin bulut ortamında tutulması eğilimi bulunmaktadır. Büyük bir hadise olması durumunda çözüm için işletenlerin bu sistemlere erişebilmesi gerekir.

source: There is no single best practice architecture for the networking hardware supporting an OpenStack cloud. Some of the key factors that will have a major influence on selection of networking hardware include:
tr_tr: OpenStack bulutunu destekleyen ağ donanımı için üstün tek bir yöntem yoktur. Ağ donanımı seçiminde önemli rol oynayacak olan bazı etmenler şunlardır:

source: Therefore, we recommend that host aggregates are used to separate not only bare metal hosts, but hosts that will provide resources for workloads that require dedicated resources. This said, when workloads are provisioned to NUMA host aggregates, NUMA nodes are chosen at random and vCPUs can float across NUMA nodes on a host. If workloads require SR-IOV or DPDK, they should be assigned to a NUMA node aggregate with hosts that supply the functionality. More importantly, the workload or vCPUs that are executing processes for a workload should be on the same NUMA node due to the limited amount of cross-node memory bandwidth. In all cases, the ``NUMATopologyFilter`` must be enabled for ``nova-scheduler``.
tr_tr: Yani sunucu takımlarının sadece saf metal sunucuları değil, adanmış kaeynakları gerektiren iş yükleri için kaynak sağlayan sunucuları da ayırmak için kullanılmasını öneriyoruz. Bununla beraber, iş yükleri NUMA sunucu takımlarına hazırlandıklarında, NUMA düğümleri rasgele seçilir ve vCPU'lar sunucu üstündeki NUMA düğümleri arasında kayabilirler. İş yükleri SR-IOV veya DPDK gerektiriyorsa, özelliği destekleyen sunuclardaki NUMA düğüm takımına atanmalıdırlar. Daha da önemlisi, iş yükleri ya da iş yükleri için süreçleri çalıştıran vCPU'lar düğümler arası kısıtlı hafıza bant genişliği yüzünden aynı NUMA düğümünde olmalıdırlar. Her halükarda, ``nova-scheduler`` için ``NUMATopologyFilter`` etkin olmalıdır.

source: These drivers work a little differently than a traditional block storage driver. On an NFS or GlusterFS file system, a single file is created and then mapped as a virtual volume into the instance. This mapping and translation is similar to how OpenStack utilizes QEMU's file-based virtual machines stored in ``/var/lib/nova/instances``.
tr_tr: Bu sürücüler geleneksel blok depolama sürücülerine göre biraz farklı çalışırlar. NFS veya GlusterFS dosyas sisteminde, tek bir dosya oluşturulur ve sanal birim olarak sunucuya eşleştirilir. Bu eşleştirme ve çevrim OpenStack'in QEMU'nun ``/var/lib/nova/instances`` dizininde tutulan dosya tabanlı sanal makineleri kullanmasına benzer.

source: These input, output and filter configurations are typically stored in :file:`/etc/logstash/conf.d` but may vary by linux distribution. Separate configuration files should be created for different logging systems such as syslog, Apache, and OpenStack.
tr_tr: Bu girdi, çıktı ve süzgeç yapılandırmaları genellikle :file:`/etc/logstash/conf.d` dizininde saklanır ama linux dağıtımına göre bu konum değişebilir. Syslog, Apache, ve OpenStack gibi farklı kayıt sistemleri için ayrı yapılandırma dosyaları oluşturulmalıdır.

source: This application prioritizes the north-south traffic over east-west traffic: the north-south traffic involves customer-facing data.
tr_tr: Bu uygulama kuzey-güney trafiği doğu-batı trafiğe göre öncelik edinir: kuzey-güney trafiği müşteriye dönük veriyi içerir.

source: This chapter describes the enterprise and operational factors that impacts the design of an OpenStack cloud.
tr_tr: Bu bölüm bir OpenStack bulutun tasarımını etkileyen kurumsal ve işlevsel etmenleri tanımlar.

source: This deployment felt that the spare I/O on the Object Storage proxy server was sufficient and that the Image Delivery portion of glance benefited from being on physical hardware and having good connectivity to the Object Storage back end it was using.
tr_tr: Bu kurulum Nesne Depolama vekil sunucusundaki yedek I/O'nun yeterli olduğunu ve glance'in İmaj Aktarım kısmının fiziksel donanımda olmaktan faydalandığını ve kullandığı Nesne Depolamayla iyi bağlantısı olduğunu hissetti.

source: This deployment had an expensive hardware load balancer in its organization. It ran multiple ``nova-api`` and ``swift-proxy`` servers on different physical servers and used the load balancer to switch between them.
tr_tr: Bu kurulum kurumundaki pahalı donanımsal yük dengeleyiciye sahipti. Farklı fiziksel sunucularda birden çok ``nova-api`` ve ``swift-proxy``sunucusu çalıştırdı ve yük dengeleyici ile birbirleri arasında geçişi sağladı.

source: This deployment ran central services on a set of servers running KVM. A dedicated VM was created for each service (``nova-scheduler``, rabbitmq, database, etc). This assisted the deployment with scaling because administrators could tune the resources given to each virtual machine based on the load it received (something that was not well understood during installation).
tr_tr: Bu kurulum KVM çalıştıran sunucu kümesi üzerinde merkezi servisleri çalıştırdı. Her bir servis için adanmış bir sanal makine oluşturuldu (``nova-scheduler``, rabbitmq, veritabanı, vs). Bu kurulumun ölçeklenmesinde faydalı oldu çünkü yöneticiler her bir sanal makineye aldığı yük oranında kaynak ayarlayabiliyorlardı (kurulum sırasında tam anlaşılmamış bir şeydi).

source: This deployment used a central dedicated server to provide the databases for all services. This approach simplified operations by isolating database server updates and allowed for the simple creation of slave database servers for failover.
tr_tr: Bu kurulum tüm servislere veritabanı sağlamak için merkezi adanmış bir sunucu kullandı. Bu yaklaşım veritabanı sunucu güncellemelerini yalıtarak işlemleri ve problem halinde kullanılacak köle veritabanı sunucuların oluşturulmasını basitleştirdi.
