Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: As you add back-end storage capacity to the system, the partition maps redistribute data amongst the storage nodes. In some cases, this involves replication of extremely large data sets. In these cases, we recommend using back-end replication links that do not contend with tenants' access to data.
tr_tr: Sisteme arka uç depolama kapasitesi ekledikçe, bölüm haritaları veriyi diğer depolama düğümleri arasında yeniden dağıtır. Bazı durumlarda, bu oldukça büyük veri kümelerinin çoklanması anlamına gelir. Bu gibi durumlarda, kiracıların veriye erişimine karışmayacak arka uç çoklama bağlantıları kullanılmasını öneriyoruz.

source: Auditing
tr_tr: Denetleme

source: Authentication
tr_tr: Kimlik Doğrulama

source: Authentication and Authorization
tr_tr: Kimlik doğrulama ve Yetkilendirme

source: Authentication and authorization for identity management
tr_tr: Kimlik yönetimi için kimlik doğrulama ve yetkilendirme

source: Availability
tr_tr: Kullanılabilirlik

source: Available user-level quotes
tr_tr: Kullanılabilir kullanıcı seviyesi kotaları

source: Avoid hardware or software vendor lock-in. The design should not rely on specific features of a vendor's network router or switch.
tr_tr: Donanımsal ya da yazılımsal üretici bağımlılığından uzak durun. Tasarım bir üreticinin yönlendirici ya da anahtarının belirli özelliklerine bağımlı olmamalıdır.

source: Avoid using a hybrid cloud deployment with more than just OpenStack (or with different versions of OpenStack) as API changes can cause compatibility issues.
tr_tr: OpenStack (hatta farklı OpenStack sürümleriyle bile) melez bulut kurulumlarından uzak durun, API değişiklikleri uyumluluk sorunları çıkarabilir.

source: Because sessions persist until closed, the routing and switching architecture provides high availability. Switches mesh to each hypervisor and each other, and also provide an MLAG implementation to ensure that layer-2 connectivity does not fail. Routers use VRRP and fully mesh with switches to ensure layer-3 connectivity. Since GRE provides an overlay network, Networking is present and uses the Open vSwitch agent in GRE tunnel mode. This ensures all devices can reach all other devices and that you can create tenant networks for private addressing links to the load balancer.
tr_tr: Oturumlar kapatılana kadar kaldıklarından, yönlendirme ve anahtarlama mimarisi yüksek kullanılırlık sağlar. Anahtarlar her bir hipervizör ve birbirleriyle örgülüdür, ayrıca katman-2 bağlantının başarısız olmadığından emin olmak için MLAG uygulaması sağlarlar. Yönlendiriciler katman-3 bağlantısından emin olmak için VRRP sağlarlar ve anahtarlarla tam örgü halindedirler. GRE bir üst katman ağı sağladığından, Ağ mevcuttur ve GRE tünel kipinde Open vSwitch aracısı kullanır. Bu, tüm aygıtların birbirine erişebilmesini ve bağlantıların yük dengeleyiciye özel adreslemesi için kiracı ağların oluşturulmasını sağlar.

source: Because the cloud controller handles so many different services, it must be able to handle the amount of traffic that hits it. For example, if you choose to host the OpenStack Image service on the cloud controller, the cloud controller should be able to support the transferring of the images at an acceptable speed.
tr_tr: Bulut kontrol birimi bir çok servisi ele aldığından, gelen trafiği de kaldırabilmelidir. Örneğin OpenStack imaj servisini bulut kontrol biriminde sunmayı seçerseniz, bulut kontrol birimi imajların kabul edilebilir bir hızda aktarımını sağlayabilmelidir.

source: Before reading this book, we recommend:
tr_tr: Bu kitabı okumadan önce, şunları öneriyoruz:

source: Benefits using a Layer-2 network
tr_tr: Katman-2 ağ kullanmanın faydaları

source: Benefits using a Layer-3 network
tr_tr: Katman-3 ağ kullanmanın faydaları

source: Better support for distributed deployments across multiple datacenters through support for asynchronous eventual consistency replication.
tr_tr: Asenkron nihai tutarlılıklı yedekleme desteği ile birden çok veri merkezi arasında dağıtık kuruluma daha iyi destek.

source: Between 120 and 140 installations of Nginx and Tomcat, each with 2 vCPUs and 4 GB of RAM
tr_tr: 120 ve 140 arası Nginx ve Tomcat kurulumu, her biri 2 vCPU ve 4 GB RAM'e sahip

source: Between servers and the proxies
tr_tr: Sunucular ve vekiller arasında

source: Between the proxies and your users
tr_tr: Vekiller ve kullanıcılarınız arasında

source: Beyond the normal Identity service, Compute service, Image service, and Object Storage components, we recommend the Orchestration service component to handle the proper scaling of workloads to adjust to demand. Due to the requirement for auto-scaling, the design includes the Telemetry service. Web services tend to be bursty in load, have very defined peak and valley usage patterns and, as a result, benefit from automatic scaling of instances based upon traffic. At a network level, a split network configuration works well with databases residing on private tenant networks since these do not emit a large quantity of broadcast traffic and may need to interconnect to some databases for content.
tr_tr: Normal Kimlik servisi, Hesaplama servisi, İmaj servisi, ve Nesne Depolama bileşenlerinin ötesinde Orkestrasyon servis bileşenin iş yüklerinin doğru ölçeklenmesi isteğini karşılamasını öneriyoruz. Otomatik ölçeklendirme ihtiyacı yüzünden, tasarım Telemetri servisini içerir. Web servisleri yükte ani artış göstermeye meyillidir, oldukça belirli uç ve taban noktası kalıpları bulunur, ve sonuç olarak trafiğe göre sunucuların otomatik ölçeklenmesinde faydalanırlar. Ağ seviyesinde, ayrık bir ağ yapılandırması özel kiracı ağlarında duran veritabanları ile iyi çalışır, çünkü bunlar yüksek miktarda yayın trafiği üretmezler ve içerik için bazı veritabanlarına dahili olarak bağlanmaları gerekebilir.

source: Block
tr_tr: Blok

source: Block storage
tr_tr: Blok depolama

source: Block storage is implemented in OpenStack by the Block Storage service (cinder). Because these volumes are persistent, they can be detached from one instance and re-attached to another instance and the data remains intact.
tr_tr: Blok depolama OpenStack'de Blok Depolama servisi (cinder) tarafından uygulanır. Bu birimler kalıcı olduklarından, veriyi bozmadan bir sunucudan ayrılıp başka bir sunucuya tekrar eklenebilirler.

source: Broker between clouds
tr_tr: Bulutlar arasında aracı

source: Brokering software evaluates relative costs between different cloud platforms. Cloud Management Platforms (CMP) allow the designer to determine the right location for the workload based on predetermined criteria.
tr_tr: Aracı yazılım farklı bulut platformları arasında masrafları değerlendirir. Bulut Yönetim Platformları (CMP) tasarımcıya önceden tanımlanmış kriterlere göre iş yükü için doğru konumu belirleme imkanı verir.

source: Business changes can affect provider availability. Likewise, changes in a provider's service can disrupt a hybrid cloud environment or increase costs.
tr_tr: İş değişiklikleri sağlayıcı kullanılırlığını etkileyebilir. Aynı şekilde, bir sağlayıcının servisindeki değişiklikler melez bulut ortamını bozabilir veya masrafları artırabilir.

source: Business or technical diversity
tr_tr: İş veya teknik çeşitlilik

source: Businesses with existing applications may find that it is more cost effective to integrate applications on multiple cloud platforms than migrating them to a single platform.
tr_tr: Mevcut uygulamalara sahip işler uygulamaları tek bir plaformda toplamak yerine birden çok bulut platformuna tümleştirmenin daha masrafsız olacağını bulabilirler.

source: By definition, a cloud provides end users with the ability to self-provision computing power, storage, networks, and software in a simple and flexible way. The user must be able to scale their resources up to a substantial level without disrupting the underlying host operations. One of the benefits of using a general purpose cloud architecture is the ability to start with limited resources and increase them over time as the user demand grows.
tr_tr: Tanım olarak bulut, son kullanıcılara hesaplama gücü, depolama, ağlar, ve yazılımı esnek bir yolla kendi kendine sağlama olanağı verir. Kullanıcı kaynaklarını alt katmandaki sunucu işlemlerini rahatsız etmeden kaynaklarını azımsanmayacak seviyelere ölçekleyebilir olmalıdır. Genel amaçlı bir bulut mimarisi kullanmanın faydalarından biri sınırlı kaynaklarla başlayıp kullanıcı gereksinimi arttıkça arttırabilmektir.

source: CMPs simplify the migration of application workloads between public, private, and hybrid cloud platforms.
tr_tr: CMP'ler açık, özel, ve melez bulut platformları arasındaki uygulama iş yüklerinin göçünü basitleştirir.

source: CPU allocation ratio: 16:1
tr_tr: CPU ayırma oranı: 16:1

source: CPU overcommit ratio (virtual cores per physical core)
tr_tr: CPU abonelik aşım oranı (fiziksel çekirdek başına sanal çekirdek)

source: Capacity
tr_tr: Kapasite

source: Capacity and scale
tr_tr: Kapasite ve ölçek

source: Capacity and the placement of workloads are key design considerations for clouds. A long-term capacity plan for these designs must incorporate growth over time to prevent permanent consumption of more expensive external clouds. To avoid this scenario, account for future applications' capacity requirements and plan growth appropriately.
tr_tr: İş yüklerinin kapasite ve yerleştirmeleri bulutlar için anahtar tasarım ölçütlerindendir. Bu tasarımlar için uzun soluklu kapasite planı daha pahalı harici bulutların sürekli tüketimini önlemek için zaman bağlı büyümeyi göz önüne almalıdır. Bu senaryodan kaçınmak için, gelecekteki uygulamaların kapasite gereksinimlerini de hesaba katın ve uygun büyüme planını yapın.

source: Capacity planning
tr_tr: Kapasite planlama

source: Capacity planning and scalability
tr_tr: Kapasite planlama ve ölçeklendirme

source: Care must be taken when deciding network functionality. Currently, OpenStack supports both the legacy networking (nova-network) system and the newer, extensible OpenStack Networking (neutron). OpenStack Networking and legacy networking both have their advantages and disadvantages. They are both valid and supported options that fit different network deployment models described in the `OpenStack Operations Guide <https://docs.openstack.org/ops-guide/arch_network_design.html#network-topology>`_.
tr_tr: Ağ işlevselliğine karar verilirken dikkat edilmelidir. Şu an OpenStack hem eski ağ (nova-network) sistemini, hem daha yeni OpenStack Ağını (neutron) destekler. OpenStack Ağı ve eski ağın kendine göre avantajı ve dezavantajı vardır. Her ikisi de `OpenStack İşlem Kılavuzunda <https://docs.openstack.org/ops-guide/arch_network_design.html#network-topology>`_ geçerli ve desteklenen seçeneklerdir.

source: Ceph is a scalable storage solution that replicates data across commodity storage nodes.
tr_tr: Ceph veriyi ticari depolama düğümleri arasında çoğaltan ölçeklenebilir bir depolama çözümüdür.

source: Ceph provides support for the same Object Storage API as swift and can be used as a back end for the Block Storage service (cinder) as well as back-end storage for glance images.
tr_tr: Ceph swift ile aynı Nesne Depolama API'si için destek sağlar ve Blok Depolama servisi (cinder) için arka uç olarak kullanılabileceği gibi glanc imajları için de arka uç olarak kullanılabilir.

source: Ceph supports thin provisioning implemented using copy-on-write. This can be useful when booting from volume because a new volume can be provisioned very quickly. Ceph also supports keystone-based authentication (as of version 0.56), so it can be a seamless swap in for the default OpenStack swift implementation.
tr_tr: Ceph yazmada-kopyalama kullanılarak uygulanan ince hazırlamaları destekler. Bu birimden önyükleme yaparken kullanışlı olabilir çünkü yeni birim çok hızlı hazırlanabilir. Ceph ayrıca keystone tabanlı kimlik doğrulamayı destekler (0.56 sürümünden itibaren), böylece öntanımlı OpenStack swift uygulaması için kolaylıkla takas edilebilir.

source: Ceph utilises and object storage mechanism for data storage and exposes the data via different types of storage interfaces to the end user it supports interfaces for: - Object storage - Block storage - File-system interfaces
tr_tr: Ceph veri depolama için bir nesne depolama mekanizması kullanır ve veriyi arayüz sağladığı son kullanıcı için farklı depolama arayüzleri halinde ortaya çıkarır: - Nesne depolama - Blok depolama - Dosya sistemi arayüzleri

source: Ceph's advantages include:
tr_tr: Ceph'in avantajları şunları içerir:

source: Changing the CPU overcommit ratio can have a detrimental effect and cause a potential increase in a noisy neighbor.
tr_tr: İşlemci kaynak aşım oranını değiştirmenin zararlı etkisi vardır ve gürültülü komşuları artırır.

source: Cheaper storage makes the public cloud suitable for maintaining backup applications.
tr_tr: Daha ucuz depolama açık bulutu yedek uygulamalarını sürdürebilmek için uygun yapar.

source: Choice of file system
tr_tr: Dosya sistemi seçimi

source: Choosing a CPU
tr_tr: Bir işlemci seçmek

source: Choosing a hypervisor
tr_tr: Hipervizör seçmek

source: Choosing network hardware
tr_tr: Ağ donanımı seçmek

source: Choosing networking software
tr_tr: Ağ yazılımı seçmek

source: Choosing server hardware
tr_tr: Sunucu donanımı seçmek

source: Choosing storage back ends
tr_tr: Depolama arka ucu seçimi

source: Cloud management platform tools
tr_tr: Bulut yönetim platformu araçları

source: Cloud networks require management for capacity and growth over time. Capacity planning includes the purchase of network circuits and hardware that can potentially have lead times measured in months or years.
tr_tr: Bulut ağları zamanla kapasite ve büyüme için yönetim gerektirirler. Kapasite planlama aylar ya da yıllar sürebilecek tedarik sürelerine sahip ağ devreleri ve donanımının alınmasını kapsar.

source: Cloud resource deployment
tr_tr: Bulut kaynak kurulumu

source: Cloud storage
tr_tr: Bulut depolama

source: Cloud users expect a fully self-service and on-demand consumption model. When an OpenStack cloud reaches the massively scalable size, expect consumption as a service in each and every way.
tr_tr: Bulut kullanıcıları tamamen kendine servis ve isteğe bağlı tüketim modeli beklerler. Bir OpenStack bulutu büyük ölçeklerde boyuta ulaştığında, her yönüyle servis olarak tüketim bekleyin.

source: Combine several shares in groups to keep data consistency inside the groups for the following safe group operations.
tr_tr: Aşağıdaki güvenli grup işlemleri için gruplarda veri tutarlılığını korumak için bir çok paylaşımo gruplar haline getir.

source: Command-line interface (CLI)
tr_tr: Komut Satırı Arayüzü (CLI)

source: Commodity storage technologies
tr_tr: Ticari depolama teknolojileri

source: Complex clouds, in particular hybrid clouds, may require tools to facilitate working across multiple clouds.
tr_tr: Karmaşık bulutlar, özellikle melez bulutlar, birden çok bulut arasında çalışmayı kolaylaştırmak için araçlara ihtiyaç duyabilirler.

source: Complexity
tr_tr: Karmaşıklık

source: Compliance and geo-location
tr_tr: Uyumluluk ve coğrafi konum

source: Compliance considerations are particularly important for multi-site clouds. Considerations include:
tr_tr: Uyum yükümlülükleri özellikle çoklu konum bulutları için önemlidir. Yükümlülükler şunları içerir:

source: Component block diagram
tr_tr: Bileşen blok şeması

source: Compute analytics with data processing service
tr_tr: Veri işleme servisine sahip hesaplama analitikleri

source: Compute analytics with parallel file systems
tr_tr: Paralel dosya sistemleri olan hesaplama analitikleri

source: Compute capacity (CPU cores and RAM capacity) is a secondary consideration for selecting server hardware. The required server hardware must supply adequate CPU sockets, additional CPU cores, and adequate RA. For more information, see :ref:`choosing-a-cpu`.
tr_tr: Hesaplama kapasitesi (CPU çekirdekleri ve RAM kapasitesi) sunucu donanımı seçerken ikincil etmenlerdir. Gerekli sunucu donanımı uygun CPU soketlerini, ek CPU çekirdeklerini ve uygun RA sağlayabilmelidir. Daha fazla bilgi için bknz :ref:`choosing-a-cpu`.

source: Compute node design
tr_tr: Hesaplama düğümü tasarımı

source: Compute nodes automatically attach to OpenStack clouds, resulting in a horizontally scaling process when adding extra compute capacity to an OpenStack cloud. To further group compute nodes and place nodes into appropriate availability zones and host aggregates, additional work is required. It is necessary to plan rack capacity and network switches as scaling out compute hosts directly affects data center infrastructure resources as would any other infrastructure expansion.
tr_tr: OpenStack bulutuna ek hesaplama kapasitesi eklerken hesaplama düğümleri otomatik olarak OpenStack bulutuna eklenirler ve yatay ölçeklemeyi sağlarlar. Hesaplama düğümlerini daha fazla gruplandırmak ve düğümleri uygun kullanılırlık bölgesine ve istemci takımlarına yerleştirmek için ek iş gerekir. Hesaplama sunucularının ölçeklenmesi veri merkezi alt yapı kaynaklarını herhangi bir alt yapı genişletmede olduğu gibi doğrudan etkileyeceğinden kabin kapasitesi ve ağ anahtarlarını planlamak gereklidir.

source: Compute resources
tr_tr: Hesaplama kaynakları

source: Compute server architecture overview
tr_tr: Hesaplama sunucusu mimarisi genel görünüşü

source: Compute server logging
tr_tr: Hesaplama sunucusu günlük kaydı

source: Conductor Services
tr_tr: Orkestra Yönetim Servisleri

source: Conductor services
tr_tr: Orkestra yönetim servisleri

source: Configure Block Storage resource nodes with advanced RAID controllers and high-performance disks to provide fault tolerance at the hardware level.
tr_tr: Donanım seviyesinde arızaya dayanıklılık sağlamak için gelişmiş RAID denetleyicilerine ve yüksek başarımlı disklere sahip kaynak düğümleri olan Blok Depolama yapılandırın.

source: Configure cloud networks to minimize link loss, packet loss, packet storms, broadcast storms, and loops.
tr_tr: Bulut ağlarını bağlantı kaybı, paket kaybı, paket fırtınaları, yayım fırtınaları, ve döngüleri asgaride tutmak üzere yapılandırın.

source: Configuring ARP can be complicated on a large layer-2 networks.
tr_tr: Büyük bir katman-2 ağda ARP yapılandırması karmaşık olabilir.

source: Configuring incorrect IP addresses, VLANs, and routers can cause outages to areas of the network or, in the worst-case scenario, the entire cloud infrastructure. Automate network configurations to minimize the opportunity for operator error as it can cause disruptive problems.
tr_tr: Geçersiz IP adresleri, VLAN'lar, ve yönlendiriciler yapılandırmak ağın belli kısımlarında kesintiye, ya da en kötü durumda tüm bulut alt yapısının kesintisine neden olabilir. İşletmen hataları yıkıcı sorunlara sebep olabileceğinden ağ yapılandırmasını otomatikleştirin.

source: Connecting more than two sites increases the challenges and adds more complexity to the design considerations. Multi-site implementations require planning to address the additional topology used for internal and external connectivity. Some options include full mesh topology, hub spoke, spine leaf, and 3D Torus.
tr_tr: İkiden çok konumu bağlamak tasarım nazarında daha çok karmaşıklık ekler ve işleri zorlaştırır. Birden çok konum uygulamaları planlama ve dahili ve harici bağlantılar için kullanılacak topolojiye ek planlama gerektirir. Tam örgü topolojisi, hub spoke, spine leaf, ve 3D Torus seçeneklerden bazılarıdır.

source: Connectivity
tr_tr: Bağlanabilirlik

source: Consider additional design decisions about monitoring and alarming. If you are using an external provider, service level agreements (SLAs) are typically defined in your contract. Operational considerations such as bandwidth, latency, and jitter can be part of the SLA.
tr_tr: İzleme ve alarm hakkında ek tasarım kararlarını göz önüne alın. Harici bir sağlayıcı kullanıyorsanız, servis seviyesi anlaşmaları (SLA'lar) muhtemelen anlaşmanızda tanımlanmıştır. Bant genişliği, gecikme ve kararsızlık gibi işlevsel etkenler SLA'nın bir parçası olabilir.

source: Consider configurable networking components related to an OpenStack architecture design when designing for network intensive workloads that include MTU and QoS. Some workloads require a larger MTU than normal due to the transfer of large blocks of data. When providing network service for applications such as video streaming or storage replication, we recommend that you configure both OpenStack hardware nodes and the supporting network equipment for jumbo frames where possible. This allows for better use of available bandwidth. Configure jumbo frames across the complete path the packets traverse. If one network component is not capable of handling jumbo frames then the entire path reverts to the default MTU.
tr_tr: MTU ve QoS içeren ağ ağırlıklı iş yükleri için tasarım yaparken OpenStack ile ilişkili yapılandırılabilir ağ bileşenlerini göz önüne alın. Bazı iş yükleri büyük veri bloklarının aktarımı yüzünden daha büyük MTU değerine ihtiyaç duyarlar. Video akışı veya depolama yedekleme gibi uygulamalar için ağ servisi sağlarken hem OpenStack donanım düğümlerini hem de destekleyen ağ ekipmanını jumbo çerçeveler için yapılandırmanızı öneriyoruz. Bu kullanılabilir bant genişliğinin daha iyi kullanılmasını sağlar. Paketlerin aldıkları tüm yol boyunca jumbo çerçeveleri yapılandırın. Eğer bir ağ bileşeni jumbo çerçeveleri destekleyemiyorsa tüm yol öntanımlı MTU'ya dönecektir.

source: Consider high availability at the physical and environmental layers. If there is a single point of failure due to only one upstream link, or only one power supply, an outage can become unavoidable.
tr_tr: Yüksek kullanılırlığı fiziksel ve ortamsal katmanlarda göz önüne alın. Yukarı tek bağlantınız varsa, veya tek güç kaynağınız varsa, kesinti kaçınılmazdır.

source: Consider the Compute requirements of non-hypervisor nodes (also referred to as resource nodes). This includes controller, Object Storage nodes, Block Storage nodes, and networking services.
tr_tr: Hipervizör olmayan düğümlerin Hesaplama gereksinimlerine dikkat edin (kaynak düğümler de denir). Bu kontrol, Nesne Depolama düğümleri, Blok Depolama düğümleri, ve ağ servislerini içerir.

source: Consider the default value of the number of replicas, which is three. This means that before an object is marked as having been written, at least two copies exist in case a single server fails to write, the third copy may or may not yet exist when the write operation initially returns. Altering this number increases the robustness of your data, but reduces the amount of storage you have available. Look at the placement of your servers. Consider spreading them widely throughout your data center's network and power-failure zones. Is a zone a rack, a server, or a disk?
tr_tr: Kopya yedek sayısını öntanımlı değerini dikkate alın, varsayılan üçtür. Bunun anlamı bir nesnenin yazıldı olarak işaretlenmeden önce en az iki kopyasının tek bir sunucunun yazmada başarısız olması ihtimaline karşı var olduğudur, üçüncü kopya yazma işlemi döndüğünde henüz var olabilir de olmayabilir de. Bu sayıyla oynamak verinizin dayanıklılığını artırır, ama kullanılabilir alanınızı azaltır. Sunucularınızn yerleşimine bakın. Veri merkezinizin ağ ve güç arzıa bölgeleri arasında dağıtın. Bölge bir kabin mi, sunucu mu yoksa disk mi?

source: Consider the following costs categories when designing a cloud:
tr_tr: Bulut tasarlarken şu maliyet kategorilerini göz önünde tutun:

source: Consider the following factors when selecting compute server hardware:
tr_tr: Hesaplama sunucusu donanımı seçerken şu etmenlere dikkat edin:

source: Consider the following in selecting server hardware form factor suited for your OpenStack design architecture:
tr_tr: OpenStack tasarım mimarinize uyumlu donanım biçim katsayısını seçerken şunlara dikkat edin:
