Repository: openstack/arch-design
Catalog: doc/source/locale/*/LC_MESSAGES/arch-design.po
Languages: tr_tr

source: When designing a OpenStack cloud compute server architecture, you must decide whether you intend to scale up or scale out. Selecting a smaller number of larger hosts, or a larger number of smaller hosts, depends on a combination of factors: cost, power, cooling, physical rack and floor space, support-warranty, and manageability. Typically, the scale out model has been popular for OpenStack because it reduces the number of possible failure domains by spreading workloads across more infrastructure. However, the downside is the cost of additional servers and the datacenter resources needed to power, network, and cool the servers.
tr_tr: Bir OpenStack bulut hesaplama sunucusu mimarisi tasarlarken yapacağınız ölçeklemenin yönüne karar vermelisiniz. Az sayıda daha büyük sunucu seçmek veya daha fazla küçük sunucuyla devam etmek, bir çok etmenin birleşimine bağlıdır: masraf, güç, soğutma, fiziksel kabin ve zemin alanı, destek-garanti, ve yönetilebilirlik. Genellikle sayıca artırım OpenStack için popüler olmuştur çünkü iş yükünü daha fazla alt yapıya dağıtarak arıza alanlarının sayısını azaltır. Eksi tarafı ek sunucuların fiyatı ve güç, ağ ve soğutma isteyen veri merkezi kaynaklarıdır.

source: When designing a network architecture, the traffic patterns of an application heavily influence the allocation of total bandwidth and the number of links that you use to send and receive traffic. Applications that provide file storage for customers allocate bandwidth and links to favor incoming traffic; whereas video streaming applications allocate bandwidth and links to favor outgoing traffic.
tr_tr: Bir ağ mimarisi tasarlarken bir uygulamanın trafik kalıpları trafik alıp göndermek için kullandığınız toplam bant genişliği ve bağlantı sayısını çokça etkiler. Müşterileri için dosya depolama sağlayan uygulamalar yoğun gelen trafiğe uygun bant genişliği ve bağlantılar ayırır; bunun gibi video aktarım yapan uygulamalar ise dışarı giden trafiğe uygun bant genişliği ve bağlantılar ayırır.

source: When designing an OpenStack cloud, it is important to consider the needs dictated by the :term:`Service Level Agreement (SLA)`. This includes the core services required to maintain availability of running Compute service instances, networks, storage, and additional services running on top of those resources. These services are often referred to as the Data Plane services, and are generally expected to be available all the time.
tr_tr: Bir OpenStack bulutu tasarlarken, :term:`Servis Seviyesi Anlaşması (SLA)` tarafından istenen ihtiyaçlar göz önüne alınmalıdır. Bu çalışan Hesaplama servisi sunuclarının, depolamanın ve bu servislerin üstüne çalışan ek servislerin kullanılırlığının sağlayan çekirdek servisleri içerir. Bu servisler genellikle Veri Düzlemi servisleri olarak adlandırılır, ve genellikle her zaman kullanılabilir olmaları beklenir.

source: When designing compute resource pools, consider the number of processors, amount of memory, network requirements, the quantity of storage required for each hypervisor, and any requirements for bare metal hosts provisioned through ironic.
tr_tr: Hesaplama kaynak havuzları tasarlarken, işlemci sayısını, hafıza miktarını, ağ gereksinimlerini, her bir hipervizör için gereken depolama miktarını, ve ironic üzerinden hazırlanan metal istemciler için gereksinimleri göz önüne alın.

source: When designing your cluster, you must consider durability and availability which is dependent on the spread and placement of your data, rather than the reliability of the hardware.
tr_tr: Kümenizi tasarlarken, dayanıklılık ve kullanılırlığı da göz önüne almalısınız, bu da donanımın güvenilirliğinden ziyade verinizin yerleştirmesine ve dağıtımına bağlıdır.

source: When running embedded object store methods, ensure that you do not instigate extra data replication as this may cause performance issues.
tr_tr: Gömülü nesne depolama yöntemleri kullanılırken, ek veri çoğaltma başlatmadığınızdan emin olun, bu başarım sorunlarına yol açabilir.

source: When selecting a processor, compare features and performance characteristics. Some processors include features specific to virtualized compute hosts, such as hardware-assisted virtualization, and technology related to memory paging (also known as EPT shadowing). These types of features can have a significant impact on the performance of your virtual machine.
tr_tr: Bir işlemci seçerken, özelliklerini ve başarım karakteristiğini karşılaştırın. Bazı işlemciler sanallaştırma sunucuları için iyileştirmeler içerir, örneğin donanım destekli sanallaştırma ve hafıza sayfalandırmayla ilgili özellikler (EPT gölgelendirme diye de bilinir). Bu tür özelliklerin sanal makinenizin başarımı üstünde hatrı sayılır etkisi olacaktır.

source: When selecting network devices, be aware that making a decision based on the greatest port density often comes with a drawback. Aggregation switches and routers have not all kept pace with ToR switches and may induce bottlenecks on north-south traffic. As a result, it may be possible for massive amounts of downstream network utilization to impact upstream network devices, impacting service to the cloud. Since OpenStack does not currently provide a mechanism for traffic shaping or rate limiting, it is necessary to implement these features at the network hardware level.
tr_tr: Ağ aygıtları seçerken, en yoğun bağlantı noktasını baz alarak yapacağınız seçimin genellikle sakıncaları olacaktır. Takım anahtarların ve yönlendiricilerin hepsi ToR anahtarlarıyla tempoyu tuttramadılar, bu da kuzey-güney trafiğinde dar boğazların oluşabileceği anlamına geliyor. Sonuç olarak çok büyük miktarda aşağı akış ağı kullanımının yukarı akış ağ aygıtlarını etkilemesi mümkündür, bu da bulut servisini etkiler. OpenStack şu an trafik şekillendirme veya oran sınırlandırma için bir mekanizma desteklemediğinden, bu özellikleri ağ donanımı seviyesinde uygulamak gereklidir.

source: When using the Networking service, the OpenStack controller servers or separate Networking hosts handle routing unless the dynamic virtual routers pattern for routing is selected. Running routing directly on the controller servers mixes the Data and Control Planes and can cause complex issues with performance and troubleshooting. It is possible to use third party software and external appliances that help maintain highly available layer three routes. Doing so allows for common application endpoints to control network hardware, or to provide complex multi-tier web applications in a secure manner. It is also possible to completely remove routing from Networking, and instead rely on hardware routing capabilities. In this case, the switching infrastructure must support layer three routing.
tr_tr: Ağ servisini kullanırken, dinamik sanal yönlendiriciler kalıbı seçilmezse OpenStack kontrol sunucuları veya ayrı Ağ sunucuları yönlendirmeyi ele alırlar. Yönlendirmeyi doğrudan kontrol sunucularında çalıştırmak Veri ve Kontrol Düzlemlerini karıştırır ve başarım ve hata ayıklamada karmaşıklıklara yol açabilirler. Yüksek kullanılırlıklı katman üç yönlendiricileri yönetmek için üçüncü taraf yazılımı ve harici uygulamalar kullanmak da mümkündür. Böyle yapmak genel uygulama uç noktalarının ağ donanımını kontrol etmesine veya birden çok aşamalı web uygulamalarını güvenli bir şekilde sağlamasına izin verir. Ağdan yönlendirmeyi tamamen kaldırmak ve yalnızca donanımla yönlendirmeye bel bağlamak da mümkündür. Bu durumda, anahtarlama alt yapısı katman üç yönlendirmeyi desteklemelidir.

source: Where instances and images will be stored will influence the architecture.
tr_tr: Sunucuların ve imajların nerede saklanacağı mimariyi etkiler.

source: Whereas the simplicity of layer-2 protocols might work well in a data center with hundreds of physical machines, cloud data centers have the additional burden of needing to keep track of all virtual machine addresses and networks. In these data centers, it is not uncommon for one physical node to support 30-40 instances.
tr_tr: Katman-2 iletişim kurallarının basitliği yüzlerce fiziksel makinenin olduğu fiziksel bir veri merkezinde iyi çalışsa da, bulut veri merkezleri bir de tüm sanal makine adresleri ve ağlarının izini sürmek zorundadır. Bu veri merkezlerinde bir fiziksel düğümün 30-40 sunucuyu desteklemesi yaygındır.

source: Whether you should enable Hyper-Threading on your CPUs depends upon your use case. For example, disabling Hyper-Threading can be beneficial in intense computing environments. We recommend performance testing with your local workload with both Hyper-Threading on and off to determine what is more appropriate in your case.
tr_tr: İşlemcilerinizde Hyper-Threading etkinleştirip etkinleştirmeyeceğiniz kullanım durumunuza bağlıdır. Örneğin, Hyper-Threading'i kapatmak yoğun hesaplama ortamlarında faydalı olabilir. Yerel iş yükünüzle Hyper-Threading açık ve kapalıyken denemeler yapmanızı ve uygun olan hangisiyse onu seçmenizi öneriyoruz.

source: Which storage choices result in the best cost-performance scenario I am aiming for?
tr_tr: Hedeflediğim masraf-başarım senaryosunda hangi depolama sonuçları en iyileri?

source: While consistency and partition tolerance are both inherent features of the Object Storage service, it is important to design the overall storage architecture to ensure that the implemented system meets those goals. The OpenStack Object Storage service places a specific number of data replicas as objects on resource nodes. Replicas are distributed throughout the cluster, based on a consistent hash ring also stored on each node in the cluster.
tr_tr: Tutarlılık ve bölüm tahammülü Nesne Depolama servisinin doğasında olan özellikler olsa da, genel depolama mimarisini kurulan sistemin hedeflerle eşleşmesi üzerine tasarlamak önemlidir. OpenStack Nesne Depolama servisi belirli sayıda veri yedeğini kaynak düğümlerde nesneler olarak saklar. Yedekler küme içinde yine kümedeki her bir düğümde kaydedilen tutarlı bir özet halkası baz alınarak dağıtılır.

source: While each enterprise install is different, the following networks with their proposed bandwidth is highly recommended for a basic production OpenStack install.
tr_tr: Her kurumun kurulumu farklı olsa da, temel OpenStack ürün kurulumunda aşağıdaki bant genişliği teklif edilen ağlar tavsiye edilir.

source: While not as common in large enterprises, compute host components can also be upgraded to account for increases in demand, known as vertical scaling. Upgrading CPUs with more cores, or increasing the overall server memory, can add extra needed capacity depending on whether the running applications are more CPU intensive or memory intensive. Since OpenStack schedules workload placement based on capacity and technical requirements, removing compute nodes from availability and upgrading them using a rolling upgrade design.
tr_tr: Büyük kurumlarda yaygın olmasa da, hesaplama sunucu bileşenleri istek halinde dikey ölçeklendirme denilen şekilde de yükseltilebilirler. Daha fazla çekirdeğe sahip işlemcilere yükseltme veya genel sunucu belleğini artırma, çalışan uygulamaların işlemci veya hafıza yoğunluklu olmaları durumunda gerekli ek kapasiteyi sağlayaiblir. OpenStack iş yükü yerleştirmesini kapasite ve teknik gereksinimlere göre yaptığından, hesaplama düğümlerini çıkarmak ve yuvarlanan yükseltme tasarımıyla güncellemek gerekir.

source: While our example contains all central services in a single location, it is possible and indeed often a good idea to separate services onto different physical servers. :ref:`table_deployment_scenarios` is a list of deployment scenarios we've seen and their justifications.
tr_tr: Örneğimiz tüm merkezi servisleri tek bir konumda içerse de, servisleri farklı fiziksel sunuculara ayırmak mümkündür ve çoğunlukla iyi bir fikirdir. :ref:`table_deployment_scenarios` gördüğümüz kurulum senaryolarının listesi ve gerekçeleridir.

source: While this is not a definitive list of all the questions possible, the list above will hopefully help narrow the list of possible storage choices down.
tr_tr: Bu sorulması gereken soruların tam bir listesi değil, ama mümkün depolama seçeneklerini azalatmanıza yardımcı olacağını umuyoruz.

source: Will the storage architecture scale linearly as the cloud grows and what are its limits?
tr_tr: Depolama mimarisi bulut büyüdükçe doğrusal olarak ölçeklenecek mi ve sınırları nelerdir?

source: With file-level storage, users access stored data using the operating system's file system interface. Most users who have used a network storage solution before have encountered this form of networked storage. The most common file system protocol for Unix is NFS, and for Windows, CIFS (previously, SMB).
tr_tr: Dosya-seviyesinde depolamayla, kullanıcılar kaydedilen veriye işletim sisteminin dosya sistemi arayüzüyle erişirler. Daha önce bir ağ çözümü kullanmış çoğu kullanıcı bu şekildeki ağ depolamanın bir biçimini kullanmıştır. Unix için en yaygın sistem iletişim kuralı NFS'dir, ve Windows için, CIFS'dir (önceden, SMB).

source: Within a VM
tr_tr: Bir VM

source: You can add adjunct networking features, for example class of service (CoS) or multicasting, to Ethernet as readily as IP networks.
tr_tr: Ethernete IP ağlarındaki kadar hazır şekilde ek ağ özellikleri ekleyebilirsiniz, örneğin servis sınıfı (CoS) veya çokluyayın.

source: You can configure layer-3 to use Border Gateway Protocol (BGP) confederation for scalability. This way core routers have state proportional to the number of racks, not to the number of servers or instances.
tr_tr: Katman-3'ü ölçeklenebilirlik için Sınır Geçidi İletişim Kuralı (BGP) birliği ile yapılandırabilirsiniz. Böylece çekirdek yönlendiriciler sunucu sayısına göre değil kabin sayısına oranlı durum bilgisine sahip olurlar.

source: You can implement networking in two separate ways. Legacy networking (nova-network) provides a flat DHCP network with a single broadcast domain. This implementation does not support tenant isolation networks or advanced plug-ins, but it is currently the only way to implement a distributed layer-3 (L3) agent using the multi-host configuration. The Networking service (neutron) is the official networking implementation and provides a pluggable architecture that supports a large variety of network methods. Some of these include a layer-2 only provider network model, external device plug-ins, or even OpenFlow controllers.
tr_tr: Ağı iki farklı şekilde uygulayabilirsiniz. Geleneksel ağ (nova-ağı) tek yayın alanı olan düz bir DHCP ağı sağlar. Bu uygulama kiracı yalıtım ağlarını veya gelişmiş eklentileri desteklemez, ama şu an çoklu sunucu yapılandırmasını kullanarak bir dağıtık katman-3 (L3) aracısı uygulamanın tek yoludur. Ağ servisi (neutron) resmi ağ uygulamasıdır ve çok çeşitli ağ yöntemlerini destekleyen tak-çıkar mimari sağlar. Bunlardan bazıları yalnızca katman-2 sağlayıcı ağ modeli, harici aygıt eklentileri, hatta OpenStack kontrolcüleridir.

source: You can scale to any number of spindles.
tr_tr: İstediğiniz sayıda mile ölçekleyebilirsiniz.

source: You can upgrade Block Storage pools to add storage capacity without interrupting the overall Block Storage service. Add nodes to the pool by installing and configuring the appropriate hardware and software and then allowing that node to report in to the proper storage pool through the message bus. Block Storage nodes generally report into the scheduler service advertising their availability. As a result, after the node is online and available, tenants can make use of those storage resources instantly.
tr_tr: Blok Depolama havuzlarını genel Blok Depolama servisini kesintiye uğratmadan güncelleyebilir ve kapasite eklyebilirsiniz. Havuza uygun donanım ve yazılımı yükleyerek düğümler ekleyin ve düğümün ileti yolu ile uygun depolama havuzuna raporlama yapmasını sağlayın. Blok Depolama düğümleri genellikle zamanlayıcı servisine kullanılırlıklarını iletirler. Sonuç olarak, düğüm çevrimiçi ve kullanılabilir olduğunda, kiracılar bu depolama kaynaklarını anında kullanabilir duruma gelirler.

source: You must accommodate the need to maintain a set of layer-4 devices to handle traffic control.
tr_tr: Trafik kontrolünü ele alması için bir grup katman-4 aygıtı barındırmanız gerekir.

source: You must balance the time required to build a new cloud platform against the time saved by migrating users away from legacy platforms. In some cases, existing infrastructure may influence your architecture choices. For example, using multiple cloud platforms may be a good option when there is an existing investment in several applications, as it could be faster to tie the investments together rather than migrating the components and refactoring them to a single platform.
tr_tr: Yeni bir bulu platformu inşa etmek için gerekli zamanı kullanıcıları eski platformlardan göç ettirmeyle kazanılacak zamanla dengelemelisiniz. Bazı durumlarda, mevcut alt yapı mimari seçeneklerinizi etkileyebilir. Örneğin, birden çok bulut platformu kullanmak, bir çok uygulamaya yapılmış mevcut yatırım varsa iyi biri seçenek olabilir, çünkü bileşenleri göç ettirmek ve tek bir platform düzenlemektense yatırımları beraber bağlamak daha hızlı olabilir.

source: You must choose whether you want to support the Amazon EC2 compatibility APIs, or just the OpenStack APIs. One issue you might encounter when running both APIs is an inconsistent experience when referring to images and instances.
tr_tr: Yalnızca OpenStack API'lerini mi Amazon EC2 uyumluluk API'lerini demi desteklemek istediğinize karar vermelisiniz. Her iki API'yi de çalıştırırken yaşayacağınız bir sorun imaj ve sunuculara başvururken yaşanacak tutarsız deneyimdir.

source: You must consider a number of important technical and business requirements when planning and designing an OpenStack network:
tr_tr: Bir OpenStack ağı tasarlarken bir takım önemli teknik ve iş gereksinimlerini göz önüne almalısınız:

source: You must select the appropriate CPU and RAM allocation ratio for your particular use case.
tr_tr: Kullanım durumunuza göre uygun CPU ve RAM ayırma oranlarını kendiniz seçmelisiniz.

source: You need to size the controller with a core per service.
tr_tr: Kontrol birimini servis başına bir çekirdek olacak şekilde boyutlandırmalısınız.

source: You should conduct a high availability risk analysis to determine whether to use redundant switches such as Top of Rack (ToR) switches. In most cases, it is much more economical to use single switches with a small pool of spare switches to replace failed units than it is to outfit an entire data center with redundant switches. Applications should tolerate rack level outages without affecting normal operations since network and compute resources are easily provisioned and plentiful.
tr_tr: Kabin Üstü (ToR) anahtarlar gibi yedekli anahtarlar kullanıp kullanmamanız gerektiğine karar vermek için bir yüksek kullanılırlık risk çözümlemesi yapmalısınız. Çoğu durumda, tüm veri merkezini yedekli anahtarlarla doldurmak yerine tekli anahtarlar kullanmak ve bir birimin arıza yapması halinde değiştirmek için yedek anahtarlar tutmak daha ekonomiktir. Ağ ve hesaplama kaynakları bol olduğundan ve kolayca hazırlandığından uygulamalar kabin seviyesinde kesintilere dayanıklı olmalı ve normal işlemeye devam etmelidir.

source: You should consider Ceph if you want to manage your object and block storage within a single system, or if you want to support fast boot-from-volume.
tr_tr: Nesne ve blok depolamanızı aynı sistemden yönetmek istiyorsanız, veya birimden hızlı önyüklemeyi desteklemek istiyorsanız Ceph kullanmayı gözden geçirmelisiniz.

source: You should consider designing the Object Storage system with a sufficient number of zones to provide quorum for the number of replicas defined. For example, with three replicas configured in the swift cluster, the recommended number of zones to configure within the Object Storage cluster in order to achieve quorum is five. While it is possible to deploy a solution with fewer zones, the implied risk of doing so is that some data may not be available and API requests to certain objects stored in the cluster might fail. For this reason, ensure you properly account for the number of zones in the Object Storage cluster.
tr_tr: Tanımlanan sayıda yedek için gerekli çoğunluğu sağlamak için yeterli sayıda bölgeye sahip bir Nesne Depolama sistemi tasarlamaya dikkat etmelisiniz. Örneğin üç yedek ile yapılandırılmış bir swift kümesinde Nesne Depolama kümesi ile gerekli çoğunluğu sağlamak için yapılandırılması gereken tavsiye edilen bölge sayısı beştir. Daha az sayıda bölge ile bir çözüm kurmak da mümkünken, bunu yapmanın riski bazı verilerin kullanılabilir olmamasını ve bazı nesnelere yapılan API isteklerinin başarısız olmasını beraberinde getirebilir. Bu sebeple Nesne Depolama kümesinde yeterli bölge olduğundan emin olmalısınız.

source: You should consider using the OpenStack Object Storage service if you eventually plan on distributing your storage cluster across multiple data centers, if you need unified accounts for your users for both compute and object storage, or if you want to control your object storage with the OpenStack Dashboard. For more information, see the `Swift project page <https://www.openstack.org/software/releases/ocata/components/swift>`_.
tr_tr: Depolama kümenizi birden çok veri merkezi arasında dağıtmayı düşünüyorsanız, hem hesaplama hem nesne depolama için kullanıcılarınız için tekil hesaplara ihtiyacınız varsa, veya nesne depolamanızı OpenStack Kontrol Paneli ile kontrol etmek isterseniz OpenStack Nesne Depolama servisini kullanmayı düşünmelisiniz.

source: Zone per collection of nodes
tr_tr: Düğüm topluluğu başına bölge

source: ``Sled servers`` are rack-mounted servers that support multiple independent servers in a single 2U or 3U enclosure. These deliver higher density as compared to typical 1U or 2U rack-mounted servers. For example, many sled servers offer four independent dual-socket nodes in 2U for a total of eight CPU sockets in 2U.
tr_tr: ``Sled sunucular`` tek bir 2U veya 3U alanında birden çok bağımsız sunucu destekleyen kabine-bağlı sunuculardır. Bunlar tipik 1U veya 2U kabine-bağlı sunuculara göre yüksek yoğunluk sunarlar. Örneğin çoğun sled sunucu 2U'da dört bağımsız çift-soket düğüm, toplam sekiz işlemci soketi sunarlar.

source: authentication, authorization, and auditing (AAA)
tr_tr: kimlik doğrulama, yetkilendirme, ve denetleme (AAA)

source: date
tr_tr: tarih

source: east-west traffic
tr_tr: doğu-batı trafik

source: environmental considerations
tr_tr: ortam etmenleri

source: federal legal requirements
tr_tr: birleşik yasal gereklilikler

source: file
tr_tr: dosya

source: floor space
tr_tr: yer boşluğu

source: floor weight
tr_tr: yer ağırlığı

source: iSCSI is suitable for cloud environments with Block Storage service to support applications or for file sharing systems. Network connectivity can be achieved at a lower cost compared to other storage back end technologies since iSCSI does not require host bus adaptors (HBA) or storage-specific network devices.
tr_tr: iSCSI uygulamaları desteklemek için Blok Depolama servisi olan veya dosya paylaşım sistemli bulut ortamları için uygundur. Ağ bağlanılırlığı diğer depolama arka uç teknolojilerine göre düşük masrafla elde edilebilir, çünkü iSCSI depolamaya özel ağ aygıtları ya da sunucu yolu adaptörlerine (HBA) ihtiyaç duymaz.

source: image consistency and availability
tr_tr: imaj tutarlılığı ve kullanılırlığı

source: local jurisdictional legal and compliance requirements
tr_tr: yerel yargı yasası ve uyum gereksinimleri

source: north-south traffic
tr_tr: kuzey-güney trafik

source: physical security
tr_tr: fiziksel güvenlik

source: power usage and power usage efficiency (PUE)
tr_tr: güç kullanımı ve güç kullanım etkinliği (PUE)

source: rack height and type
tr_tr: kabin yüksekliği ve türü
